<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
              "http://www.w3.org/TR/REC-html40/loose.dtd">
<head><title>CD-ROM</title></head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://pauillac.inria.fr/~ddr/GeneWeb/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Erstellen einer CD-ROM</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Du kannst eine CD-ROM deiner Datenbank inklusive <font
color=#2f6400><b>GeneWeb</b></font> erstellen: dies erlaubt dir die Verteilung
deiner Datenbank, so dass diese sofort verwendet werden kann.

<p>

Dieses Kapitel erkl&auml;rt die minimalen Schritte um das zu bewerkstelligen. Diese
Installation hat den Vorteil, dass der Nutzer nichts auf seiner Festplatte
installieren mu&szlig;, weder die Software noch die Datenbank.

<p>

Hier sind die notwendigen Schritte:

<p>

<ol>

<li> F&uuml;hre eine gr&uuml;ndliche S&auml;uberung deiner Datenbank durch. Wenn m&ouml;glich, verwende gwsetup:
schaue in dessen "Hauptmenu". Du kannst das auch mit den Befehlen gwu
und gwc machen (gwu extrahiert die Datenbank als Quelltext und gwc erzeugt sie wieder 
neu).

<p>

<font size=-1>Anmerkung: dieser Schritt ist nicht absolut notwendig, aber er erlaubt
die Verteilung einer Datenbank, welche nach Speicherplatz und Zugriffsgeschwindigkeit
optimiert ist. Wenn jedoch deine Datenbank aus einer GEDCOM-Datei oder
von einer <font color=#2f6400><b>GeneWeb</b></font>-Quelldatei stammt und 
du hast keine &Auml;nderungen an deiner Datenbank gemacht, dann ist das unn&uuml;tz.</font>

<p>

<li> Wenn du m&ouml;chtest, dass die Blutsverwandtschaften auf den Personenseiten
und in den Verwandtschaftsbeziehungen angezeigt werden, dann starte das Programm zur
Initialisierung der Blutsverwandtschaften. Unter gwsetup: siehe "Hauptmenu".
Im Eingabefenster geht das mit dem Befehl consang.

<p>

<font size=-1>Anmerkung: dieser Schritt ist ebenfalls optional. Wenn du diesen nicht ausf&uuml;hrst,
funktioniert die Anzeige der Verwandtschaftsbeziehungen trotzdem, aber die Blutsverwandtschaften werden nicht
angezeigt.</font>

<p>

<li> Benutze deine Datenbank und la&szlig; irgendeine Verwandtschaftsbeziehung berechnen,
zum Beispiel zwischen Vater und seinem Sohn.

<p>

<font size=-1>Anmerkung: das ist ebenfalls ein optionaler Schritt zur Optimierung
des Zugriffs auf die Datenbank. Tats&auml;chlich erzeugt die erste Berechnung einer Verwandtschaftsbeziehung
eine Datei (namens tstab) in der Datenbank, welche die Verwandtschaftsberechnungen zuk&uuml;nftig
beschleunigt. Wenn diese Datei nicht angelegt wurde, wird
dies auf der CD-ROM nicht m&ouml;glich sein und die Verwandtschaftsberechnungen werden
langsamer sein.</font>

<p>

<li> Erzeuge ein Verzeichnis, wo du die Sachen hineinkopierst, welche
auf deine CD-ROM sollen. Dieses Verzeichnis wird in der folgenden Erl&auml;uterung mit "Ziel"
bezeichnet.

<p>

<li> &Uuml;bertrage deine Datenbank ins Zielverzeichnis: deine Datenbank ist das
Verzeichnis mit der Endung ".gwb". Wenn deine Datenbank zum Beispiel
"xyz" hei&szlig;t, so ist das Verzeichnis "xyz.gwb". Dieses Verzeichnis befindet sich
im Datenbankverzeichnis (abh&auml;ngig von deiner Installation: Windows,
MacOS X, Unix, Linux rpm, Linux Debian...)

<p>

<li> Kopiere eine Konfigurationsdatei ins Zielverzeichnis. Wenn du
eine passende hast, verwende diese, ansonsten lege eine an. Die
Konfigurationsdatei ist eine Textdatei mit der Endung ".gwf": wenn deine Datenbank
"xyz" hei&szlig;t, dann hei&szlig;t die Datei "xyz.gwf". Wenn die Datei bereits existiert, 
dann ebenfalls im Datenbankverzeichnis.

<p>

Trage in diese Datei ein falsches "Wizard"-Passwort ein, durch Hinzuf&uuml;gen der Zeile:

<pre>
     wizard_passwd=a
</pre>

<p>

<font size=-1>Anmerkung: dieser Schritt ist optional, aber damit kann vermieden werden,
dass das "Aktualisieren" auf den Personenseiten angeboten wird, was
auf einem Nur-Lese-Datentr&auml;ger sowieso nicht funktioniert. Achtung: wenn du eine
Konfigurationsdatei anlegst, &uuml;berpr&uuml;fe zweimal, dass die Endung ".txt" <em>nicht</em>
angeh&auml;ngt wird, wie das einige Betriebssysteme dummerweise automatisch machen: die Endung muss .gwf sein
und nichts anderes.</font>

<p>

<li> Kopiere das Programm "gwd" ins Zielverzeichnis. Bei einigen Systemen hat es
die Endung ".exe". Achtung: es k&ouml;nnte mehrere Dateien
namens "gwd" in deiner <font color=#2f6400><b>GeneWeb</b></font>-
Installation geben.  Das richtige ist eine ziemlich gro&szlig;e Datei (mehr als 1 Mb). Es
befindet sich im Allgemeinen im Verzeichnis "gw".

<p>

<li> Kopiere die Verzeichnisse "lang", "etc" und "images" (samt Inhalt) ins Zielverzeichnis,
sie finden sich im gleichen Verzeichnis, wo du "gwd(.exe)"
gefunden hast.

<p>

<font size=-1>Anmerkung: Das Vorhandensein dieser Verzeichnisse ist obligatorisch.
Sie enthalten alle Dateien, die von gwd verwendet werden, v. a. f&uuml;r alle Sprachen
und f&uuml;r die Anzeige einiger Seiten.</font>

<p>

<li> Im Verzeichnis "lang" im Zielverzeichnis, editiere die
Datei namens "start.txt" und l&ouml;sche die Gruppe von Zeilen, welche
die Links f&uuml;r den "Wizard"-Zugang enthalten. Diese fangen etwa so an:

<pre>
   &lt;td align=center&gt;[
   af: &lt;a href="%sw=w"&gt;&lt;em&gt;Medewerkers&lt;/em&gt;&lt;/a&gt; toegang&lt;br&gt; (password)
   ca: acc&eacute;s &lt;a href="%sw=w"&gt;&lt;em&gt;administrador&lt;/em&gt;&lt;/a&gt;&lt;br&gt; (clau)
</pre>

und enden mit:

<pre>
   pl: &lt;a href="%sw=w"&gt;&lt;em&gt;"Wizard"&lt;/em&gt;&lt;/a&gt; dostêp&lt;br&gt; (has³o)
   pt: Entrada &lt;a href="%sw=w"&gt;&lt;em&gt;feiticeiro&lt;/em&gt;&lt;/a&gt;&lt;br&gt; (palavra chave)
   sv: &lt;a href="%sw=w"&gt;&lt;em&gt;Uppdaterings&lt;/em&gt;&lt;/a&gt; tilltr&auml;de&lt;br&gt; (passord)
   ]&lt;br&gt;&lt;/td&gt;
</pre>

<p>

<font size=-1>Dieser Schritt ist nicht obligatorisch, verhindert aber, dass
die Willkommen-Seite den "Wizard"-Zugang anbietet, welcher sowieso nicht funktionieren w&uuml;rde.</font>

<p>

<li><b>Wichtiger Schritt</b>. Das Programm gwd erzeugt Dateien im
aktuellen Verzeichnis. Wenn dies nicht funktioniert, kann das dessen Funktion blockieren (v. a.
unter Windows wird es sicher nicht funktionieren). Es muss eine Option angegeben
werden, damit die Festplatte daf&uuml;r verwendet wird (merke: diese Dateien
sind nicht gro&szlig;, sind tempor&auml;r, und wenn sie aus Versehen oder mit Absicht
gel&ouml;scht werden, wird das "gwd" nicht st&ouml;ren).

<p>

Erzeuge dazu eine Textdatei namens "gwd.arg" (Vorsicht: nicht "gwd.arg.txt"
sondern nur "gwd.arg") und schreibe ff. hinein:

<pre>
   Wenn du eine CD-ROM f&uuml;r Windows erzeugst:
          -wd
          c:\temp\geneweb
   Wenn die CD-ROM f&uuml;r Unix oder MacOS X ist:
          -wd
          /tmp/geneweb
</pre>

<p>

<li>Wenn deine Datenbank Bilder hat, kopiere diese in das Verzeichnis "images"
ins Unterverzeichnis mit dem Namen deiner Datenbank ("images/xyz" wenn
deine Datenbank "xyz" hei&szlig;t).

<p>

<li> Nach all diesen Schritten hast du eine minimale Installation, die es
dem Nutzer &uuml;berl&auml;&szlig;t, gwd selbst zu starten und die URL zum Zugriff
auf die Datenbank einzugeben. Du kannst das verbessern, indem du HTML-Dateien und/oder
Shell-/Batch-Skripte erzeugst, welche dies alles starten. Du kannst auch mehrere Datenbanken,
andere HTML-Dateien etc. hinzuf&uuml;gen.

<p>

<font size=-1>

Frag mich nicht, wie du eine CD-ROM erstellst, die das alles automatisch macht,
wenn du sie ins Laufwerk legst: es gibt sicher Tricks, um das zu machen, aber ich kenne diese nicht.

<p>

Anmerkung: wenn du m&ouml;chtest, dass deine Datenbank unter anderen
Betriebssystemen als dem von dir verwendeten funktioniert, kannst du ein Verzeichnis f&uuml;r
jedes System anlegen und die entsprechende Version von "gwd" hineinkopieren. Nat&uuml;rlich
musst du die Versionen von <font color=#2f6400><b>GeneWeb</b></font>
f&uuml;r alle diese Systeme heruntergeladen haben. Du musst auch die "gwd.arg"-Dateien beachten
(eine pro gwd-Datei) und vor allem den Pfad zur Datenbank eintragen
(die Optionen -hd und -bd von "gwd").

</font>

<p>

<li>Vor dem Brennen der CD, f&uuml;hre einen Test durch. &Auml;ndere dazu die Zugriffsrechte
des Zielverzeichnisses und all seiner Verzeichnisse und Dateien auf:
"Schreibgesch&uuml;tzt". Dann starte den Befehl "gwd" (durch Doppelclick oder
durch Eingabe im Eingabefenster). &Ouml;ffne in deinem Webbrowser die Adresse
http://127.0.0.1:2317/xyz (wenn deine Datenbank xyz hei&szlig;t) und &uuml;berpr&uuml;fe
ob diese funktioniert.

<p>

<li>Wenn alles funktioniert, erzeuge deine CD-ROM mit dem Zielverzeichnis und seinem Inhalt.

</ol>

<p>

<p>
<hr>
<br>
<center>Return to <a href="diruse.htm">Directions for Use</a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2005 INRIA -
GeneWeb</em></font><br>

</body>
