<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
              "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>Hdufig gestellte Fragen</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://opensource.geneanet.org/projects/geneweb/"><img 
 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - H&auml;ufig gestellte Fragen</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

<h4>Beim ersten Start von GeneWeb erhalte ich die Mitteilung: Cannot access
file "start.txt".</h4>

Siehe in die Dokumentation: "L&ouml;sungen zu oft auftretenden
<a href="problem.htm">Problemen</a>".
Wenn das nicht funktioniert, bitte mir mitteilen.

<h4>Unter Windows funktioniert &uuml;berhaupt nichts!</h4>
 
Zuerst solltest du folgendes kontrollieren: L&auml;uft das Programm "gwsetup" no
ch,
welches du gerade gestartet hast? Denn damit alles funktioniert, muss gwsetup
laufen. Wenn dieses Programm in einem Fenster gelaufen ist, und du hast dieses
Fenster geschlossen, so kann das nicht funktionieren. Wenn dies dein Problem
ist, so starte gwsetup nochmals mit Doppelklick, gib nochmal deine bevorzugte
Sprache ein, aber schliesse diesmal das Fenster nicht!

<p>

Das gleiche Problem gibt es betreffs des Programms gwd, welches den Zugriff auf 
deine
Datenbank erlaubt: du startest es durch Doppelklick und darfst es nicht anhalten
, 
w&auml;hrend du in deiner Datenbank navigierst.
 
<p>                                                                             

Es kann passieren, da&szlig; Windows "localhost" nicht aufl&ouml;sen kann. 
Versuche "localhost" durch "127.0.0.1" zu ersetzen (was als &auml;quivalent
angesehen werden kann) in der angezeigten Adresse, z. B.:
 
<pre>
   http://127.0.0.1:2316/
</pre>
 
<p>

Andererseits ist ein h&auml;ufiges Problem, dass dein Web-Browser, wenn eine 
Webadresse eingegeben wird (http://...), eine Verbindung zum Netzwerk
aufzubauen versucht und aufgibt, wenn die Modemverbindung getrennt ist. Das 
ist ein Fehler von Windows, denn da die Adresse "localhost" hei&szlig;t, sollte 
es 
nicht versuchen, eine Verbindung aufzubauen: "localhost" hei&szlig;t "dein 
eigener Rechner".

<p>
 
Das h&auml;ngt damit zusammen, dass zu deinem Internet-Provider eine
automatische
Verbindung installiert wurde. Diese automatische Verbindung ist verantwortlich
f&uuml;r dieses Ph&auml;nomen. Eine L&ouml;sung ist daher,
diese abzustellen. Suche in einem Menu, welches "Einstellungen" oder
"Optionen" oder "Konfiguration" hei&szlig;t, nach einer Stelle, wo eine
automatische
Verbindung zu sehen ist, und trenne diese.
 
<p>
 
Eine andere L&ouml;sung besteht darin, einen anderen Web-Browser zu benutzen:
Wenn
dein Internet-Provider den "Internet Explorer" auf dem Computer installiert hat,
verwende Netscape. Wenn Netscape installiert wurde, verwende den Internet
Explorer.
 
<p>
 
Eine dritte L&ouml;sung ist, das Modem w&auml;hlen zu lassen und auf die
Internetverbindung zu warten. Funktioniert es, wenn diese aufgebaut ist? Wenn ja
,
so sind wir sicher, dass es sich um dieses Problem handelt. Wird die
Modem-Verbindung
wieder getrennt, funktioniert es meist auch weiterhin. Nat&uuml;rlich ist das
nicht sehr zufriedenstellend, denn man muss immer erst die Internetverbindung
aufbauen, um <font color=#2f6400><b>GeneWeb</b></font> zu nutzen, auch wenn das
nur f&uuml;r 10 Sekunden ist.
 
<p>
 
Information eines Nutzers (Paul Laredo, vielen Dank an ihn):                    
       
<p>
 
<ol>
 
<li>starte gwsetup (oder gwd)
 
<li>starte deinen Webbrowser
 
<li>stoppe die automatische Verbindung mit dem Provider
 
<li>gib die Adresse des Dienstes ein
 
<li>wenn eine Meldung ausgegeben wird, dass die Seite offline nicht 
verf&uuml;gbar
ist, darfst du nicht auf "offline bleiben" klicken, sondern auf "Verbinden".
 
</ol>
 
<p>                                                                             

<h4>Meine Genealogie-Software sagt mir, da&szlig; die Datenbank 3000 Individuen
enth&auml;lt, aber GeneWeb sagt: 3050 Individuen. Warum dieser Unterschied?</h4>

In <font color=#2f6400><b>GeneWeb</b></font> werden Eltern immer als Paar
gespeichert. Wenn es nur
einen Vater oder nur eine Mutter in der GEDCOM-Datei gibt,
f&uuml;gt <font color=#2f6400><b>GeneWeb</b></font> 
automatisch das andere Elternteil hinzu, indem es ihr oder ihm ein Fragezeichen
als Vor- und Zunamen gibt. Die Differenz resultiert aus genau diesen
fehlenden Elternteilen (die aber existiert haben).


<h4>Wenn man Verwandtschaftsbeziehungen anzeigt, fehlen einige.</h4>

Um zu vermeiden, dass die Liste der Verwandtschaftsbeziehungen zu lang wird, 
l&ouml;scht <font color=#2f6400><b>GeneWeb</b></font> einige von diesen, wenn
das Ergebnis angezeigt wird. Daf&uuml;r wird die folgende Methode genutzt: Wenn 
eine
Verwandtschaftsbeziehung gefunden wird mit einem gemeinsamen Vorfahren, werden
alle
Vorfahren dieses Vorfahren von der Suche ausgenommen.
 
<p>
 
Eine Konsequenz dieser S&auml;uberung ist, dass, wenn jemand nach der Berechnung
einer Verwandtschaftsbeziehung mit einem Vorfahren fragt, dieser nur als ein
Vorfahre
angezeigt wird, auch wenn er manchmal genauso ein Cousin sein k&ouml;nnte.
 
<p>
 
Wenn zum Beispiel mein Vater und meine Mutter Cousins w&auml;ren und ich nach
der Verwandtschaftsbeziehung mit meiner Mutter suche, wird nur angezeigt,
dass ich ihr Sohn bin, nicht dass ich der Sohn ihres Cousins bin, auch wenn
diese Beziehung tats&auml;chlich existiert.
 
<p>
 
Das S&auml;ubern ist notwendig: Ohne dieses wird die Anzeige - bei etwas
"vermischten"
Familien - schnell mit einer Menge Verwandtschaftsbeziehungen durchsetzt und
eventuell unverst&auml;ndlich (ich habe das getestet).
 
<p>
 
Die nicht angezeigten Verwandtschaftsbeziehungen sind jedoch reale
Verwandtschaftsbeziehungen
und werden bei der Blutverwandtschaftsberechnung mit gez&auml;hlt.
 
<p>                                                                             

<h4>Im CGI-Modus erhalte ich immer nur die Meldung "Internal Server Error"</h4>

Ein h&auml;ufiges Problem entsteht durch die Zugriffsrechte. Der Webserver 
arbeitet oftmals
CGIs nur als ein Nutzer mit sehr wenig Rechten ab (typischerweise als Nutzer
"nobody" 
unter Unix). Dieser kann m&ouml;glicherweise "gwd" nicht starten. Kontrolliere
die Zugriffsrechte
von "gwd" und allen <font color=#2f6400><b>GeneWeb</b></font>-Dateien!

<p>
<h4>Warum wird das Alter von Personen von mehr als 80 Jahren nicht angezeigt?
Warum sind sie nicht in der Statistik der &auml;ltesten Personen?</h4>
 
In <font color=#2f6400><b>GeneWeb</b></font> hat die Anzeige des Todes
drei Zust&auml;nde: "lebend", "tot" und "unbekannt". Das Alter wird nur
angezeigt  f&uuml;r "lebend" (noch lebende) Personen. Wenn das Alter nicht
da ist, ist der Grund, dass entweder die Person tot ist (ohne Angabe des Datums)
,
oder die Angabe ist "unbekannt".
 
<p>
 
Wenn diese Person mit <font color=#2f6400><b>GeneWeb</b></font> hinzugef&uuml;gt
wurde und es wurde nicht angegeben, ob er/sie lebendig oder tot ist, oder wenn
deine Datenbank aus einer GEDCOM-Datei stammt (die Angabe "noch lebende Person" 
existiert nicht im Standard GEDCOM 5.5), verwendet
<font color=#2f6400><b>GeneWeb</b></font>
den folgenden Algorithmus:
 
<ul>
 
<li>wenn die Person weniger als 80 Jahre alt ist, wird er/sie als "lebend" angez
eigt.
 
<li>wenn er/sie mehr als 120 Jahre alt ist, wird er/sie als "tot" angezeigt.
 
<li>zwischen den beiden Altersstufen wird sein/ihr Alter als "unbekannt"
angezeigt.
 
</ul>
 
Du mu&szlig;t diese Angaben korrigieren, wenn sie falsch sind.               
          
<p>
 
<h4>Die Personen, welche ein ? (Fragezeichen) als Vorname und/oder Nachname
haben, scheinen eine besonderen Status zu haben. Welchen und warum?</h4>
 
Diese Personen werden von <font color=#2f6400><b>GeneWeb</b></font> als "totes
Ende" 
betrachtet: wenn es Kinder sind, k&ouml;nnen sie keine Ehegatten sein,
wenn sie Ehegatten sind, k&ouml;nnen sie keine Eltern haben. Und sie
k&ouml;nnen keine verkn&uuml;pften Notizen haben.
 
<p>
 
Weiterhin werden sie, wenn sie Ehegatten sind, nicht in die GEDCOM-Dateien
exportiert, und ihre pers&ouml;nlichen Informationen (wenn vorhanden) gehen
konsequent verloren.
 
<p>
 
Es ist manchmal - durch Hacken - m&ouml;glich, ihnen Notizen zu geben oder
sie zu verbinden, aber Vorsicht: beim ersten Aufr&auml;umen der Datenbank
verschwinden diese Notizen und die Verbindungen: Es ist daher angeraten, dies
nicht zu tun.
 
<p>
 
Der Vor-/Nachname "?" ist in <font color=#2f6400><b>GeneWeb</b></font>
"reserviert". Du
darfst daher Personen nicht so benennen wenn du willst, dass diese Personen
zum Rest der Datenbank verbindbar sind oder Notizen oder Beziehungen
zugewiesen werden k&ouml;nnen (Taufeltern, Adoptiveltern oder Kinder usw.).
Die L&ouml;sung besteht darin, diese Personen zu editieren und ihre Vor- oder
Nachnamen zu etwas anderem zu &auml;ndern: trage "N", "Ne", "N...", "x",
"??" oder was du willst ein, aber nicht nur "?".
 
<p>

<h4>K&ouml;nnte die "Erweiterte Suche" durch dies oder jenes verbessert werden? 
</h4>
 
Die "erweiterte Suche" ist ein Hack, den ich programmiert habe, der aber
nicht sehr zufriedenstellend ist. Da <font color=#2f6400><b>GeneWeb</b></font> 
kein richtiges
Datenbanksystem verwendet, w&uuml;rde jede Verbesserung dieses Teils darin
bestehen, ein neues Datenbanksystem zu programmieren, was ich nicht vor habe zu 
machen,
weil das eine riesige Arbeit ist.
 
<p>
 
Wenn <font color=#2f6400><b>GeneWeb</b></font> eines Tages ein richtiges
Datenbanksystem verwendet (das ist eine der m&ouml;glichen Richtungen), wird
die erweiterte Suche vermutlich umgeschrieben und viel leistungsf&auml;higer
und leicht zu verwenden sein.
 
<p>
 
<h4>W&auml;re es m&ouml;glich, eine komplette Anzeige der Vorfahren zu haben,
wenn auch mit Wiederholungen der Sosa-Nummern?</h4>
 
Ich wei&szlig;, dass das n&uuml;tzlich w&auml;re, aber es gibt da gro&szlig;e
Probleme. Ich
habe bereits mit diesem Feature experimentiert, aber mir wurde klar, dass
f&uuml;r Personen,
die viele Vorfahren haben, die Anzeige voll mit Referenzen zu anderen Vorfahren 
und unlesbar wird. Au&szlig;erdem verursacht das mehr Berechnungen
("exponentieller Algorithmus").
 
<p>
 
Wenn du wissen willst, ob eine Vorfahrenlinie komplett ist, betrachte
das Problem einfach aus der anderen Richtung unter Verwendung der 
"fehlenden Vorfahren".
 
<p>                                                                             

<h4>Was ist die Konvention f&uuml;r die Anzeige des Kurzdatums?</h4>
 
<pre>
     Schmidt 1935-1950 = geboren in 1935, gestorben in 1950
     Schmidt 1935-     = geboren in 1935, nicht tot (noch lebend)
     Schmidt 1935 +    = geboren in 1935, gestorben mit unbekanntem Datum
     Schmidt *1935     = geboren in 1935, unbekannt ob tot oder nicht
     Schmidt +1950     = gestorben in 1950, unbekanntes Geburtsdatum
 
        /1935        = vor 1935
        1935/        = nach 1935
        ca 1935      = um 1935
                       vermutlich in 1935
        1935/1938    = in 1935 oder in 1938
                       zwischen 1935 und 1938
</pre>
 
Diese Konvention bezieht sich nicht auf einen spezifischen "Standard". Wenn du
eine bessere, besser bekannte, standardm&auml;&szlig;igere Konvention kennst,
z&ouml;gere nicht, mir das mitzuteilen. Danke.
 
<h4>W&auml;re es m&ouml;glich, mehr Information &uuml;ber Personen in
den "Familien"-Aktualisierungsformularen anzugeben, um schneller zu werden?</h4>
 
Das w&auml;re sicherlich nett, aber ich mag keine Dinge mehr hinzuf&uuml;gen.
Je mehr ich hinzuf&uuml;ge, um so mehr fragen mich die Leute danach. Am Anfang
habe ich nur den Namen der Person eingetragen, dann wurde ich gefragt, die Daten
einzutragen, ich trug die Daten ein, dann die Orte, ich trug die Orte ein, dann
fragten mich die Leute nach der Datumsgenauigkeit, der Besch&auml;ftigung usw.
All diese Informationen vergr&ouml&szlig;ern dieses Familienformular,
welches wirklich schon ziemlich kompliziert ist.
 
<p>
                                                                                
Ich wei&szlig;, dass es erm&uuml;dend ist, f&uuml;r jede hinzugef&uuml;gte
Person zum "Personen"-Formular zur&uuml;ck zu gehen,
aber ich bin nicht sicher, ob es eine gute
L&ouml;sung ist, wieder und wieder Dinge zu erg&auml;nzen. Das ist auch ein
HTML-eigenes Problem, da HTML nicht sehr "dynamisch" ist. Ich bin jedoch
pers&ouml;nlich
gegen L&ouml;sungen, die Java verwenden (Risiko von Sicherheitsl&ouml;chern)
und JavaScript (unter anderem eine Sprache, die  - neben anderen Problemen -
f&uuml;r
Werbung vereinnahmt wird). Andere L&ouml;sungen werden untersucht, sind aber
nicht einfach zu implementieren.
 
<h4>In einem Aktualisierungsformular habe ich einige Felder ausgef&uuml;llt,
aber sie verschwinden</h4>
 
Einige Felder werden nur in manchen F&auml;llen in Betracht gezogen. Wenn eine
Person als "lebend" gekennzeichnet ist, werden die Felder "Datum" und 
"Ort" des Todes ignoriert. Ist in einem "Familien"-Formular das Feld "getrennt
lebend" 
ausgew&auml;hlt, wird das Feld "Scheidungsdatum" ignoriert. Wenn die Anzeige
einer Person
auf "Verbinden" (anstelle von "Erzeugen") steht, werden die Felder zu 
Geschlecht, Datum und Ort ignoriert, usw.
 
<p>
 
Im allgemeinen werden bei dieser Art von Formularen die Auswahlen bewertet oder
verworfen, wenn man diese oder jene Taste dr&uuml;ckt. Es ist nicht
m&ouml;glich,
so etwas zu programmieren, entsprechend der Tatsache, dass
<font color=#2f6400><b>GeneWeb</b></font>
auf pures HTML limitiert ist: JavaScript sollte verwendet werden, was aber
meinen
Prinzipien widerspricht (siehe die Frage zum Familien-Aktualisierungsformular).
 
<p>

<h4>Wenn ich eine Suche mit Ort/Nachname durchf&uuml;hre und wenn das Resultat
mehrere Personen zu einem Nachnamen ergibt, ist nur die erste anklickbar</h4>

Das stimmt. In einer ersten Version habe ich einen Link zu dem Nachnamen selbst
gemacht und nicht zu einer Person, aber wenn mehrere Personen zu dem Nachnamen
geh&ouml;ren, wei&szlig; man nicht, wer davon zu diesem Ort geh&ouml;rt und es
ist schwer, diesen zu finden.

<p>

Die erste Person anzugeben ist wesentlich mehr "informativ". Ja, das ist
unvollst&auml;ndig, und richtig w&auml;re, eine Liste aller Personen zu haben,
die zu diesem Ort geh&ouml;ren, aber das h&auml;tte vorausgesetzt, dass ich
noch einige weitere Dinge programmiere, und es h&auml;tte den Nachteil, dass
die Suche wesentlich mehr Speicher verbrauchen w&uuml;rde.

<p>                                                                             

<h4>Wenn ich auf meiner Datenbank suche, bekomme ich manchmal die 
Fehlermeldung
"Schleife in der Datenbank: Jemand ist sein/ihr eigener Vorfahr"</h4>


Deine Datenbank wurde wahrscheinlich aus einer GEDCOM-Datei &uuml;bernommen
(der Fehler kann bei Datenbasen, die unter
<font color=#2f6400><b>GeneWeb</b></font> erzeugt wurden, nicht
auftreten).
Beim Import wurde dieser Fehler festgestellt, aber die Datenbasis
wurde trotzdem erzeugt. Allerdings k&ouml;nnen einige Funktionen nicht
arbeiten, wie z. B. die Verwandschaftsberechnung oder die
Vorfahrenanzeige.

<p>
Um das Problem zu beheben, musst du wissen, welche Person oder
Personen betroffen sind. Erzeuge deine Datenbasis neu aus der
GEDCOM-Datei (falls du deine Datenbank seitdem schon ge&auml;ndert
hast, kannst du sie jetzt unter einen anderen Namen anlegen um zu
vermeiden, dass du sie &uuml;berschreibst).
Wenn du interaktive Kommandos verwendest, schau dir das Ergebnis
von "ged2gwb" an. Wenn du <a href="gwsetup.htm">gwsetup</a> benutzt,
geh nach dem Import ins Hauptmen&uuml; und klicke auf 
"Trace-Ausgaben des letzten Kommandos".
Die Personen, die ihre eigenen Vorfahren sind, werden (in Englisch)
mit der Meldung
"<em>Soundso</em> is his/her own ancestor" angezeigt.

<p>

                                                                                
<h4>Ich habe "Lemieux" eingegeben und "Louis Maheux" wurde angezeigt</h4>

<p>

<font color=#2f6400><b>GeneWeb</b></font> verwendet eine Rechtschreibkorrektur, 
die tats&auml;chlich manchmal seltsame Ergebnisse
bringen kann. Diese Korrektur wird auf Vornamen, Nachnamen und komplette Namen
angewendet.

<p>

Wenn du einen Namen eingibst, sucht <font color=#2f6400><b>GeneWeb</b></font>,
ob dieser wie eingegeben existiert. Ansonsten
sucht es nach n&auml;herungsweisen Antworten. Dazu vereinfacht es den Namen nach
 folgenden Regeln:

<p>

<ul>

<li>L&ouml;schen aller Vokale und H
<li>Ersetzen aller K und Q durch C
<li>Ersetzen aller Z durch S
<li>Ersetzen aller PH durch F
<li>L&ouml;schen aller Endungen auf -S
<li>L&ouml;schen aller doppelten Konsonanten

</ul>

Dadurch hat der Vorname "John Charles" die Kennung: "JN CRL" - die gleiche
Kennung wie bei "Juan Carlos", "Jean Charles"
und "Johann Karl". Wenn du nach "John Charles of Bourbon" suchst, kannst Du
"Juan Carlos de Borb&oacute;n" finden 
(die Partikel "de", "of", "von" werden ebenfalls unterdr&uuml;ckt).

<p>

F&uuml;r das Beispiel in der &Uuml;berschrift, "Lemieux", ist die Kennung "LMX" 
die gleiche (au&szlig;er dem Leerzeichen) wie bei "Louis Maheux":
"L MX". Wenn du nach einem Vornamen suchen m&ouml;chtest, klicke auf "Vorname", 
dann auf "ok".

<p>

<h4>Warum werden die "Quelle"-Felder in den GEDCOM-Dateien nicht verwendet?</h4>

Zur Zeit werden die Quellen nur dann in Betracht gezogen, wenn sie Texte sind,
weil in <font color=#2f6400><b>GeneWeb</b></font> nicht geplant ist, diese
verschieden zu speichern. Werden die Quellen durch eine Struktur dargestellt,
so wei&szlig; <font color=#2f6400><b>GeneWeb</b></font> nicht, wie diese
behandelt
werden m&uuml;ssen, weil die Bedeutungen der Strukturelemente nicht bekannt
sind.

<p>
<hr>
<br>
<center>
Zur&uuml;ck zur <a href="diruse.htm">Gebrauchsanweisung</a>.
</center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>

</body>
