<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>GeneWeb - Wartung</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://www.geneweb.org/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Wartung</font></h1>
</td>
</tr>
</table>
</font>
<br><br>


Dieser Teil zeigt einige wichtige "Tricks" f&uuml;r die Instandhaltung
deiner Datenbanken.
<UL>
<LI>
<A HREF="#Clea">1.</A> S&auml;uberung.</LI>

<LI>
<A HREF="#Rena">2.</A> Umbenennung.</LI>

<LI>
<A HREF="#Save">3.</A> Sicherung.</LI>
</UL>

<p>
<hr>

<h3><font color=#2f6400>
<A NAME="Clea"></A>1. S&auml;uberung</font></h3>
Wenn du deine Datenbank mit deinem Webbrowser modifizierst, k&ouml;nnen
einige kleine Probleme auftreten:
<UL>
<LI>
Wenn du viele &Auml;nderungen gemacht hast, wird der Datenzugriff allm&auml;hlich
langsamer.</LI>
</UL>

<UL>
<LI>
Wenn du neue Familien hinzuf&uuml;gst oder Personen &auml;nderst, wird
die Blutsverwandtschaft nicht mehr angezeigt oder kann falsch sein.</LI>
</UL>

<UL>
<LI>
Wenn du Personen und Familien entfernst, wird der belegte Platz nicht
freigegeben:
Deswegen zeigt die Startseite, obwohl du eine Person entfernt hast, immer
noch die gleiche Zahl von Personen an.</LI>
</UL>
In diesen F&auml;llen sollte die Datenbank ges&auml;ubert werden.
<UL>
<LI>
Die erste S&auml;uberung kann mit dem Befehl "consang" durchgef&uuml;hrt
werden, welcher die Blutsverwandtschaft f&uuml;r alle Datenbanken neuberechnet
und die anf&auml;ngliche Zugriffsgeschwindigkeit wiederherstellt. Wenn
die Datenbank "bla" hei&szlig;t, nimm ein Eingabefenster (siehe
"<A HREF="start.htm#Int">Erste Schritte</A> mit GeneWeb") und gib ein:</LI>

<PRE>&nbsp;&nbsp;&nbsp;&nbsp; consang bla</PRE>
Dieser Befehl kann einige Sekunden oder Minuten ben&ouml;tigen, abh&auml;ngig
von der Gr&ouml;&szlig;e der Datenbank. Ein Z&auml;hler wird angezeigt...
Beachte, da&szlig; w&auml;hrend dieser Operation die Online-&Auml;nderungen
abgewiesen werden: Wenn du in einem Formular auf "Ok" dr&uuml;ckst, fordert
dich eine Meldung auf, es sp&auml;ter noch einmal zu versuchen.

<P>Unter Unix kannst du diesen Befehl zu jeder Zeit stoppen, indem du
Control-C (bzw. Strg-C)
im Eingabefenster dr&uuml;ckst. Die Berechnung der Blutsverwandtschaften
wird nicht abgeschlossen, aber die Datenbank wird ges&auml;ubert. Du kannst
"consang" sp&auml;ter wieder starten, die Berechnung wird an der
Stelle wiederaufgenommen,
wo sie beendet wurde (es sei denn, du hast &Auml;nderungen an Familien
gemacht, dann f&auml;ngt die Berechnung von vorn an).</UL>

<UL>
<LI>
Eine bessere Art, Datenbanken zu s&auml;ubern, besteht in der Benutzung
von "gwu" und "gwc". Diese S&auml;uberung erzeugt eine neue Datenbank,
wo der Platz von entfernten Personen und Familien wiederbenutzt wird. Im
Eingabefenster gib f&uuml;r die Datenbank "bla" ein:</LI>

<PRE>&nbsp;&nbsp;&nbsp;&nbsp; gwu bla > bla.gw</PRE>
dann:
<PRE>&nbsp;&nbsp;&nbsp;&nbsp; gwc bla.gw -o blub</PRE>
Es empfiehlt sich, die Datenbank nicht mit demselben Namen anzulegen,
denn
wenn "gwu" oder "gwc" nicht richtig arbeiten, riskierst du, alles zu verlieren.
Hier haben wir die neue Datenbank "blub" genannt.

<P>Kontrolliere, da&szlig; "blub" korrekt ist, und wenn das der Fall ist, entferne
die Datenbank "bla" (durch L&ouml;schen des Verzeichnisses&nbsp;
"bla.gwb"),
dann benenne "blub" in "bla" um (durch Umbenennen von "blub.gwb" in
"bla.gwb
"). Wie das geht, siehst du im n&auml;chsten Abschnitt.

<P>Nach dem Aufruf von&nbsp; "gwc" bleiben Dateien mit der Erweiterung
".gwo" &uuml;brig. Du kannst sie entfernen. L&ouml;sche auch die Dateien
".gw", au&szlig;er du willst diese als Backup aufheben.

<P>Wenn du willst, das die Anzeige der Blutsverwandtschaft
funktioniert, mu&szlig;t du au&szlig;erdem noch einmal "consang"
f&uuml;r diese neue Datenbank ausf&uuml;hren.</UL>

<p>
<hr>

<h3><font color=#2f6400>
<A NAME="Rena"></A>2. Umbenennung</font></h3>
Die <font color=#2f6400><b>GeneWeb</b></font>-Datenbanken sind Verzeichnisse mit der Erweiterung ".gwb".
Wenn du einfach den Namen des Verzeichnisses "blub.gwb" nach "bla.gwb" &auml;nderst,
hei&szlig;t deine Datenbank jetzt nicht mehr "blub" sondern "bla".

<P>Um das zu machen, hast du die Wahl zwischen der graphischen Oberfl&auml;che,
wenn dein System eine solche besitzt, oder interaktiven Befehlen.
<UL>
<LI>
um "blub.gwb" nach "bla.gwb" mit der graphischen Oberfl&auml;che zu &auml;ndern:</LI>

<UL>
<LI>
&Ouml;ffne ein Fenster mit dem Verzeichnis, das deine Datenbanken enth&auml;lt.</LI>

<LI>
Ziehe "bla.gwb", wenn ein solcher existiert, in den Papierkorb.</LI>

<LI>
Benenne "blub.gwb" in "bla.gwb" um.</LI>
</UL>
</UL>

<UL>
<LI>
mit einem interaktiven Eingabefenster:</LI>

<UL>
<LI>
Unter Unix:</LI>

<PRE>&nbsp;&nbsp;&nbsp;&nbsp; rm -rf bla.gwb
&nbsp;&nbsp;&nbsp;&nbsp; mv blub.gwb bla.gwb</PRE>

<LI>
Unter Windows:</LI>

<PRE>&nbsp;&nbsp;&nbsp;&nbsp; del bla.gwb\*.*
&nbsp;&nbsp;&nbsp;&nbsp; rmdir bla.gwb
&nbsp;&nbsp;&nbsp;&nbsp; move blub.gwb bla.gwb</PRE>
</UL>
</UL>

<p>
<hr>

<h3><font color=#2f6400>
<A NAME="Save"></A>3. Sicherung</font></h3>
Computer sind keine absolut verl&auml;&szlig;lichen Maschinen. Es ist wichtig,
die Daten von Zeit zu Zeit zu sichern durch Kopie auf ein anderes Medium
(Disketten zum Beispiel).

<P>Es kann au&szlig;erdem interessant sein, verschiedene Zwischenversionen
zu behalten, um zu &auml;lteren Versionen zur&uuml;ckkehren zu k&ouml;nnen.

<P>Um die Datenbank "bla" zu sichern, mache einfach eine Kopie vom Verzeichnis
"bla.gwb" auf das andere Medium (oder woanders auf die Festplatte, wenn
du nur eine Zwischenversion aufheben willst).

<P>Aber es gibt noch einen besseren Weg zum Sichern: Speichere stattdessen
deine Datenbank als Quelldatei ab. F&uuml;r die Datenbank "bla" gib in
einem Eingabefenster ein:
<PRE>&nbsp;&nbsp;&nbsp;&nbsp; gwu bla > bla.gw</PRE>
Und kopiere die Datei "bla.gw" auf das andere Medium oder woanders auf
die Festplatte. Du kannst der Datei f&uuml;r deine Ablage auch einen anderen
Namen geben (aber immer mit der Erweiterung ".gw").

<P>Das Backup als ".gw"-Dateien hat mehrere Vorteile:
<UL>
<LI>
Es ist einfacher, weil es nur eine Datei ist, w&auml;hrenddessen die Datenbank
ein ganzes Verzeichnis umfa&szlig;t.

<p>
<LI>
Die Dateigr&ouml;&szlig;e ist geringer.

<p>
<LI>
Man kann sie wieder zusammensetzen mit einem anderen "gwc", sogar mit einer
zuk&uuml;nftige Version von GeneWeb.

<p>
<LI>
Da es sich um einfachen Text handelt, ist sie mit einem Editor lesbar (Word, Emacs,
etc.); was sehr n&uuml;tzlich sein kann. Eine Genealogiesoftware wird auch
noch in dreihundert Jahren in der Lage sein, die Datenbank wiederaufzubauen.</LI>
</UL>

<UL>
<LI>
Man kann einen Vergleich zwischen verschiedenen gesicherten Versionen und
der aktuellen Version machen.</LI>
</UL>
Um die Datenbank "bla" aus der Datei "bla.gw" wiederherzustellen, gib ein:
<PRE>&nbsp;&nbsp;&nbsp;&nbsp; gwc bla.gw -o bla</PRE>


<p>
<hr>
<br>
<center>
Zur&uuml;ck zur <a href="diruse.htm">Gebrauchsanweisung</a>.
</center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>

</body>
