<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>GeneWeb - Erste Schritte</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://opensource.geneanet.org/projects/geneweb/"><img 
 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Erste Schritte</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Das vorliegende Kapitel enth&auml;lt eine Einf&uuml;hrung zu <font color=#2f6400><b>GeneWeb</b></font> 
mit einer kurzen Beschreibung von Befehlen und Dateien f&uuml;r einen schnellen
Einstieg.

<p>

Warnung: Dieser Ansatz unterstellt, dass du dich mit "Dateien" und 
"Verzeichnissen" auskennst und keine Angst vor der Eingabe von
Kommandos hast; ansonsten verwende lieber das Programm <b><a
href="gwsetup.htm">gwsetup</a></b>.

<p>

<ul>
<li>
<a href="#Int">Einleitung</a></li>

<li>
<a href="#Gwc">Der Befehl gwc</a></li>

<li>
<a href="#Ged">Der Befehl ged2gwb</a></li>

<li>
<a href="#Gee">Der Befehl gwb2ged</a></li>

<li>
<a href="#Gwd">Der Befehl gwd</a></li>

<li>
<a href="#Csg">Der Befehl consang</a></li>

<li>
<a href="#Gwu">Der Befehl gwu</a></li>

<li>
<a href="#Cnf">Die Datei a.gwf</a></li>

<li>
<a href="#Lex">Das Verzeichnis "lang" - die Datei "lexicon.txt"</a></li>

<li>
<a href="#Lng">Das Verzeichnis "lang" - die Unterverzeichnisse</a></li>
</ul>

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Int"></a>Einleitung</font></h3>
Zur Konfiguration und zum Start von <font color=#2f6400><b>GeneWeb</b></font> sind
interaktive Befehle erforderlich. Unter Unix starte ein xterm. Unter
Windows 95/NT klicke auf "Start", "Programme" und "Eingabeaufforderung".
<p>In diesem Fenster wechsle in das Verzeichnis, wo du <font color=#2f6400><b>GeneWeb</b></font> installiert
hast:
<ul>
<li>
Unter Unix, falls du das Programm unter "/home/meier/geneweb"
installiert hast:</li>

<pre>
     cd /home/meier/geneweb
</pre>

<li>
Unter Window 95/NT, falls du das Programm unter "C:\soft\geneweb"
installiert hast:</li>

<pre>
     cd c:\soft\geneweb</pre>
</ul>
Alle <font color=#2f6400><b>GeneWeb</b></font>-Befehle k&ouml;nnen mit der Option "-help" aufgerufen
werden, wodurch die verschiedenen m&ouml;glichen Optionen sowie eine kurze
Erkl&auml;rung angezeigt werden.
<p>Wenn du zum Beispiel eingibst:
<pre>
     gwd -help
</pre>
erh&auml;ltst du so etwas wie:
<pre>     Usage: gwd [options] where options are:
       -hd &lt;dir>
            Directory where the directory lang is installed.
       -bd dir>
            Directory where the databases are installed.
       -cgi 
            Force cgi mode.
       -p &lt;number>
            Select a port number (default = 2317); > 1024 for normal users.
       -wizard &lt;passwd>
            Set a wizard passord: access to all dates and updating.
       -friend &lt;passwd>
            Set a friend password: access to all dates.
       -lang &lt;lang>
            Set a default language (default: fr).
       -only &lt;address>
            Only inet address accepted.
       -auth &lt;file>
            Authorization file to restrict access. The file must hold lines
            of the form "user:password".
       -log &lt;file>
            Redirect log trace to this file.
       -nolock 
            Do not lock files before writing.
</pre>
Einige Befehle sind ziemlich "geschwätzig". Du kannst ihre Anzeige in eine
Datei umleiten, indem du an das Kommando ein "> Datei" anhängst. Beispiel:
<pre>     gwd -help > bla.txt</pre>
<font color=#2f6400><b>GeneWeb</b></font>-Datenbanken sind Verzeichnisse mit der Erweiterung ".gwb".

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Gwc"></a>Der Befehl gwc</font></h3>
Um <font color=#2f6400><b>GeneWeb</b></font> zu benutzen, mu&szlig;t du eine Datenbank anlegen. Du
kannst das mit dem Befehl "gwc" oder mit "ged2gwb" machen, siehe folgender
Abschnitt.
<p>Der Befehl "gwc" legt in seiner einfachsten Form eine leere Datenbank
an: Mit
<font color=#2f6400><b>GeneWeb</b></font> kann sie dann gef&uuml;llt werden.
<p>Du mu&szlig;t dieser Datenbank einen Namen geben. Ein beliebiger Name
ist m&ouml;glich. Vorzugsweise sollten nicht mehr als 8 Zeichen verwendet
werden.
<p>Wenn die Datenbank zum Beispiel "meier" hei&szlig;en soll, dann schreibe:
<pre>
     gwc -o meier
</pre>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Ged"></a>Der Befehl ged2gwb</font></h3>
Eine andere Art eine <font color=#2f6400><b>GeneWeb</b></font>-Datenbank anzulegen ist, mit einer
GEDCOM-Datei zu beginnen.
<p>Der Befehl "ged2gwb" erlaubt es, eine GEDCOM-Datei in eine
<font color=#2f6400><b>GeneWeb</b></font>-Datenbank umzuwandeln.
<p>Am einfachsten geht das, indem du zuerst die GEDCOM-Datei in das 
Verzeichnis kopierst,
wo <font color=#2f6400><b>GeneWeb</b></font> installiert wurde. Mache das so, wie
du immer Dateien kopierst,
entweder mit einem interaktiven Befehl, oder per Icon-Bewegung.
<p>Wenn deine GEDCOM-Datei zum Beispiel "bla.ged" hei&szlig;t und du
Deine Datenbank "meier" nennen willst, gib ein:
<pre>
     ged2gwb bla.ged -o meier
</pre>
Der Befehl ist etwas mitteilsam, besonders wenn er Fehler in der 
GEDCOM-Datei findet. 
Du kannst diese Fehler zuerst einmal ignorieren: Deine Datenbank
wird trotzdem erzeugt. Wenn alles in Ordnung ist, mu&szlig; die
Ausgabe enden mit:
<pre>
     *** Ok</pre>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Gee"></a>Der Befehl gwb2ged</font></h3>
Bevor wir weitermachen, m&ouml;chten wir noch auf den umgekehrten Befehl
"gwb2ged" hinweisen, welcher aus einer <font color=#2f6400><b>GeneWeb</b></font>-Datenbank eine 
GEDCOM-Datei erzeugt.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Gwd"></a>Der Befehl gwd</font></h3>
Wenn erstmal eine Datenbank mit einem der Befehle "gwc" oder "ged2gwb"
erzeugt wurde, kannst du diese abfragen und erweitern.
<p>Gib im Eingabefenster ein:
<pre>&nbsp;&nbsp;&nbsp;&nbsp; gwd</pre>
Dieser Befehl startet den <font color=#2f6400><b>GeneWeb</b></font>-"Daemon". Das Programm mu&szlig;
ausgeben:
<pre>
     GeneWeb - Copyright (c) 1998-2006 INRIA
     Possible addresses:
        http://localhost:2317/base
        http://127.0.0.1:2317/base
        http://address:2317/base
     where "base" is the name of the database
     Type control C to stop the service
     Ready (Tag) (Uhrzeit) port 2317...
</pre>
Beachte, da&szlig; du im Eingabefenster keinen Prompt siehst. 
Das Programm wartet
auf Anfragen, die du per Webbrowser sendest. Wenn es eine Anfrage erh&auml;lt,
wird diese verarbeitet und wieder gewartet. Beenden kann man <font color=#2f6400><b>GeneWeb</b></font> 
durch Dr&uuml;cken von Control-C (bzw. Strg-C) im Eingabefenster.
<p>So, jetzt k&ouml;nnen wir wirklich anfangen. Da du diese Dokumentation
liest, benutzt du einen Webbrowser. Mache in diesem Browser ein neues
Fenster auf und gehe zur folgenden URL. Ersetze "meier" durch den Namen deiner
Datenbank. Achtung: Setze nicht den kompletten Namen ein (wie
"c:\geneweb\meier"
oder "/home/geneweb/meier"), sondern nur "meier":
<pre>
     http://localhost:2317/meier
</pre>
Nun siehst Du die <font color=#2f6400><b>GeneWeb</b></font>-Startseite in Franz&ouml;sisch.
<p>[Wenn das nicht klappt, klicke <a href="problem.htm">hier</a>]
<p>W&auml;hle eine andere Sprache (z. B. Deutsch) in der Flaggenreihe am
Anfang der Seite. (Es gibt eine M&ouml;glichkeit, eine andere Standardsprache
als Franz&ouml;sisch zu w&auml;hlen. Siehe <a href="#Cnf">unten</a>).
<ul>
<li>
Wenn du mit einer GEDCOM-Datei ("ged2gwb") begonnen hast, mu&szlig;t du
am Anfang der Seite die Zahl der Personen deiner Datenbank sehen.</li>

<p>
Von hier kannst du alles wie einen klassischen Webservice nutzen, auf
Links und Tasten dr&uuml;cken, Felder ausf&uuml;llen, etc. Hinweis: Zu
Beginn klicke auf "Ok" hinter "Alle Nachnamen in alphabetischer Reihenfolge",
dann in der neu erscheinenden Seite: "Die ganze Liste". W&auml;hle einen
Nachnamen aus, dann eine Person, etc.</ul>

<ul>
<li>
Wenn Du mit einer leeren Datenbank begonnen hast ("gwc"), sagt die Startseite,
da&szlig; die Datenbank 0 Personen enth&auml;lt.</li>

<p>
Die einzig m&ouml;gliche Aktion ist nun, Personen und Familien
zu erstellen. Klicke auf "Eine Familie hinzuf&uuml;gen". Siehe das Kapitel
"Wie nimmt man <a href="update.htm">&Auml;nderungen</a>
an der Datenbank vor".</ul>
Inzwischen kannst du sehen, da&szlig; jedes mal, wenn du auf eine Taste
oder einen Link dr&uuml;ckst, ein Trace im Terminalfenster erzeugt wird.
Wenn du deinen
<font color=#2f6400><b>GeneWeb</b></font>-<a href="server.htm">Server</a> im Netzwerk
laufen l&auml;&szlig;t, siehst du auf diese Art und Weise die Anfragen,
die gesendet werden.
<p>Beachte, da&szlig; der Dienst beim Dr&uuml;cken von Control-C (bzw.
Strg-C)
im Terminalfenster nicht mehr die Anfragen des Webbrowsers beantwortet.
Um ihn wieder zu starten, gib wieder "gwd" ein.
<p>Unter Windows kannst du einfach auf das Icon von "gwd" doppelklicken
um zu starten. Es &ouml;ffnet sich ein Terminalfenster, wo "gwd" seinen
Ablauf anzeigt.
<br>Dr&uuml;cken von Control-C (bzw. Strg-C) stoppt "gwd" und
schlie&szlig;t das Fenster.  Wenn man eine Verkn&uuml;pfung auf "gwd"
auf der Arbeitsoberfl&auml;che
erzeugt, kann man es sehr leicht erreichen.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Csg"></a>Der Befehl consang</font></h3>
Dieses Kommando mu&szlig; wie die anderen im Terminalfenster eingegeben
werden. Wenn der "gwd"-Daemon l&auml;uft, dr&uuml;cke Control-C 
(bzw. Strg-C) zum Stoppen.
Wenn Du den Daemonen nicht stoppen willst, besteht ein anderer Weg darin,
stattdessen ein weiteres Terminalfenster zu starten (wie oben
beschrieben).
<p>Der Befehl "consang" berechnet die Blutsverwandschaften in einer Datenbank.
Die Anzeige der Blutsverwandschaften erfolgt bei der Abfrage 
von 
Personendatens&auml;tzen aus der Datenbank und bei der Berechnung
der Verwandtschaften.
<p>Aber um darauf Zugriff zu haben, m&uuml;ssen die einzelnen 
Blutsverwandtschaften
der Personen in der Datenbank vorherberechnet werden. Das macht "consang".
Wenn der Name deiner Datenbank "meier" ist, gib ein:
<pre>
     consang meier
</pre>
Das Programm rechnet dann einige Sekunden oder Minuten, je nach
Gr&ouml;&szlig;e deiner Datenbank. Während der Berechnung wird die Zahl der
noch zu bearbeitenden Personen angezeigt. Am Ende steht wieder das Prompt
im Terminalfenster und die einzelnen Blutsverwandtschaften sind gespeichert.
<p>W&auml;hrend dieser Berechnung kann man auf jeden Fall in den Webbrowser
zur&uuml;ckkehren und die Datenbank abfragen, falls man den Daemon nicht
gestoppt hat.
<p>Starte "consang" von Zeit zu Zeit, wenn du &Auml;nderungen an deiner
Datenbank gemacht hast, besonders wenn Familien hinzukommen, ge&auml;ndert
oder gel&ouml;scht werden: Die Blutsverwandtschaft h&auml;ngt von der Struktur
der Familien ab. Wenn sie sich &auml;ndert, sind die einzelnen 
Blutsverwandtschaften
nicht verf&uuml;gbar und man mu&szlig; sie neu berechnen.
<p>Zudem f&uuml;hrt "consang" eine interne "S&auml;uberung" der Datenbank
durch, die nach einer gewissen Zahl von &Auml;nderungen notwendig wird.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Gwu"></a>Der Befehl gwu</font></h3>
Dieses Kommando zeigt den Inhalt der Datenbank in einer Textform. Wenn
man die Ausgabe dieses Kommandos in eine Datei umleitet, kann es als Sicherung
der Datenbank dienen.
<p>Wenn deine Datenbank "meier" hei&szlig;t und du sie in der Datei
"bla.gw"
speichern willst, gib ein:
<pre>
     gwu meier > bla.gw
</pre>
Wenn du deine Datenbank in verschiedenen Versionen und Dateien abspeicherst,
kannst Du die Unterschiede unter Verwendung eines Vergleichsprogrammes
sehen. Das ist besonders interessant, wenn jemand Ver&auml;nderungen deiner
Datenbank vorgenommen hat und du wissen willst, welche das sind.
<p>Das ist auch eine Methode, die Datenbank wiederherzustellen, wenn du
eine andere Version von <i>GeneWeb&nbsp;</i> benutzt, f&uuml;r den Fall,
da&szlig; sich die interne Repr&auml;sentation der Datenbanken ge&auml;ndert
hat.
<p>Um deine Datenbank wiederherzustellen, kannst du den Befehl "gwc" nutzen.
Die gespeicherte Datei mu&szlig; die Erweiterung ".gw" haben. Um eine Datenbank
namens "mueller" aus der Datei "bla.gw" aufzubauen, gib ein:
<pre>&nbsp;&nbsp;&nbsp;&nbsp; gwc bla.gw -o mueller</pre>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Cnf"></a>Die Datei a.gwf</font></h3>
Diese Datei enth&auml;lt eine Konfigurationsschablone f&uuml;r eine Datenbank.
Wenn der Name deiner Datenbank "meier" ist, mache eine Kopie von "a.gwf",
benenne sie in "meier.gwf" um und editiere die Datei "meier.gwf".
<p>Die konfigurierbaren Werte sind wie folgt:
<ul>
<li>
<b>body_prop</b> erlaubt die Einstellung einer 
Hintergrundfarbe oder eines Hintergrundbildes 
und die &Auml;nderung der Text- und Linkfarben. Seine Syntax
entspricht der
HTML-Syntax, die in der "&lt;body>"-Anweisung vor dem ">" steht.
Sieh in deine HTML Dokumentation (oder frage einen Experten).
Beispiel:


<pre>&nbsp;&nbsp;&nbsp;&nbsp; body_prop=background=mybackg.jpg vlink=yellow</pre>
Das wirkt sich nicht nur auf die Startseite aus, sondern auf alle Seiten
dieser Datenbank.

<p>
<li>
<b>friend_passwd</b> erlaubt die Sichtbarkeit von noch lebenden Personen
zu beschr&auml;nken, d.&nbsp;h. hier alle Personen, die vor weniger als 
hundert Jahren geboren wurden oder gestorben sind.

<p>Wenn du dieser Variablen einen Wert gibst, k&ouml;nnen nur Personen,
die das Kennwort auf der Startseite eingegeben haben, auf diese Daten zugreifen.
<p>

<li>
<b>wizard_passwd</b> erlaubt die Beschr&auml;nkung des Rechtes,
Änderungen an der Datenbank durchzuf&uuml;hren.

<p>
Wenn du dieser Variable einen Wert gibst, haben nur Personen
&Auml;nderungsberechtigung, die dieses
Kennwort auf der Startseite eingegeben haben.
<p>

<li>
<b>wizard_just_friend</b> erlaubt es, die &Auml;nderungsberechtigung
wieder zu entziehen.
Setze die Variable auf "yes" um das zu tun,
auf "no" um die Erlaubnis wieder zu erteilen. Es kann n&uuml;tzlich
sein, "yes" zeitweise hinzuschreiben, während man die Datenbank <a href="maint.htm">s&auml;ubert</a>.

<p>
<li>
<b>default_lang</b> erlaubt es, eine Standardsprache f&uuml;r die Startseite
zu definieren. Ohne Angabe ist die Sprache Franz&ouml;sisch. Die m&ouml;glichen
Werte sind: 
"af"&nbsp;(Afrikaans), 
"cn"&nbsp;(Chinesisch), 
"ct"&nbsp;(Catalan), 
"cz"&nbsp;(Tschechisch), 
"de"&nbsp;(Deutsch),
"dk"&nbsp;(D&auml;nisch),
"en"&nbsp;(Englisch),
"eo"&nbsp;(Esperanto),
"es"&nbsp;(Spanisch),
"et"&nbsp;(Estonisch),
"fi"&nbsp;(Finnisch), 
"fr"&nbsp;(Franz&ouml;sisch),
"he"&nbsp;(Hebr&auml;isch),
"it"&nbsp;(Italienisch), 
"lv"&nbsp;(Litauisch), 
"nl"&nbsp;(Holl&auml;ndisch),
"no"&nbsp;(Norwegisch),
"pt"&nbsp;(Portugiesisch),
"ru"&nbsp;(Russisch), 
"se"&nbsp;(Schwedisch).

<p>Beachte, dass unabh&auml;ngig von der gew&auml;hlten
Standardssprache, jederzeit eine andere Sprache auf der Startseite 
gew&auml;hlt werden kann, indem man auf die Flaggenreihe am Kopf 
der Seite klickt.</ul>

<ul>
<li>
<b>can_send_image</b> erlaubt den "Wizards" Fotos zu senden 
(und zu l&ouml;schen).
In diesem Fall k&ouml;nnen sie bei der <a
href="update.htm#MAJ">Aktualisierung</a>
auf einen Link namens <a href="update.htm#SndP">Bild senden</a>
klicken (und m&ouml;glicherweise einen anderen namens 
<a href="update.htm#DelPh">Bild löschen</a>). Standard ist "no" 
(keine Berechtigung Fotos zu senden); um die Berechtigung zu
erteilen, trage "yes" ein.

<p>Vorsicht: die Fotos werden auf deinem Computer abgespeichert und k&ouml;nnen
viel Platz wegnehmen, wenn viele Fotos eingesandt werden.

<p>
<li>
<b>renamed</b> erlaubt anzuzeigen, da&szlig; sich der Name einer Datenbank ge&auml;ndert
hat. Wenn deine Webseite sehr h&auml;ufig besucht wurde und die Datenbank
in vielen pers&ouml;nlichen Lesezeichen gespeichert wurde, ist das ein
Weg, auf die neue Datenbank mit dem neuen Namen umzuleiten. Wenn jemand
versucht, &uuml;ber den alten Namen darauf zuzugreifen, sieht derjenige
eine Seite mit einem Link mit der gleichen Abfrage f&uuml;r den neuen Namen.
</ul>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Lex"></a>Das Verzeichnis "lang" - die Datei "lexicon.txt"</font></h3>
Diese Datei enth&auml;lt das W&ouml;rterbuch aller Ausdr&uuml;cke und Redewendungen,
die in diesem Programm verwendet werden. F&uuml;r jeden gibt es eine &Uuml;bersetzung
in jede Sprache. Wenn du eine Sprache hinzuf&uuml;gen willst, w&auml;hle
einen Code f&uuml;r diese Sprache, und f&uuml;ge eine Zeile mit diesem
Code zu jeder &Uuml;bersetzungsgruppe hinzu, die du in der Datei siehst.
<p>Dar&uuml;berhinaus kannst du die vorgegebenen &Uuml;bersetzungen &auml;ndern,
wenn sie nicht passen.
<p>Wenn du die Datei "lexicon.txt" speicherst, wird das sofort in der Browseranzeige
angewendet. M&ouml;glicherweise mu&szlig; man aber auf "reload" klicken.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Lng"></a>Das Verzeichnis "lang" - Unterverzeichnisse</font></h3>
Jeder Name eines Unterverzeichnisses ist ein Sprachcode. 
Jedes Verzeichnis enth&auml;lt
die Standard-Startseite namens "start.txt".
<p>Du kannst diese Startseite f&uuml;r eine bestimmte Datenbank &auml;ndern.
F&uuml;r die Datenbank "meier" in der Sprache "xx", kopiere einfach die
Datei "start.txt" in das Verzeichnis "xx" und benenne sie in "meier.txt"
um. Dann editiere die Datei "meier.txt" und mache die Anpassungen die du
willst. Wenn du m&ouml;chtest, kannst du das f&uuml;r jede Sprache tun.
<p>Anmerkung: Diese Dateien beinhalten HTML-Code mit einigen besonderen
Angaben: % Zeichen gefolgt von einem Buchstaben. Das sind Makros, die "gwd"
durch Werte ersetzt. Zum Beispiel wird "%t" durch den Namen der Datenbank
ersetzt, "%b" durch den Wert von "body_prop" der Konfigurationsdatei usw.
<p>Die komplette Beschreibung dieser Makros befindet sich <a href="pcustom.htm">hier</a>.

<p>
<hr>
<br>
<center>
Zur&uuml;ck zur <a href="diruse.htm">Gebrauchsanweisung</a>.
</center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>

</body>
