<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head><title>GeneWeb - Änderungen</title></head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://pauillac.inria.fr/~ddr/GeneWeb/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - &Auml;nderungen</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Dieser Teil zeigt dir, wie du unter Verwendung deines Webbrowsers
&Auml;nderungen an einer Datenbank vornehmen kannst.
Wenn der Eigent&uuml;mer der
Datenbank ein Kennwort installiert hat, mu&szlig;t du dieses in die Startseite
eintragen um Zugriff zu den verschiedenen Update-M&ouml;glichkeiten zu
haben.
<p>Vor dem Start ist es wichtig, die grunds&auml;tzlichen Begriffe zu verstehen:
Zuerst die Begriffe "Vorname", "Nachname", "Nummer" und weiterhin die
Begriffe "Personen" und "Familien". Das erlaubt dir, die n&auml;chsten
Abschnitte &uuml;ber die Bearbeitung zu verstehen.
<ul>
<li>
<a href="#FSO">1.</a> Vornamen, Nachnamen, Nummern.</li>

<li>
<a href="#PF">2.</a> Personen and Familien.</li>

<li>
<a href="#MAJ">3.</a> Zugriff zum Bearbeiten.</li>

<li>
<a href="#Part">4.</a> Einige spezifische Punkte:</li>

<ul>
<li>
<a href="#ModC">4.1.</a> Wie &auml;ndert man den Vornamen oder den
Nachnamen eines Kindes</li>

<li>
<a href="#AddC">4.2.</a> Wie wird ein Kind einer Familie hinzugef&uuml;gt.</li>
</ul>

<li>
<a href="#Form">5.</a> Formulare.</li>

<ul>
<li>
<a href="#AddF">5.1.</a> Familie hinzuf&uuml;gen.</li>

<li>
<a href="#ModF">5.2.</a> Familie ver&auml;ndern.</li>

<li>
<a href="#DelF">5.3.</a> Familie l&ouml;schen.</li>

<li>
<a href="#ModP">5.4.</a> Person &auml;ndern.</li>

<li>
<a href="#DelP">5.5.</a> Person l&ouml;schen.</li>

<li>
<a href="#SndP">5.6.</a> Bild senden.</li>

<li>
<a href="#DelPh">5.7.</a> Bild l&ouml;schen.</li>

<li>
<a href="#ChgC">5.8.</a> &Auml;ndern der Namen eines Kindes.</li>
</ul>

<li>
<a href="#MrgP">6.</a> Zusammenf&uuml;hren zweier Personen.</li>

<li>
<a href="#MrgF">7.</a> Zusammenf&uuml;hren zweier Familien.</li>

<li>
<a href="#Dcln">8.</a> Sprachen mit Deklination.</li>

<ul>
<li>
<a href="#Data">8.1.</a> Dateneingabe.</li>

<li>
<a href="#Disp">8.2.</a> Anzeige, Dokumentation.</li>
</ul>
</ul>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="FSO"></a>1. Vornamen, Nachnamen, Nummern</font></h3>
Jede Person der Datenbank wird gekennzeichnet durch ihren Vornamen, ihren
Nachnamen und ihre Nummer; letztere Information erlaubt zwei Personen gleichen
Vor- und Nachnamens zu unterscheiden. Dieses Set wird der "Schl&uuml;ssel"
einer Person genannt (<a href="#note">Anm.</a>).
<p>Wenn es also zwei "Max Meier" in der Datenbank gibt, so kannst du sie
durch die Nummer unterscheiden. Jede Nummer ist g&uuml;ltig und du
brauchst weder bei 0 oder 1 zu beginnen noch jedesmal eine 1 zu addieren. 
Zum Beispiel kann dein erster "Max Meier" die Nummer 7 und der
zweite die Nummer 4 haben.
Der eine wird repr&auml;sentiert durch 
"Max", "Meier", "7".
und der zweite durch "Max", "Meier", "4".
<p>
<i>Du</i> w&auml;hlst diese Nummer, es sei denn, du beginnst mit einer
GEDCOM-Datei: In diesem Fall hat "ged2gwb" die Nummer f&uuml;r dich 
f&uuml;r alle Personen in der Datenbank gew&auml;hlt.
<p>
Diese Nummer erscheint nur bei der &Auml;nderung von Seiten: Sie ist auf
normalen Seiten nicht sichtbar.
Wenn du also den Namen "Max Meier" in der Startseite
eingibst, gibt <font color=#2f6400><b>GeneWeb</b></font> die Auswahl zwischen "Max Meier 7" and
"Max Meier 4", aber ohne explizit die Nummern anzuzeigen.
<p>
Jedoch solltest du als "Guru", der auch &Auml;nderungen; macht, wissen,
da&szlig; du einen Punkt und die Nummer zwischen den Vornamen und den Nachnamen
schreiben kannst. Zum Beispiel kannst du auf der Startseite "Max .4 Meier"
suchen und du findest direkt denjenigen, dessen Nummer 4 ist.
<p>Beachte auch, da&szlig;:
<ul>
<li>
Akzente und Gro&szlig;buchstaben bei der Unterscheidung nicht
ber&uuml;sichtigt werden.
So gibt "Max", "Meier", "5" Zugriff zur gleichen
Person wie "MAX", "MEIER", "5" und "Max", "Meier", "5".</li>

<li>
Ohne Angabe einer Nummer wird der Wert 0 verwendet. Nicht setzen oder gleich
0 setzen der Nummer sind identisch.</li>
</ul>
Es ist wichtig, diesen Begriff zu verstehen, weil einige Fehlermeldungen
dies betreffen. Zum Beispiel Meldungen wie:
<ul>
<li>
"Person existiert schon": Das hei&szlig;t, da&szlig; du versuchst eine Person
anzulegen, deren Kombination von Vorname, Nachname, Nummer schon reserviert
ist, was auftritt</li>

<ul>
<li>
entweder in einem Kontext, wo du eine neue Person anlegen wolltest</li>

<li>
oder in einem Kontext, wo du den Vornamen, Nachnamen oder die Nummer einer
vorhandenen Person &auml;ndern wolltest.</li>
</ul>

<li>
"Unbekannte Person": Das hei&szlig;t, da&szlig; niemand in der Datenbank
zu der Kombination Vorname, Nachname, Nummer korrespondiert, was
auftritt,
wenn du eine vorhandene Person in einer Familie als Vater, Mutter oder
Kind zuweisen willst.</li>
</ul>
Beachte au&szlig;erdem, da&szlig; diese Nummer nichts zu tun hat mit der Zahl
in Vornamen von adligen Personen: "Edward III" hat nicht notwendigerweise
die Nummer "3". Jedoch - und das ist kein Gegensatz - es ist eine sinnvolle
Gepflogenheit, obwohl es nicht vorgeschrieben ist, die gleiche Nummer
zu w&auml;hlen, wenn immer das m&ouml;glich ist: Du wirst sehen,
da&szlig; das praktischer ist.
<p>Aber meistens gibt es keinen Grund, eine Nummer anzugeben. Gib nichts
ein: 0 ist Standard und ist damit ok.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="PF"></a>2. Personen und Familien</font></h3>
Die <font color=#2f6400><b>GeneWeb</b></font>-Datenbanken beinhalten intern zwei Hauptbegriffe: Personen
und Familien:
<ul>
<li>
Personen beinhalten individuelle Daten wie Vorname, Nachname, Nummer, Geburtsdatum
und -ort, Taufe, Tod, m&ouml;gliche Adelstitel usw. usf.</li>

<li>
Familien enthalten einfach Familien: Vater, Mutter, Kinder, m&ouml;glicherweise
Datum und Ort von Hochzeit und Scheidung. Beachte, da&szlig; wenn eine Person
mehrere Male verheiratet ist, gibt es soviele "Familien" wie Ehen.</li>
</ul>
Die &Auml;nderungen der Datenbank sind einfach und ausschlie&szlig;lich
&Auml;nderungen von "Personen" und "Familien": Hinzuf&uuml;gen, &Auml;ndern, L&ouml;schen.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="MAJ"></a>3. Zugriff zu Aktualisierungen</font></h3>
Wenn du sicher bist, die vorherigen zwei Abschnitte gut verstanden zu haben,
kannst du nun anfangen.
<p>Um auf Aktualisierungen zuzugreifen, kannst du:
<ul>
<li>
entweder auf "eine Familie hinzuf&uuml;gen" in der Startseite klicken</li>

<li>
oder auf "Aktualisieren" in einem Personendatensatz.</li>
</ul>
Auf der Startseite erlaubt dir das Klicken auf "eine Familie hinzuf&uuml;gen"
mit dem F&uuml;llen einer leeren Datenbank zu beginnen.
<p>Du siehst dann ein Formular zum Hinzuf&uuml;gen einer Familie. Siehe
den Abschnitt <a href="#AddF">Familie hinzuf&uuml;gen</a>.
<p>In einem Personendatensatz erlaubt dir das Klicken auf "Aktualisieren"
eine Auswahlseite zu sehen. Diese Auswahl h&auml;ngt von der famili&auml;ren
Situation der Person ab:
<ol>
<li value="1">
Auf alle F&auml;lle hast du die Auswahl "&Auml;ndern" und "L&ouml;schen":
Das ist das Anpassen oder L&ouml;schen der Person. Weiter siehe die Abschnitte:</li>

<ul>
<li>
<a href="#ModP">&Auml;ndern einer Person</a></li>

<li>
<a href="#DelP">L&ouml;schen einer Person</a></li>
</ul>
Wenn der Datenbank-Eigent&uuml;mer die Berechtigung daf&uuml;r zur Verf&uuml;gung
gestellt hat (siehe <a href="start.htm#Cnf">Konfigurationsdatei</a>),
erh&auml;ltst
du die Auswahl "Bild senden". Weiter siehe die Abschnitte:
<ul>
<li>
<a href="#SndP">Bild senden</a></li>

<li>
<a href="#DelPh">Bild l&ouml;schen</a></li>
</ul>
</ol>

<ol>
<li value="2">
Wenn die Person verheiratet ist, hast du f&uuml;r jede Ehe die Auswahl
"Familie &auml;ndern" und "Familie l&ouml;schen". Weiter siehe die Abschnitte:</li>

<ul>
<li>
<a href="#ModF">Familie &auml;ndern</a></li>

<li>
<a href="#DelF">Familie l&ouml;schen</a></li>
</ul>
</ol>

<ol>
<li value="3">
Wenn es mehrere Ehen gibt, ist ein Auswahl-"schalter" zwischen jeder Ehe,
um die Reihenfolge der Familien zu tauschen.</li>
</ol>

<ol>
<li value="4">
In anderen F&auml;llen endet diese Familienliste mit "Familie
hinzuf&uuml;gen". Du siehst
das gleiche Formular wie nach "eine Familie hinzuf&uuml;gen" von der Startseite,
au&szlig;er da&szlig; die Person vorausgef&uuml;llt wird im Formular als
eines der Elternteile (entsprechend dem Geschlecht). Weiter siehe Abschnitt:

<p>
<ul>
<li>
<a href="#AddF">Hinzuf&uuml;gen einer Familie</a></li>
</ul>
</ol>

<ol>
<li value="5">
Es gibt eine Auswahl zur &Auml;nderung der Namen der Kinder. Dies erlaubt
die Vor- und Nachnamen aller Kinder einer Person in einem einzigen Formular
zu &auml;ndern. Weiter siehe Abschnitt:</li>

<p>
<ul>
<li>
<a href="#ChgC">Namen der Kinder &auml;ndern</a></li>
</ul>
</ol>

<ol>
<li value="6">
Am Ende - wenn die Person keine Eltern hat - gibt es die Auswahl "Eltern
hinzuf&uuml;gen". Dies ruft ebenfalls das Formular "Familie hinzuf&uuml;gen"
auf, wobei die betreffende
Person vorausgef&uuml;llt als Kind und sein Nachname im Feld "Nachname"
des Vaters. Weiter siehe Abschnitt:</li>

<p>
<ul>
<li>
<a href="#AddF">Hinzuf&uuml;gen einer Familie</a></li>
</ul>
</ol>
Anmerkungen:
<ul>
<li>
Alle diese Auswahlen f&uuml;hren entweder zu auszuf&uuml;llenden Formularen
oder zu einer Best&auml;tigungsabfrage.
Es ist immer m&ouml;glich, zur&uuml;ckzugehen.

<p>Also wird "L&ouml;schen" (Auswahlnummer 1) die Person nur entfernen,
wenn du auf der n&auml;chsten Seite auf "Ok" dr&uuml;ckst.

<p>
<li>
In den Formularen kann es passieren, da&szlig; einige Felder vorausgef&uuml;llt
sind. Das hei&szlig;t nicht, da&szlig; du deren Inhalt nicht &auml;ndern kannst.

<p>So wird bei "Eltern hinzuf&uuml;gen" (Auswahlnummer 6) der Nachname
des Vaters vorausgef&uuml;llt. Aber das geschieht nur der 
Bequemlichkeit halber, da 
Vater und Kind oft denselben Nachnamen haben: Wenn aber der
Vater anders hei&szlig;t, kannst du den Namen beliebig &auml;ndern.</ul>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Part"></a>4. Einige spezifische Punkte</font></h3>
Diese Punkte sind hervorgehoben, weil sie m&ouml;gliche Fallstricke
sein k&ouml;nnen: Folge dann jeweils der angegebenen Prozedur.


<h4><a NAME="ModC"></a>4.1. Wie ändert man den Vornamen oder den Nachnamen
eines Kindes</font></h4>
Beispiel: In der Familie von "Max Meier" und "Barbara Mueller" wird eins
der Kinder "Robert" genannt, obwohl sein Vorname in Wirklichkeit "Phillip"
war:
<p>Was du machen kannst:
<ul>
<li>
Gehe zum Personendatensatz von "Robert Meier", klicke auf "Aktualisieren",
dann "&Auml;ndern" und fahre fort wie im Abschnitt "&Auml;ndern einer Person"
beschrieben (Auswahlnummer 1 in Abschnitt 3).</li>
</ul>
Was du&nbsp; <i>nicht</i> machen darfst:
<ul>
<li>
Verwende nicht "&Auml;ndern Familie" (Auswahlnummer 2 in Abschnitt 3).</li>

<p>Wenn du das tust, und im Formular "Robert" in "Phillip"
&auml;nderst, dann
<p>
<ul>
<li>
trennt das die Verbindung zwischen "Robert" und seinen Eltern und "Robert"
hei&szlig;t weiterhin "Robert Meier", aber ohne Eltern.</li>

<li>
tr&auml;gt das "Phillip Meier", wenn er existiert und noch keine Eltern
hat, als ein Kind dieses Paares ein.</li>

<li>
aber wenn dieser "Phillip Meier" in der Datenbank nicht existiert, 
oder bereits existiert, aber schon Eltern hat, wird eine Fehlermeldung
angezeigt und nichts ge&auml;ndert (gl&uuml;cklicherweise).</li>
</ul>
</ul>


<h4><a NAME="AddC"></a>4.2. Wie wird ein Kind einer Familie hinzugef&uuml;gt</font></h4>
In der Familie von "John Meier" und "Barbara Mueller" willst
du "Hubert" als ein Kind hinzuf&uuml;gen:
<p>Was du machen kannst:
<ul>
<li>
Gehe zum Personendatensatz eines der Elternteile, klicke auf
"Aktualisieren", dann "Familie &auml;ndern" (Auswahlnummer 2 in Abschnitt
3), und f&uuml;ge das Kind hinzu wie in Abschnitt "Familie &auml;ndern"
beschrieben.</li>
</ul>
Was du <i>nicht</i> machen darfst:
<ul>
<li>
Verwende nicht "Familie hinzuf&uuml;gen" (Nummer 4 in Abschnitt 3),
denn das bedeutet nicht "f&uuml;ge ein Kind einer Familie hinzu",
sondern "f&uuml;ge eine neue Ehe hinzu", was einen neuen Eintrag
"Familie" mit einer neuen Gattin erzeugt.</li>
</ul>

<ul>
<li>
Wenn das Kind schon in der Datenbank existiert und du willst
es der Liste der Kinder eines schon existierenden Paares hinzuf&uuml;gen,
verwende nicht "Eltern hinzuf&uuml;gen" (Auswahlnummer 4 in Abschnitt 3).

<p>Die Auswahl "Eltern hinzuf&uuml;gen" dient n&auml;mlich dazu,
Eltern zu einem deiner Vorfahren hinzuzuf&uuml;gen. Diese Funktion erzeugt
au&szlig;erdem eine neue Familie.</ul>

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Form"></a>5. Formulare</font></h3>

<h4><a NAME="AddF"></a>5.1. Familie hinzuf&uuml;gen</font></h4>

Du siehst dieses Formular mit der &Uuml;berschrift "Familie hinzuf&uuml;gen":
<ul>
<li>
entweder von der Startseite, wenn du auf "Familie hinzuf&uuml;gen" klickst;
in diesem Fall ist kein Bereich des Formulars vorausgef&uuml;llt,</li>

<li>
oder von einem Personendatensatz aus, nachdem du auf "Aktualisieren",
dann "Familie hinzuf&uuml;gen" geklickt hast; in diesem Fall sind die Bereiche
"Vorname", "Nachname" und "Nummer" vorausgef&uuml;llt, f&uuml;r den Vater
oder die Mutter entsprechend dem Geschlecht der Person,</li>

<li>
oder, im selben Kontext, nachdem man auf "Eltern hinzuf&uuml;gen" geklickt
hat, wenn diese Auswahl existierte; in diesem Fall ist das "Nachname"-Feld
des Vaters vorausgef&uuml;llt, genauso die Felder "Vorname", "Nachname"
und "Nummer" des ersten (und einzigen) Kindes. 
Beachte, da&szlig; du den Nachnamen
des Vaters beliebig &auml;ndern kannst, wenn er von dem des
Kindes verschieden ist.</li>
</ul>
Dieses Formular verh&auml;lt sich exakt wie "Familie &auml;ndern",
au&szlig;er da&szlig; es eine neue Familie erzeugt. Sooft du es verwendest,
wird eine neue Familie angelegt.
<p>Das hei&szlig;t, da&szlig; wenn du bemerkst, da&szlig; du Fehler gemacht hast,
nachdem das Formular abgeschickt wurde, darfst du nicht nochmal "Familie
hinzuf&uuml;gen", sondern mu&szlig;t "Familie &auml;ndern"!
<p>Weiter siehe n&auml;chster Absatz, wo
das Ausf&uuml;llen des Formulares beschrieben wird.


<h4><a NAME="ModF"></a>5.2. Familie &auml;ndern</font></h4>

Du siehst dieses Formular von einem Personendatensatz ausgehend, nachdem du
auf "Aktualisieren", dann "Familie &auml;ndern" geklickt hast. Dieses Formular
ist vorausgef&uuml;llt mit "Vorname", "Nachname" und "Nummer" von Vater,
Mutter und Kindern, sowie allen m&ouml;glichen Daten zu dieser Familie.
<p>
Dieses Formular funktioniert wie das von "Familie hinzuf&uuml;gen" des
vorherigen Abschnitts (au&szlig;er da&szlig; keine neue Familie angelegt wird).
Das folgende gilt demnach genauso f&uuml;r das Formular "Familie hinzuf&uuml;gen".
<p><b>Ausf&uuml;llen</b>
<p>Alle Felder (vorausgef&uuml;llt oder nicht) k&ouml;nnen gef&uuml;llt,
gel&ouml;scht oder ge&auml;ndert werden. Wenn du alles, was du f&uuml;r
n&ouml;tig h&auml;ltst, ausgef&uuml;llt, gel&ouml;scht und ge&auml;ndert
hast, gehe ans Ende des Formulars und klicke auf "Ok".
<p>In dem Bereich mit den Personen beachte die Auswahl von "Verbinden"
und "Erzeugen". Fallabh&auml;ngig wird eins davon vorausgew&auml;hlt. Du
kannst diese Auswahl &auml;ndern entsprechend dessen, was du tun willst.
<ul>
<li>
"Verbinden" hei&szlig;t, da&szlig; die Person schon in der Datenbank existiert.
Beim Best&auml;tigen checkt das System, ob diese Person existiert und,
bei einem Elternteil, ob dieser dem richtigen Geschlecht entspricht.</li>

<p>Beachte: Da dies eine Suche nach "Schl&uuml;ssel" ist (siehe erster
Abschnitt), ist es nicht notwendig, Betonungszeichen, Klein- und Gro&szlig;schreibung
zu beachten.</ul>

<ul>
<li>
"Erzeugen" hei&szlig;t, da&szlig; die Person in der Datenbank nicht existiert
und
da&szlig; das System beim Best&auml;tigen die Person anlegen soll mit dem angegebenen
Vornamen, Nachnamen und Nummer.</li>

<p>
Hier mu&szlig;t du - im Unterschied zum "Verbinden" - die Betonungszeichen,
Gro&szlig;- und Kleinbuchstaben korrekt schreiben: Die Person wird erzeugt
mit der angegebenen Schreibung.
<p>
Du kannst das Geschlecht und den Geburtstag des Kindes eingeben. F&uuml;r
dessen andere Personendaten mu&szlig; sp&auml;ter "Aktualisieren"
von dessen Personenseite aus aufgerufen werden.</ul>
Beim Best&auml;tigen werden die "Kinder"-Felder ignoriert, deren Feld "Vorname"
leer ist, unabh&auml;ngig vom Inhalt der anderen Felder. Sie werden
behandelt, als w&uuml;rden sie nicht existieren.
<p>
Bei Kindern ist das Feld "Nachname" optional: Wenn es fehlt, wird der
Name des Vaters verwendet.
<p>
<b>Einige &Auml;nderungen</b>
<p>&nbsp;Hier sind einige &Auml;nderungen, die du durchf&uuml;hren kannst:
<ul>
<li>
<b>Um ein Kind hinzuzuf&uuml;gen</b>, wenn kein freier Bereich daf&uuml;r
da ist, klicke zuerst auf die Taste "Kind einf&uuml;gen" entsprechend des
Platzes, wo du es in der Familie hinzuf&uuml;gen willst. Dann klicke auf
"Ok" am Ende des Formulars.</li>

<p>Anmerkung: Das best&auml;tigt das Formular nicht sofort. Das System
liefert jetzt nur ein anderes Formular mit einem reservierten Platz f&uuml;r
das Kind oder die Kinder, die du hinzuf&uuml;gen willst.
<p>
Daher eine Warnung: Solange du auf "Kind einf&uuml;gen" und dann auf
"Ok" dr&uuml;ckst, wird das Formular noch nicht abgeschickt: Es erscheint
nur ein gr&ouml;&szlig;eres Formular. Du darfst diese Taste nicht interpretieren
als "f&uuml;ge das Kind hinzu, was ich gerade eingegeben habe": Das System
sieht das, keine Angst.
<p>Das Kind, welches du in das daf&uuml;r erzeugte Feld eintr&auml;gst,
kann eine existierende Person in der Datenbank sein. In diesem Fall w&auml;hle
"Verbinden" statt "Erzeugen".</ul>

<ul>
<li>
<b>Um ein Kind zu l&ouml;schen</b>, l&ouml;sche einfach seinen Vornamen.
Wie oben erw&auml;hnt, werden Eintr&auml;ge, deren Vornamenfeld leer ist,
beim Best&auml;tigen ignoriert. Merke, da&szlig; dies nicht die Person l&ouml;scht:
Diese wird nur von der Liste der Kinder entfernt und bleibt ohne Eltern bestehen.</li>
</ul>

<ul>
<li>
<b>Um die Position eines Kindes zu &auml;ndern</b>, ist der einfachste
Weg, auf "Kind einf&uuml;gen" zu klicken auf der Position, auf die es gesetzt
werden soll, und auf&nbsp; "Ok" zu dr&uuml;cken. Im neu angezeigten Formular
gib die Daten des Kindes an der neuen Stelle ein, w&auml;hle "Verbinden"
anstelle von "Erzeugen" und l&ouml;sche den Vornamen an der alten Position.</li>
</ul>

<ul>
<li>
<b>Um die Position von zwei Kindern zu tauschen</b>, kannst du in der gleichen
Weise verfahren, indem eine neue Position erzeugt und dann per Ausschneiden
und Einf&uuml;gen getauscht wird. Vergi&szlig; nicht,&nbsp; "Verbinden"
auszuw&auml;hlen.</li>

<p>Du kannst das aber auch direkt machen, ohne einen neuen Platz hinzuzuf&uuml;gen:
Dann entsteht aber das Problem, da&szlig; du dir den einen der beiden Namen 
merken mu&szlig;t,
wenn du ihn l&ouml;schst, um den anderen an dieser Stelle einzutragen.</ul>

<b>Best&auml;tigung</b>
<p>Das Best&auml;tigen findet statt, wenn du auf "Ok" dr&uuml;ckst.
Solange du das nicht tust, wird keine Ver&auml;nderung an der Datenbank
vorgenommen.
<p>Merke auch, da&szlig;, wie oben gesagt, wenn ein oder mehrere Male "Kind einf&uuml;gen"
ausgew&auml;hlt ist, nur ein neues Formular erzeugt wird: Das ist <i>kein</i>
richtiges Best&auml;tigen.
<p>Wenn das Best&auml;tigen wirklich stattgefunden hat, mu&szlig;t du eine
neue Seite sehen, deren Titel lautet:
<ul>
<li>
Entweder: <b>Familie hinzugef&uuml;gt oder ge&auml;ndert</b></li>

<p>Du siehst dann die Namen der Eltern, auf die du klicken kannst.
<p>Es kann auch sein, da&szlig; du Warnungen siehst. Diese betreffen Inkonistenzen
bei Datums- oder Kinderreihenfolge. 
Die &Auml;nderung wurde trotzdem ausgef&uuml;hrt,
aber m&ouml;glicherweise ist es besser, die
aufgelisteten Probleme zu beheben.
<p>Wenn du auf eines der Elternteile klickst, siehst du dessen 
Personendatensatz. Aber deine &Auml;nderung kann unsichtbar sein. Webbrowser behalten
bereits angezeigte Seiten normalerweise im Speicher, und zeigen m&ouml;glicherweise
die alte Version an. Gehe auf "Seite neuladen" in deinem Webbrowser um
die &Auml;nderungen wirklich zu sehen.</ul>

<ul>
<li>
Oder: <b>Fehler</b></li>

<p>Die Seite zeigt den aufgetretenen Fehler an. Gehe zur&uuml;ck
und behebe diesen. Man kann das auch sein lassen ... einfach nichts machen
und weiter in der Datenbank arbeiten.
<p>Wenn der Fehler anzeigt, da&szlig; eine Person schon existiert, hei&szlig;t
das, da&szlig; du eine Person anlegen wolltest, deren Kombination aus "Vorname",
"Nachname", "Nummer" bereits in der Datenbank existiert.
<p>L&ouml;sung:
<p>
<ul>
<li>
Wenn du wirklich eine Person neu anlegen wolltest, gehe zur&uuml;ck und
&auml;ndere deren Nummer. Beachte da&szlig; die Fehlerseite die erste freie,
also verf&uuml;gbare Nummer anzeigt: W&auml;hle diese oder eine andere
aus. Wenn es mehrere Personen mit demselben Namen gibt, wird eine Liste
angezeigt.</li>

<li>
Wenn dies die richtige Person war die du haben wolltest, gehe zur&uuml;ck
und &auml;ndere "Hinzuf&uuml;gen" zu "Verbinden"."</li>
</ul>
<p>
Dann dr&uuml;cke wieder auf "Ok".
<p>Wenn der Fehler dir angezeigt hat, da&szlig; eine Person nicht existiert,
hei&szlig;t das, du hast "Verbinden" bei einer nicht existierenden Person
ausgew&auml;hlt. Vielleicht eine falsche Nummer gew&auml;hlt? Oder wolltest
du eigentlich eine neue Person hinzuf&uuml;gen?</ul>


<h4><a NAME="DelF"></a>5.3. Familie l&ouml;schen</font></h4>

Du siehst dieses Formular mit der &Uuml;berschrift "Familie l&ouml;schen"
von einem Personendatensatz ausgehend, nachdem du auf "Aktualisieren",
dann "Familie l&ouml;schen" geklickt hast.
<p>
Das Formular enth&auml;lt nur die "Ok"-Taste um zu best&auml;tigen,
da&szlig; du wirklich l&ouml;schen willst.
Du kannst es aber auch noch sein lassen.
<p>Wenn du auf "Ok" dr&uuml;ckst, erscheint eine neue Seite mit der &Uuml;berschrift
"Familie gel&ouml;scht".
<p>Die Familie wurde aus der Datenbank gel&ouml;scht: Vater, Mutter und
die Kinder werden voneinander getrennt. Trotzdem wird keiner 
davon gel&ouml;scht:
Nur sind Vater und Mutter nicht mehr verheiratet, sie haben nicht mehr
diese Kinder (sie k&ouml;nnen andere aus anderen Ehen haben, die 
bestehen bleiben),
die Kinder haben keine Eltern mehr.

<h4><a NAME="ModP"></a>5.4. Person &auml;ndern</font></h4>

Du siehst dieses Formular mit der &Uuml;berschrift "Person &auml;ndern"
von einem Personendatensatz ausgehend, nachdem du auf "Aktualisieren",
dann "&Auml;ndern" geklickt hast. Das Formular ist vorausgef&uuml;llt mit
allen individuellen Daten dieser Person.

<p><b>Ausf&uuml;llen</b>

<p>Alle Felder (vorausgef&uuml;llt oder nicht) k&ouml;nnen ausgef&uuml;llt,
gel&ouml;scht oder ge&auml;ndert werden. Wenn du alles, was du f&uuml;r
notwendig h&auml;ltst, ausgef&uuml;llt, gel&ouml;scht, ge&auml;ndert hast,
gehe zum Ende des Formulars und best&auml;tige das Formular durch Klicken
auf "Ok".
<p>Einige Tasten hei&szlig;en "Beiname einf&uuml;gen",
"Alias einf&uuml;gen", etc.
<p>Warnung: Dies dient nicht zum Hinzuf&uuml;gen des entsprechenden
Beinamen, Alias etc. zur Person, sondern um ein anderes Formular mit einem 
reservierten
Platz f&uuml;r eine weiteren Beinamen, ein anderes Alias etc. zu erzeugen.
<p>Wenn du also auf "Ok" dr&uuml;ckst, nachdem du eine oder mehrere dieser
Tasten ausgew&auml;hlt hast, wird ein neues, gr&ouml;&szlig;eres Formular
angeboten, aber es ist noch keine &Auml;nderung erfolgt.
<p>Solltest du daher, nach einem "Ok", ein neues &Auml;nderungsformular
sehen, hei&szlig;t das, da&szlig; das Best&auml;tigen noch nicht erfolgt ist,
auch wenn eine Menge von Feldern ausgef&uuml;llt ist.

<p><b>Verschiedene Felder</b>

<p>Beachte die Bedeutung der verschiedenen Felder, speziell die Verwendung
von "&Ouml;ffentlicher Name", "Beiname", "Alias" usw. die alle eine sehr
spezielle Bedeutung haben.
<ul>
<li>
<b>Vorname</b> und <b>Nachname</b> haben ihre gew&ouml;hnliche Bedeutung.
Zusammen mit der <b>Nummer</b> hat die Person einen eindeutigen "Zugriffsschl&uuml;ssel"
wie am Anfang dieses Kapitels gezeigt.</li>

<p>Wir empfehlen, den allgemeinen Vornamen in das Vornamenfeld zu
schreiben. Die anderen Vornamen (komplette Vornamen, andere m&ouml;gliche
Vornamen, andere Schreibungen von Vornamen usw) sollten besser in das Feld
"Vornamen-Alias" (darunter). Namen mit Zahl wie bei adligen und k&ouml;niglichen
Personen geh&ouml;ren besser in das Feld "&Ouml;ffentlicher Name".

<p>Grund hierf&uuml;r ist, da&szlig; der Vorname in der Liste der
Vornamen gespeichert wird. So wird es m&ouml;glich zu wissen, was der
h&auml;ufigste Vorname ist,
zu sehen, welche anderen Personen den gleichen Vornamen haben etc. Die
anderen Arten von Vornamen k&ouml;nnten sonst nur als ein Exemplar 
existieren.</ul>

<ul>
<li>
<b>&Ouml;ffentlicher Name</b> ist der Name, unter dem die Person bekannt
ist. Beispiel: "Edward VII" (sein Vorname ist "Edward" und sein Nachname
"Windsor").</li>

<p>Die Personen, die einen &ouml;ffentlichen Namen haben, sind in der
Navigation &uuml;ber diesen Namen zu finden.

<p>Wenn es einen &ouml;ffentlichen Namen gibt, wird dieser als Titel im
Personendatensatz angezeigt anstelle von "Vorname Nachname",
welche darunter und in kleineren Buchstaben erscheinen.</ul>

<ul>
<li>
<b>Bild</b> ist eine ".gif", ".jpg" oder ".png"-Datei, die dieser
Person zugeordnet ist und 
die in deren Personendatensatz mit angezeigt wird. Dies kann
eine URL-Adresse sein (beginnend mit "http://...") oder nur ein Name, den
das System in den Verzeichnissen "images", Unterverzeichnis "base" (wobei
"base" der Name der Datenbank ist) w&auml;hrend der Anzeige sucht.</li>

<p>Wenn du keinen Dateinamen angibst, existiert ein Default-Name.

<p>Dieser Name besteht aus dem Vornamen, einem Punkt, der Nummer, einem
weiteren Punkt, dem Nachnamen, alles kleingeschrieben, ohne Betonungszeichen
und alle nicht-Buchstaben-Zeichen konvertiert zu Unterstrichen.
<p>Beispielsweise hat eine Person namens "Anne-C&eacute;cile Dupont de
Nemours" als Standard-Bild-Namen:
<pre>&nbsp;&nbsp; anne_cecile.0.dupont_de_nemours</pre>
<font color=#2f6400><b>GeneWeb</b></font> sucht eine Datei mit diesem Namen, gefolgt von&nbsp; ".gif",
".jpg" oder ".png" im obigen Verzeichnis der Bilder der Datenbank.</ul>

<ul>
<li>
<b>Beiname</b> ist der Teil des Namens, der an den &ouml;ffentlichen Namen
von ber&uuml;hmten Personen angeh&auml;ngt wird. So z. B. "der Dicke" f&uuml;r
"Louis VI der Dicke".</li>

<p>Auf Personen kann mit diesem Beinamen anstelle ihres Nachnamens
zugegriffen werden. So kann auf "Louis VI der Dicke " zugegriffen werden
durch "Louis VI" (&ouml;ffentlicher Name), "Louis VI der Dicke", "Louis
der Dicke", "Louis Capet", etc. Merken wir uns, da&szlig; "der Dicke" niemals
allein als Nachname betrachtet wird.

<p>Es kann meherere Beinamen geben: So ist "William der Eroberer" 
auch bekannt
als "William der Bastard". Daher ben&ouml;tigst du ein Feld f&uuml;r
die Beinamen "der Eroberer" und ein weiteres f&uuml;r "der Bastard".
Daher ist "Beiname einf&uuml;gen" n&uuml;tzlich.

<p>Wenn es einen Beinamen gibt, wird der &ouml;ffentliche Name (oder der
Vorname, wenn es keinen &ouml;ffentlichen Namen gibt), gefolgt vom
Beinamen als Titel im Personendatensatz angezeigt, anstelle
des normalen "Vorname Nachname", welches darunter in kleineren Buchstaben
erscheint.</ul>

<ul>
<li>
<b>Alias</b> ist ein Name, durch den die Person bekannt ist, ohne
da&szlig;
dies eine Alternative f&uuml;r einen Vornamen ist 
(wie z. B. der "&ouml;ffentliche Name").</li>

<p>So ist "Norma Jean Mortenson" bekannt als "Marilyn Monroe". Beachte,
da&szlig; der Alias aus einem Teil besteht: Kombinationen wie
"Norma Jean Monroe" oder "Marilyn Mortenson" werden nicht akzeptiert.
<p>Wenn es einen oder mehrere Aliase gibt, werden diese in kleiner Fettschrift
unter dem Titel angezeigt.</ul>

<ul>
<li>
<b>Vornamen-Alias</b> kann mehrere Verwendungen haben:</li>

<p>
<ul>
<li>
das kann die komplette Liste der Vornamen sein.</li>

<li>
das kann ein Spitzname sein f&uuml;r enge Beziehungen sein: "Bob" f&uuml;r
"Robert".</li>

<li>
dies kann ein anderer Vorname sein, oder der gleiche mit einer anderen 
Schreibweise,
f&uuml;r den Fall von Personen aus alten Zeiten, deren Vorname nicht sicher
ist, oder in verschiedenen Quellen verschieden geschrieben wird.</li>
</ul>
<p>
Es k&ouml;nnen mehrere Vornamen-Aliase existieren.
<p>
Vornamen-Aliase k&ouml;nnen verwendet werden anstelle des Vornamens
bei Anfragen, aber sie werden nicht als richtige Vornamen betrachtet, 
d.&nbsp;h. sie werden nicht in der Liste der Vornamen gef&uuml;hrt etc.

<p>Wenn es Vornamen-Aliase gibt, werden diese im Personendatensatz
angezeigt, in Kleinbuchstaben unter dem Titel.</ul>

<ul>
<li>
<b>Nachnamen-Alias</b> kann als alternativer Nachname benutzt werden,
wenn du eine andere Version des Namens haben willst, z. B. mit einer anderen
Schreibweise. Dessen Verwendung ist nicht h&auml;ufig.</li>
</ul>

<ul>
<li>
<b>Geburt</b> erlaubt die Angabe von Datum und Ort von Geburt und Taufe.
Nicht besonders schwierig.</li>
</ul>

<ul>
<li>
<b>Tod</b> erlaubt die Angabe von Informationen &uuml;ber den Tod.
Ebenfalls nicht besonders kompliziert, au&szlig;er der 
"automatischen Auswahl" welche wir hier erkl&auml;ren.</li>

<p>Die "automatische Auswahl" erfolgt, wenn die Auswahl des ersten
Men&uuml;s des "Tod"-Feldes ein"-" enth&auml;lt. Das zeigt an,
da&szlig; jemand
nicht wei&szlig;, ob die Person tot ist oder nicht.
<p>
Wenn in diesem Fall kein Todesdatum oder -ort angegeben ist, w&auml;hlt
das System entsprechend dem Geburtsdatum f&uuml;r dich aus, ob die Person
tot ist oder nicht:
Wenn sie weniger als 80 Jahre alt ist, entscheidet es
"nicht tot", zwischen 81 und 120 Jahren "unbekannt", und bei mehr als 120
Jahren entscheidet es "tot".
<p>
Wenn diese automatische Auswahl nicht pa&szlig;t, kannst du selbst die
richtige Wahl im ersten Men&uuml; treffen anstelle des angezeigten "-".
<p>
Beachte, da&szlig; das Alter der Personen, deren Tod "unbekannt" ist, weder
auf deren Personenseite noch bei den Jubil&auml;en angezeigt
wird. Daher w&auml;hle, wenn eine Person zwischen 81 und 120 Jahren alt
ist, "nicht tot".</ul>

<ul>
<li>
<b>Beruf</b> enth&auml;lt den Beruf. Wenn du einen Adelstitel
eintragen willst, benutze lieber die "Titel"-Felder darunter.</li>
</ul>

<ul>
<li>
<b>Titel</b> enth&auml;lt den Adelstitel. Es kann mehrere davon geben.
Um ein Formular mit mehr Platz f&uuml;r die Titel zu erhalten, klicke ein
oder mehrere Male auf "Titel einf&uuml;gen", gehe ans Ende des Formulars
und dr&uuml;cke "Ok".</li>

<p>Titel bestehen aus zwei Teilen: Dem Titel selbst und dem Ort. Der
Titel selbst enth&auml;lt den Rang: "Graf", "Herzog", "K&ouml;nig" etc.
Der Ort enth&auml;lt die Erg&auml;nzung: "von Warwick", "von Sachsen",
"von England" etc.
<p>
Beachte das Partikel: In der Anzeige siehst du die Kombination von
Rang und Ort: "Graf von Warwick", "Herzog von Sachsen", "K&ouml;nig von
England", welche klickbare Felder sind, die es erlauben, alle Personen
anzuzeigen, die diesen Titel tragen.
<p>Aber die Trennung dieser Begriffe erlaubt die Auswahl von z. B. allen
"Graf", allen "Herzog", allen "K&ouml;nig" (der Plural darf nicht verwendet
werden), und umgekehrt allen Titeln, die mit "von Warwick", "von Sachsen",
"von England" etc. enden.
<p>Das Feld "Name" repr&auml;sentiert einen &ouml;ffentlichen Namen verbunden
mit dem Titel. Zum Beispiel wird "Charles Quint" genannt "Charles I" als
"K&ouml;nig von Spanien", "Charles IV" als "K&ouml;nig von Sizilien" etc.
<p>Das Feld "N-ten" wird verwendet f&uuml;r Titel in Verwendung mit einer
Nummer. Beispiel: F&uuml;r den "5ten Herzog von Hamilton", nimm die Zahl
"5". Verwechsle das nicht mit "Edward VII" dessen Nummer anzeigt,
da&szlig;
er der 7te "Edward" der Abstammung nach ist, nicht aber der 7te "K&ouml;nig
von Gro&szlig;britannien".
<p>
Mit der Taste "Haupttitel" kann ausgew&auml;lht werden,
welcher Titel verwendet werden soll, wenn diese Person auf einfache
Weise angezeigt wird (zum Beispiel auf der Seite seiner Gattin oder der
seiner Kinder). 
Dies hat nur Bedeutung, wenn es mehrere Titel gibt.
<p>
Die n&auml;chsten beiden Felder geben die Daten von Beginn und Ende
der Regentschaft an.
<p>Um einen Titel zu l&ouml;schen, entferne nur den Inhalt des ersten Feldes
"Titel".</ul>

<ul>
<li>
<b>Zugriff</b> erlaubt es, den Zugriff auf die pers&ouml;nlichen Informationen
einzustellen. Dies wird angewandt auf die Personen der "Jetzt-Zeit", d.h.
jene, deren Daten (Geburt, Tod etc.) j&uuml;nger als 100 Jahre sind:</li>

<p>
<ul>
<li>
Standardm&auml;&szlig;ig werden Personen, die Adelstitel haben oder
bei denen ein Elternteil einen Adelstitel hat, als "&ouml;ffentliche" Personen
betrachtet und ihre pers&ouml;nlichen Informationen werden immer angezeigt.</li>

<li>
Wenn "&ouml;ffentlich" ausgew&auml;hlt wird, werden die pers&ouml;nlichen
Informationen immer angezeigt, auch wenn die Person keine Adelstitel hat.</li>

<li>
Wenn "privat" ausgew&auml;hlt wird, werden die Informationen nicht angezeigt,
auch wenn die Person Adelstitel hat.</li>
</ul>

<p>
Bei "Wizard"- oder "Freund"-Eintr&auml;gen (per Kennwort) werden die pers&ouml;nlichen
Informationen immer angezeigt.</ul>

<ul>
<li>
<b>Notizen</b> enth&auml;lt Bemerkungen zu der Person. In
der Personendatensatzseite wird der Text ohne Leerzeilen angezeigt,
auch wenn du Leerzeilen in deinem Text hast. Um eine richtige Leerzeile
einzuf&uuml;gen, schreibe "&lt;br&gt;" an die gew&uuml;nschte Stelle.
</ul>

<ul>
<li>
<b>Quelle</b> erlaubt die Aufzeichnung von Kurzinformationen &uuml;ber
den Ursprung der Daten: Ein Name, eine Abk&uuml;rzung, ein Buchtitel,
ein Code. So wei&szlig; man, woher die Informationen stammen.</li>

<p>Dies ist nicht gedacht f&uuml;r lange Informationen, wie "die Kopie
des im Rathaus gefundenen Dokumentes": Benutze daf&uuml;r besser das Feld 
"Notizen".
</ul>

<b>Best&auml;tigen</b>
<p>Das Best&auml;tigen findet statt, wenn du auf "Ok" klickst. 
Solange du dies nicht machst, werden keine Ver&auml;nderungen an der Datenbank
durchgef&uuml;hrt.
<p>Merke also, da&szlig; - wie oben erw&auml;hnt - wenn ein oder mehrere Male
"Einf&uuml;gen" ausgew&auml;hlt wurde, nur ein neues Formular geliefert
wird: Das ist <i>nicht</i> das richtige Best&auml;tigen.

<p>Wenn das Best&auml;tigen erfolgt ist, mu&szlig;t du eine neue Seite
sehen, deren Titel lautet:
<ul>
<li>
entweder: <b>Person ge&auml;ndert</b></li>

<p>Du siehst den Namen der Person und kannst darauf klicken.
<p>Es kann auch sein, da&szlig; du Warnungen siehst. Diese betreffen Datumsinkonsistenzen.
Die Aktualisierung wird trotzdem durchgef&uuml;hrt, aber diese sollten
besser korrigiert werden.
<p>Wenn du auf eine Person klickst, siehst du deren Personendatensatz.
Aber deine Aktualisierung k&ouml;nnte unsichtbar sein. Webbrowser behalten
oftmals schon angezeigte Seiten im Speicher und zeigen m&ouml;glicherweise
die alte Version an. Gehe auf "Seite aktualisieren" in deinem Webbrowser
um wirklich die &Auml;nderungen zu sehen.</ul>

<ul>
<li>
oder: <b>Fehler</b></li>

<p>Die Seite zeigt den aufgetretenen Fehler. Gehe zur&uuml;ck und behebe
ihn. Du kannst es aber auch sein lassen ... mache einfach nichts und arbeite
weiter mit der Datenbank.
<p>Wenn der Fehler anzeigt, da&szlig; eine Person schon existiert, hei&szlig;t
das, da&szlig; du Vorname, Nachname oder die Nummer ge&auml;ndert hast
(du hast nat&uuml;rlich das absolute Recht dies zu machen), aber die neue
Auswahl steht im Konflikt mit einer anderen Person in der Datenbank.
<p>L&ouml;sung: Gehe zur&uuml;ck und &auml;ndere die Nummer. Beachte,
da&szlig;
die Fehlermeldung dir daf&uuml;r eine frei verf&uuml;gbare Nummer angeboten hat.
Nimm diese oder eine andere. Wenn es mehrere Personen mit dem selben Namen
gibt, wird eine Liste angezeigt.</ul>


<h4><a NAME="DelP"></a>5.5. Person l&ouml;schen</font></h4>

Du siehst das Formular mit der &Uuml;berschrift "Person l&ouml;schen" von
einem Personendatensatz ausgehend, nachdem du auf "Aktualisieren",
dann "L&ouml;schen" klickst.
<p>
Das Formular enth&auml;lt nur die "Ok"-Taste um zu best&auml;tigen,
da&szlig; du wirklich l&ouml;schen willst.
Du kannst es aber auch noch sein lassen.
<p>
Wenn du auf "Ok" dr&uuml;ckst, erscheint eine neue Seite mit dem Titel
"Person gel&ouml;scht".
<p>
Die Person wird nicht direkt gel&ouml;scht. Ihre Personendaten
werden entfernt (einschlie&szlig;lich Vor- und Nachname) wie auch
die Verbindung mit ihren Eltern.
<p>Jedoch bleibt ein "Personenobjekt" bestehen, das verbunden mit
seiner/m Ehegattin/en und den Kindern ist.


<h4><a NAME="SndP"></a>5.6. Bild senden</font></h4>

Du siehst dieses Formular mit der &Uuml;berschrift "Bild senden" von einem
Personendatensatz ausgehend, nachdem du auf "Aktualisieren", dann "Bild
senden" geklickt hast, aber nur wenn der Eigent&uuml;mer der Datenbank
die <a href="start.htm#Cnf">Berechtigung</a> daf&uuml;r gegeben hat und
wenn das Feld "Bild" der Person leer ist.
<p>Du kannst eine "gif", "jpeg" oder "png" Datei senden (uploaden), welche mit
der Person verkn&uuml;pft wird. Diese Datei wird auf der Website abgespeichert.
Wenn die Person schon ein Bild hatte, wird es durch das neue ersetzt.
<p>Beachte: Wenn das Feld "Bild" der Person nicht leer ist, hast du keinen
Zugriff auf "Bild senden". Wenn du dies tun willst, so gehe erst auf "Aktualisieren",
"&Auml;ndern", und l&ouml;sche den Inhalt des Feldes "Bild".


<h4><a NAME="DelPh"></a>5.7. Bild l&ouml;schen</font></h4>

Du siehst dieses Formular mit der &Uuml;berschrift "Bild l&ouml;schen"
von einem Personendatensatz ausgehend, nachdem du auf "Aktualisieren",
dann "Bild l&ouml;schen" geklickt hast, aber nur wenn der Eigent&uuml;mer
der Datenbank dir die <a href="start.htm#Cnf">Berechtigung</a> daf&uuml;r
gegeben hat.
<p>Wenn du auf "Ok" klickst, wird das mit der Person verbundene Bild gel&ouml;scht.


<h4><a NAME="ChgC"></a>5.8. Namen der Kinder &auml;ndern</font></h4>

Du siehst dieses Formular von einem Personendatensatz ausgehend, nachdem 
du auf "Aktualisieren", dann "Namen der Kinder &auml;ndern" geklickt hast.
<p>
Alle Kinder der Person werden angezeigt. Es ist m&ouml;glich, den Vornamen,
den Nachnamen und die Nummer jedes Kindes zu &auml;ndern.
<p>
Interessante M&ouml;glichkeit: Wenn der Nachname eines Kindes gel&ouml;scht
wird, wird automatisch der Nachname der Eltern verwendet.
<p>
Das kann bequem sein, um den Nachnamen eines ganzen Zweiges zu &auml;ndern:
Man &auml;ndert mit "&Auml;ndern" den Nachnamen des Vorfahren. Dann
geht man zu "Namen der Kinder &auml;ndern" beim Vorfahren und l&ouml;scht 
einfach
in diesem Formular die Nachnamen der Kinder, was eine schnelle Operation
ist. Dann macht man mit den Kindern weiter.
<p>
Dies kann auch genutzt werden, um den Vornamen eines Kindes zu korrigieren.
Aber wenn es nur um ein Kind geht, kann dies mit "Person &auml;ndern" erfolgen.


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="MrgP"></a>6. Zusammenf&uuml;hren zweier Personen</font></h3>
Dieser Abschnitt beschreibt, wie zwei <b>Personen</b> in einer Datenbank
zusammengef&uuml;hrt werden, f&uuml;r den Fall, da&szlig; diesselbe Person 
zweimal eingetragen wurde.
<p>
Beachte: Wir sprechen hier nicht dar&uuml;ber, wie zwei <b>Datenbanken</b>
zusammenzuf&uuml;hren sind, dies wird <a href="merge.htm">woanders</a>
betrachtet. Es ist nicht m&ouml;glich, dies online zu tun (dieses Kapitel 
bezieht sich nur auf Online-&Auml;nderungen).
<p>Das Zusammenf&uuml;hren von zwei Personen erfolgt zwar ziemlich manuell,
aber du beh&auml;ltst
stets eine zusammenh&auml;ngende Datenbank.
<p>Das Prinzip ist das folgende:
<ul>
<li>
Du w&auml;hlst die zwei Personen, die zusammengef&uuml;hrt werden
sollen. Aber es gibt dort die Schwierigkeit
ihrer Eltern. Wenn beide Eltern haben, m&uuml;ssen ihre Eltern zuerst 
zusammengef&uuml;hrt 
werden. Und es ist notwendig, wieder mit den Eltern der Eltern usw. zu
beginnen.</li>
</ul>
Es ist daher notwendig, die Vorfahren zu scannen, bis wir
"zusammenf&uuml;hrbare" finden.
<font color=#2f6400><b>GeneWeb</b></font> 
macht diese Arbeit f&uuml;r dich: Es zeigt dir die
zusammenf&uuml;hrbaren Vorfahren an.

<p>Hier steht wie das geht. Folge den untenstehenden Anweisungen w&auml;hrend
des Zusammenf&uuml;hrens:
<ul>
<li>
Nimm zwei Fenster deines Webbrowsers.</li>
</ul>

<ul>
<li>
Im linken Fenster, suche die erste zusammenzuf&uuml;hrende Person.</li>
</ul>

<ul>
<li>
Im anderen, rechten Fenster suche die zweite Person.</li>
</ul>

<ul>
<li>
In beiden Fenstern gehe auf "Aktualisieren".</li>
</ul>

<ul>
<li>
Im linken Fenster gehe auf "Zusammenf&uuml;hren".</li>
</ul>

<ul>
<li>
In das Formular trage Vorname, Punkt, Nummer und Nachname der zweiten Person
ein. Du findest dies im Titel des rechten Fensters. Verwende "Ausschneiden/Einf&uuml;gen"
wenn m&ouml;glich.</li>
</ul>

<ul>
<li>
Dann gehe auf "Ok". Von nun an ist das rechte Fenster nicht mehr n&uuml;tzlich.
Du kannst es schlie&szlig;en.</li>
</ul>

<ul>
<li>
Wenn die zwei Personen direkt "zusammenf&uuml;hrbar" sind 
(wenigstens einer von ihnen
hat keine Eltern), bietet dir <font color=#2f6400><b>GeneWeb</b></font> an, diese
zusammenzuf&uuml;hren. Ansonsten
sagt es dir, da&szlig; du vorher einige Vorfahren oder Familien
zusammenf&uuml;hren mu&szlig;t.</li>
</ul>

<ul>
<li>
Wenn <b>Personen</b> gemischt werden sollen (Personen selbst oder deren
Vorfahren):</li>
<p>
<ul>
<li>
Im Falle von Vorfahren zeigt der untere Teil des Formulars die beiden
zusammenzuf&uuml;hrenden Zweige an. Mit deiner Unterst&uuml;tzung wird 
zuerst das
obere Ende zusammengef&uuml;hrt, dann die Personen zwischendrin, 
und zum Schlu&szlig;
das untere Ende, welches die &auml;nf&auml;nglich angefragten Personen
enth&auml;lt.</li> 
<li>
Das Formular enth&auml;lt die widerspr&uuml;chlichen Werte
zwischen zwei zusammenzuf&uuml;hrenden Personen,
sofern es solche Werte gibt. W&auml;hle aus und dr&uuml;cke "Ok".</li>

<li>
Du siehst dann ein Formular "Person zusammenf&uuml;hren", welches wie
das Formular "Person &auml;ndern" aussieht. Kontrolliere die
verschiedenen Felder,
f&uuml;ge hinzu, &auml;ndere, l&ouml;sche was du willst und dr&uuml;cke
"Ok".</li>

<li>
Nun werden die zwei Personen zusammengef&uuml;hrt. 
Wenn dies Vorfahren von deiner Anfangsperson
sind, schl&auml;gt dir die Seite vor, mit dem Zusammenf&uuml;hren
weiterzumachen. Klicke auf "Zusammenf&uuml;hren fortsetzen". 
Gehe weiter, bis du die beiden anf&auml;nglichen
Personen zusammengef&uuml;hrt hast.</li>
</ul>
</ul>

<ul>
<li>
Wenn <b>Familien</b> zusammengef&uuml;hrt werden sollen:</li>
<p>
<ul>
<li>
Dies passiert, wenn ein Paar von Vorfahren zusammengef&uuml;hrt wurde.
In diesem Fall bleiben zwei Familien &uuml;brig. Es ist, als ob dieses
Paar zweimal geheiratet h&auml;tte. Daher ist es notwendig, die beiden
Familien zusammenzuziehen.</li>

<li>
Zuerst w&auml;hle, wie im obigen Fall des Zusammenf&uuml;hrens von Personen, 
die m&ouml;glicherweise widerspr&uuml;chlichen Werte aus und
dr&uuml;cke "Ok".</li> 
<li>
Du siehst dann das Formular "Familie zusammenf&uuml;hren", welches
aussieht wie "Familie hinzuf&uuml;gen" oder "Familie &auml;ndern".
Mache die &Auml;nderungen, die du
m&ouml;chtest. Beachte, da&szlig; einige Kinder zweimal angezeigt
werden k&ouml;nnen.  Lasse sie so: Diese k&ouml;nnen sp&auml;ter
zusammengef&uuml;rt werden.</li>

<li>
Dr&uuml;cke "Ok": Die Familien sind zusammengef&uuml;rt. Mache weiter
durch klicken auf "Zusammenf&uuml;hren fortsetzen".</li>
</ul>
</ul>

<ul>
<li>
Beachte, da&szlig; in den Formularen zum Zusammenf&uuml;hren von
Personen oder Familien die angezeigten Personen anklickbar sind. Du
kannst eine anklicken, wenn
du kontrollieren m&ouml;chtest, ob dieses Zusammenf&uuml;hren richtig
ist (gehe danach mittels Webbrowser zur&uuml;ck).</li>
</ul>

<ul>
<li>
Beachte auch, da&szlig; du zu jeder Zeit stoppen kannst: Die Datenbank bleibt
zusammenh&auml;ngend und die schon erfolgten Zusammenf&uuml;hrungen werden aufgezeichnet.
Du kannst sp&auml;ter wieder das Zusammenf&uuml;hren der beiden
anf&auml;nglichen Personen anfragen, das Zusammenf&uuml;hren startet
wieder dort, wo es angehalten wurde.</li>
</ul>


<p>
<hr>

<h3><font color=#2f6400>
<a NAME="MrgF"></a>7. Zusammenf&uuml;hren zweier Familien</font></h3>
Um zwei Familien zusammenzuf&uuml;hren, f&uuml;hre erst die V&auml;ter
zusammen (wenn sich diese unterscheiden) und dann die M&uuml;tter 
(wenn sie verschieden sind) entsprechend den Anweisungen im vorherigen
Abschnitt.
<p>
Dann gehe von der Seite des Vaters oder der Mutter auf "Aktualisieren".
Wenn die beiden Familien nebeneinander stehen, kannst du ein
"Zusammenf&uuml;hren"
dazwischen stehen sehen. Klicke darauf. Wenn sie nicht direkt nebeneinander
stehen, verwende "Umkehren" so oft wie n&ouml;tig.

<p>
<hr>

<h3><font color=#2f6400>
<a NAME="Dcln"></a>8. Sprachen mit Deklination</font></h3>
Einige Sprachen haben Deklinationen, d. h. die Subjekte und die Objekte
werden verschieden geschrieben entsprechend ihrem Platz innerhalb des Satzes.
Dies ist der Fall bei Tschechisch, einer der von <font color=#2f6400><b>GeneWeb</b></font> angebotenen
Sprachen.
<p>So werden die englischen Wendungen:
<pre>
   ... verheiratet mit Vladana
   ... Cousins von Vladana
</pre>
&uuml;bersetzt ins Tschechische durch:
<pre>
   ... si vzal Vladanu
   ... bratranci Vladany
</pre>
Der tschechische Vorname "Vladana" hat daher mehrere Formen: "Vladana"
ist der Nominativ, "Vladanu" der Akkusativ, "Vladany" der Genitiv.


<h4><a NAME="Data"></a>8.1. Dateneingabe</font></h4>

In der Sprache des Lexikon und bei den Daten werden diese F&auml;lle angegeben
durch einen Buchstaben, eingeschlossen durch zwei <tt>":"</tt>.
<p>So werden beim Tschechischen der Akkusativ und der Genitiv entsprechend
repr&auml;sentiert durch:
<pre>&nbsp;&nbsp; :a:
&nbsp;&nbsp; :g:</pre>
In einem Aktualisierungsformular mu&szlig;, um einen Vornamen oder 
einen Nachnamen
mit seinen Deklinationen einzugeben, der Nominativ gefolgt von
Code und Form jedes Falles angegeben werden. Zum Beispiel f&uuml;r "Vladana":
<pre>&nbsp;&nbsp; Vladana:a:Vladanu:g:Vladany</pre>
Zwei Abk&uuml;rzungen sind m&ouml;glich:
<ul>
<li>
Eine Form beginnend mit '+' zeigt an, da&szlig; man mit dem Nominativ beginnen
mu&szlig;: So "Adler:g:+a" hei&szlig;t da&szlig; der Genitive von "Adler" "Adlera"
ist.</li>

<li>
Eine Form beginnend mit '-' zeigt auch an da&szlig; man mit dem Nominativ beginnt,
aber indem man den letzten Buchstaben entfernt ('--' f&uuml;r die letzten
beiden Buchstaben und so weiter).</li>
</ul>
Die Form mit '-' kann f&uuml;r "Vladana" verwendet werden:
<pre>&nbsp;&nbsp; Vladana:a:-u:g:-y</pre>


<h4><a NAME="Disp"></a>8.2. Anzeige, Dokumentation</font></h4>

Auf der Seite ist normalerweise nur der Nominativ sichtbar. Die anderen
Formen werden nur benutzt, wenn die Ausdr&uuml;cke f&uuml;r die Sprache
danach fragen.
<p>Wenn mit einer Sprache ohne Deklinationen gebrowst wird, wird der Nominativ
systematisch angezeigt.
<p>Die komplette Form (mit den kompletten Beschreibungen der Formen) erscheint
nur in den Aktualisierungsformularen.
<p>Es gibt keine Dokumentation der verschiedenen benutzten F&auml;lle,
weil diese von der Sprache abh&auml;ngen. Der bessere Weg ist, ins Lexikon
zu schauen. Dieses kann von der Startseite aus aufgerufen werden durch
Klicken auf "lexicon" am Fu&szlig; der Seite. Schaue auf die Wendungen
entsprechend deiner Sprache.
<p>

<font size=-1><a name=note>Anmerkung</a>: im "Schl&uuml;ssel" einer Person werden
alle akzentuierten Vokale als ihre unakzentuierten &Auml;quivalente behandelt;
<font color=#2f6400><b>GeneWeb</b></font> unterstellt die Verwendung der Westeuropa-Sprachcodierung
(iso-8859-1). Es w&uuml;rde nicht funktionieren oder seltsame Ergebnisse anzeigen, wenn du
andere Kodierungen versuchst (z. B.Kyrillisch, Hebr&auml;isch, Chinesisch, Tschechisch).</font>
                                                                               
<p>
<hr>
<br>
<center>
Zur&uuml;ck zur <a href="diruse.htm">Gebrauchsanweisung</a>.
</center>

<p><hr><font size=-1><em>Copyright (c) 1998-2005 INRIA -
GeneWeb</em></font><br>

</body>
