<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
              "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>CDrom</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://www.geneweb.org/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Cr&eacute;er un CDrom</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Vous pouvez cr&eacute;er un CDrom de votre base de donn&eacute;es avec <font
color=#2f6400><b>GeneWeb</b></font> inclus dedans: cela vous permet de
distribuer votre base de donn&eacute;es directement utilisable.

<p>

Ce chapitre vous explique les &eacute;tapes minimums pour y arriver. Cette
installation a l'avantage que l'utilisateur n'aura rien à installer
sur son disque dur, ni le logiciel, ni la base de donn&eacute;es.

<p>

Voici les op&eacute;rations à faire:

<p>

<ol>

<li> Faites un nettoyage en profondeur de votre base. Si vous avez
gwsetup, utilisez-le: regardez dans son "menu principal" comment faire
cette op&eacute;ration. Cela peut se faire aussi int&eacute;ractivement avec les
commandes gwu et gwc (gwu extrait la base sous forme texte source et
gwc la recr&eacute;e).

<p>

<font size=-1>Remarque: cette &eacute;tape n'est pas absolument obligatoire
mais vous permet de distribuer une base de donn&eacute;es optimis&eacute;e en
m&eacute;moire et en vitesse d'accès. Cependant, si votre base de donn&eacute;es
vient d'un fichier GEDCOM ou d'un fichier source <font
color=#2f6400><b>GeneWeb</b></font> et que vous n'avez pas fait de
modifications dedans, elle est inutile.</font>

<p>

<li> Si vous voulez que les consanguinit&eacute;s s'affichent dans les pages
personnelles et dans les calculs de parent&eacute;, passez le programme
d'initialisation des consanguinit&eacute;s. Sous gwsetup, voyez le "menu
principal". Int&eacute;ractivement, cela peut se faire avec la commande
consang.

<p>

<font size=-1>Remarque: &eacute;tape facultative aussi. Si vous ne la faites
pas, les calculs de parent&eacute; fonctionneront quand même mais les
consanguinit&eacute;s ne s'afficheront pas.</font>

<p>

<li> Entrez dans votre base et faites un calcul de parent&eacute; quelconque,
par exemple entre un père et son fils.

<p>

<font size=-1>Remarque: c'est encore une &eacute;tape facultative destin&eacute;e à
optimiser l'accès à la base. En effet, le premier calcul de parent&eacute;
fabrique un fichier (de nom tstab) dans la base de donn&eacute;es qui permet
aux calculs de parent&eacute; suivants d'aller plus vite. Si ce fichier n'a
pas &eacute;t&eacute; cr&eacute;&eacute;, ce ne sera plus possible dans le CDrom et les calculs de
parent&eacute; seront plus lents.</font>

<p>

<li> Faites un r&eacute;pertoire pour les &eacute;l&eacute;ments que vous allez mettre dans
le CDrom. Dans la suite de ces explications, on d&eacute;signera ce r&eacute;pertoire
par "r&eacute;pertoire destination".

<p>

<li> Commencez par y transf&eacute;rer votre base de donn&eacute;es: c'est un
r&eacute;pertoire se terminant par ".gwb". Par exemple, si votre base
s'appelle "xyz", c'est un r&eacute;pertoire qui s'appelle "xyz.gwb".  Ce
r&eacute;pertoire se trouve dans le r&eacute;pertoire des bases (cela d&eacute;pend de votre
installation: Windows, MacOS X, Unix...).

<p>

<li> Ajoutez dans le r&eacute;pertoire destination un fichier de
configuration. Si vous en avez un qui vous convient, utilisez-le,
sinon cr&eacute;ez-le. Le fichier de configuration est un fichier texte se
terminant par ".gwf". Si votre base s'appelle "xyz", c'est le fichier
"xyz.gwf". S'il y a d&eacute;jà un fichier de configuration, il se trouve
&eacute;galement dans le r&eacute;pertoire des bases.

<p>

Dans ce fichier, ajoutez un mot de passe "magicien" bidon, en ajoutant
la ligne:

<pre>
     wizard_passwd=a
</pre>

<p>

<font size=-1>Remarque: cette op&eacute;ration est facultative mais elle
permet d'&eacute;viter que cela propose une "mise à jour" dans les pages
personnelles, mise à jour qui, de toutes façons, ne fonctionnerait pas
sur un support non inscriptible.  Attention: si vous cr&eacute;ez le fichier
de configuration, faites en sorte qu'il n'ait pas l'extension .txt
comme certains systèmes font malheureusement automatiquement:
l'extension doit être .gwf et rien d'autre.</font>

<p>

<li> Copiez l'ex&eacute;cutable "gwd" dans le r&eacute;pertoire destination. Sur
certains systèmes, il porte l'extension ".exe". Attention: il peut y
avoir plusieurs fichiers qui s'appellent "gwd" dans votre installation
<font color=#2f6400><b>GeneWeb</b></font>. Il s'agit ici d'un fichier
assez gros (plus de 1Mo). Il se trouve g&eacute;n&eacute;ralement dans un r&eacute;pertoire
qui s'appelle "gw".

<p>

<li> Copiez dans le r&eacute;pertoire destination les r&eacute;pertoires "lang",
"etc" et "images" qui doivent se trouver dans le même r&eacute;pertoire où
vous avez trouv&eacute; l'ex&eacute;cutable gwd.

<p>

<font size=-1>Remarque: la pr&eacute;sence de ces r&eacute;pertoires est
obligatoire. Ils contiennent des fichiers utilis&eacute;s par gwd, en
particulier pour les langues et pour l'affichage de certaines
pages.</font>

<p>

<li> Dans le r&eacute;pertoire "lang" du r&eacute;pertoire destination, &eacute;ditez le
fichier nomm&eacute; "start.txt" et supprimez le groupe de lignes qui
contiennent les liens pour accès "magicien". Elles commencent par
quelque chose comme:

<pre>
   &lt;td align=center&gt;[
   af: &lt;a href="%sw=w"&gt;&lt;em&gt;Medewerkers&lt;/em&gt;&lt;/a&gt; toegang&lt;br&gt; (password)
   ca: acc&eacute;s &lt;a href="%sw=w"&gt;&lt;em&gt;administrador&lt;/em&gt;&lt;/a&gt;&lt;br&gt; (clau)
</pre>

et finissent par:

<pre>
   pl: &lt;a href="%sw=w"&gt;&lt;em&gt;"Wizard"&lt;/em&gt;&lt;/a&gt; dostêp&lt;br&gt; (has³o)
   pt: Entrada &lt;a href="%sw=w"&gt;&lt;em&gt;feiticeiro&lt;/em&gt;&lt;/a&gt;&lt;br&gt; (palavra chave)
   sv: &lt;a href="%sw=w"&gt;&lt;em&gt;Uppdaterings&lt;/em&gt;&lt;/a&gt; tilltr&auml;de&lt;br&gt; (passord)
   ]&lt;br&gt;&lt;/td&gt;
</pre>

<p>

<font size=-1>Cette &eacute;tape n'est pas obligatoire mais &eacute;vite que la page
d'accueil propose un accès magicien qui, de toutes façons, ne servirait
à rien.</font>

<p>

<li><b>&Eacute;tape importante</b>. L'ex&eacute;cutable gwd fabrique des fichiers
dans son r&eacute;pertoire courant. S'il ne peut pas le faire, ça peut
bloquer son fonctionnement (en particulier sous Windows, ça le
bloquera certainement). Il faut donc lui indiquer une option pour
qu'il utilise le disque dur (note: ces fichiers ne sont pas gros, sont
temporaires et les d&eacute;truire volontairement ou involontairement pendant
ou après visite ne perturbera pas le fonctionnement de gwd).

<p>

Pour cela, cr&eacute;ez un fichier texte de nom "gwd.arg" (attention: pas
d'extension ".txt") et &eacute;crivez dedans:

<pre>
   Si vous pr&eacute;parez un CDrom pour Windows:
          -wd
          c:\temp\geneweb
   Si c'est pour Unix ou MacOS X:
          -wd
          /tmp/geneweb
</pre>

<p>

<li>Si votre base de donn&eacute;es a des images, mettez-les dans le
r&eacute;pertoire "images", sous-r&eacute;pertoire portant le nom de votre base
("images/xyz" si votre base s'appelle "xyz").

<p>

<li> Après toutes ces &eacute;tapes, vous disposez d'une installation
minimum, obligeant l'utilisateur à lancer lui-même gwd et à ouvrir
l'adresse URL pour acc&eacute;der à la base. Vous pouvez am&eacute;liorer cela en
fournissant des fichiers HTML et/ou des scripts (shell, batch) qui
lanceront tout cela tout seul. Vous pouvez aussi mettre plusieurs
bases de donn&eacute;es, d'autres fichiers HTML, etc, etc.

<p>

<font size=-1>

Ne me demandez pas comment on fait un CDrom qui lance tout
automatiquement quand on l'insère sur son support: ça doit pouvoir se
faire mais je ne sais pas comment.

<p>

Remarque: si vous voulez que votre base de donn&eacute;es soit lisible sur
d'autres Systèmes d'Exploitation (Windows, MacOS X, Unix) que vous
utilisez, vous pouvez cr&eacute;er un r&eacute;pertoire par SE et y mettre la
version de gwd pour ce SE-là. Bien sûr il vous faudra avoir t&eacute;l&eacute;charg&eacute;
toutes les versions de <font color=#2f6400><b>GeneWeb</b></font> des
SE que vous voulez rendre disponibles. Il faut &eacute;galement revoir
l'installation des fichiers gwd.arg et en particulier leur indiquer le
chemin d'accès aux fichiers système et à la base (options -hd et -bd
de gwd).

</font>

<p>

<li>Avant de graver votre disque, faites un test. Pour cela, rendez le
r&eacute;pertoire destination non inscriptible ainsi que tous ses
sous-r&eacute;pertoires et fichiers. Puis lancez la commande gwd (par
double-clic si votre système le permet ou par une commande
int&eacute;ractive). Ouvez dans votre navigateur l'adresse
http://127.0.0.1:2317/xyz (si la base s'appelle xyz) et v&eacute;rifiez si ça
fonctionne.

<p>

<li>Si c'est bon gravez votre CDrom en y mettant le r&eacute;pertoire
destination et son contenu.

</ol>

<p>

<p>
<hr>
<br>
<center>Retour vers <a href="diruse.htm">Mode d'Emploi</a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>

</body>
