<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head><title>Les diff&eacute;rentes commandes</title></head>
<body bgcolor="#d6bfaf">
<h1>Les diff&eacute;rentes commandes</h1>

Ce chapitre contient une description d&eacute;taill&eacute;e des
diff&eacute;rentes commandes fournies avec le logiciel, avec leurs
options. Nous avons essay&eacute; de le rendre compr&eacute;hensible
&agrave; tous, mais il est parfois difficile d'&eacute;viter le jargon
technique: si vous n'&ecirc;tes pas un sp&eacute;cialiste en
informatique, sautez les explications qui vous paraissent difficiles.

<ul>

<li> D&eacute;mon GeneWeb: <a href="#Gwd">gwd</a>

<li> Gedcom vers GeneWeb: <a href="#Ged">ged2gwb</a>

<li> GeneWeb vers Gedcom: <a href="#Gee">gwb2ged</a>

<li> Compilateur GeneWeb: <a href="#Gwc">gwc</a>

<li> D&eacute;compilateur GeneWeb: <a href="#Gwu">gwu</a>

<li> Pr&eacute;calcul de consanguinit&eacute;: <a href="#Csg">consang</a>

</ul>

<h4> <a name="Gwd">D&eacute;mon GeneWeb: gwd</a> </h4>

Gwd est la commande principale de <em>GeneWeb</em>. Il re&ccedil;oit
des requ&ecirc;tes et r&eacute;pond le r&eacute;sultat, via le
r&eacute;seau internet et en suivant le protocole HTTP des serveurs
Web.

<p>

Gwd peut fonctionner en deux modes: le mode serveur et le mode CGI.

<p>

En mode serveur, il se comporte comme un serveur Web normal (sauf
qu'il ne sert que de la g&eacute;n&eacute;alogie). Il n'a pas besoin
de serveur Web pour fonctionner et ne g&egrave;ne pas un serveur Web
&eacute;ventuellement install&eacute; sur le m&ecirc;me ordinateur.
Il passe le plus clair de son temps &agrave; attendre passivement des
connexions. Quand une connexion arrive, il la traite, r&eacute;pond le
r&eacute;sultat et se remet en attente. Sous Unix, il peut traiter
plusieurs connexions en m&ecirc;me temps.

<p>

En mode CGI, il se comporte comme un programme CGI: il a besoin d'un serveur
Web pour fonctionner. Quand une requ&ecirc;te le concerne, le serveur Web
le lance en lui transmettant la requ&ecirc;te &agrave; traiter et attend
qu'il lui r&eacute;ponde le r&eacute;sultat.

<p>

Voici quelles sont les options de "gwd":

<p>

<ul>

<li>-help

<br>Affiche la liste des options (en anglais) et
s'arr&ecirc;te.

<li>-hd <em>r&eacute;pertoire</em>

<br>Indique le r&eacute;pertoire o&ugrave; sont install&eacute;s les
fichiers de <em>GeneWeb</em>. Par d&eacute;faut, c'est le
r&eacute;pertoire courant. Il doit contenir un r&eacute;pertoire
"lang" et un r&eacute;pertoire "images".

<li>-bd <em>r&eacute;pertoire</em>

<br>Indique le r&eacute;pertoire o&ugrave; sont install&eacute;es les
bases de donn&eacute;es. Par d&eacute;faut, c'est le r&eacute;pertoire
courant. Il peut contenir aussi un r&eacute;pertoire "lang" et un
r&eacute;pertoire "images": gwd va d'abord consulter ce
r&eacute;pertoire pour ses fichiers, et s'il ne les trouve pas, va
chercher dans le r&eacute;pertoire sp&eacute;cifi&eacute; par l'option
"-hd" ci-dessus.

<li>-cgi

<br>Force le mode CGI. Cette option est en principe inutile, car gwd
d&eacute;tecte tout seul quand il est lanc&eacute; par un serveur Web.
Cette option permet d'en &ecirc;tre s&ucirc;r (car il ne faut pas que
le serveur Web puisse lancer "gwd" en serveur par m&eacute;garde), et
permet de tester le r&eacute;sultat de gwd dans une fen&ecirc;tre
int&eacute;ractive, pour v&eacute;rifier son bon fonctionnement.

<li>-p <em>num&eacute;ro</em>

<br>En mode serveur, s&eacute;lectionne un num&eacute;ro de port. Par
d&eacute;faut, c'est 2317. N'importe quel autre nombre
sup&eacute;rieur &agrave; 1024 peut &ecirc;tre choisi, &agrave;
condition qu'il ne soit pas d&eacute;j&agrave; pris par un autre
service. Pour choisir un num&eacute;ro inf&eacute;rieur &agrave; 1024,
il faut &ecirc;tre root (sous Unix) ou Administrateur (sous
Windows). Note: en choisissant le port 80, qui est le port par
d&eacute;faut des serveurs Web, on n'a pas besoin de sp&eacute;cifier
":num&eacute;ro" dans l'adresse HTTP &agrave; utiliser.

<li>-wizard <em>mot-de-passe</em>

<br>Donne un mot de passe "sorcier" par d&eacute;faut. Le
<em>sorcier</em> a acc&egrave;s &agrave; toutes les informations et a
le droit de faire des modifications en ligne dans une base de
donn&eacute;es. Cette option peut &ecirc;tre masqu&eacute;e par la
pr&eacute;sence d'un fichier "toto.cnf" pour la base "toto".

<li>-friend <em>mot-de-passe</em>

<br>Donne un mot de passe "ami" par d&eacute;faut. L'<em>ami</em> a
acc&egrave;s &agrave; toutes les dates et informations personnelles,
m&ecirc;me pour les personnes n&eacute;es avant un si&egrave;cle. Il
n'a pas acc&egrave;s aux modifications en ligne. Cette option peut
&ecirc;tre masqu&eacute;e par la pr&eacute;sence d'un fichier
"toto.cnf" pour la base "toto".

<li>-lang <em>id</em>

<br>Sp&eacute;cifie une langue par d&eacute;faut. Par d&eacute;faut de cette
option, c'est le fran&ccedil;ais (fr). Cette option peut
&ecirc;tre masqu&eacute;e par la pr&eacute;sence d'un fichier
"toto.cnf" pour la base "toto".

<li>-only <em>adresse</em>

<br>Sp&eacute;cifie une adresse internet qui sera la seule ayant le
droit d'acc&eacute;der au site. L'adresse est celle qui est
affich&eacute;e derri&egrave;re "From:" dans les traces de gwd.

<li>-auth <em>fichier</em>

<br>Sp&eacute;cifie une restriction d'acc&egrave;s au site par nom
d'utilisateur et mot de passe. Le fichier doit contenir une ou
plusieurs lignes de la forme "utilisateur:mot-de-passe".

<li>-log <em>fichier</em>

<br>Redirige les traces de connexion dans ce fichier. Par d&eacute;faut, elle
s'affichent dans la fen&ecirc;tre int&eacute;ractive.

<li>-nolock

<br>Demande de ne pas verrouiller une base de donn&eacute;es quand on
la modifie. Cela peut &ecirc;tre dangereux, car si deux utilisateurs
la modifient exactement en m&ecirc;me temps, la base peut &ecirc;tre
ab&icirc;m&eacute;e. N&eacute;anmoins, cette option est utile quand on
est sous Unix et qu'on acc&egrave;de la base par NFS, car le
verrouillage ne fonctionne pas sous NFS et bloque la r&eacute;ponse de
gwd pendant quelques interminables secondes.

<li>-max_clients <em>nombre</em>

<br>Cette option ne fonctionne que dans la version Unix (pas
Windows). Indique le nombre maximum de clients &agrave; traiter en
m&ecirc;me temps (mode serveur uniquement). Le d&eacute;faut est de ne
pas donner de limite. <strong>Il est fortement conseill&eacute;
d'utiliser cette option sous Unix</strong> si vous n'utilisez pas gwd
en local, car chaque connexion lance un nouveau processus et des
connexions &agrave; un rythme &eacute;lev&eacute; (par un robot ou par
un tar&eacute; qui fait cinquante "reload" &agrave; toute vitesse)
risque d'&eacute;crouler votre ordinateur.

<li>-robot_xcl <em>cnt,sec</em>

<br>Cette option ne fonctionne que dans la version Unix (pas
Windows). Permet d'exclure les robots qui ne disent pas leur nom. En
principe, gwd indique aux robots qu'ils ne doivent pas parcourir le
site (car le nombre de requ&ecirc;tes possibles est quasiment infini).
Cependant, comme il est possible de lancer des robots qui ne
respectent pas cette injonction, cette option tente de les
d&eacute;tecter et exclut ceux qu'il r&eacute;ussit &agrave;
rep&eacute;rer. Si un client fait plus de <em>cnt</em> connexions en
<em>sec</em> secondes, on consid&egrave;re qu'il est un robot, et il
est d&eacute;finitivement rejet&eacute; (jusqu'&agrave; ce qu'on
relance gwd). En fait, cette option n'est pas compl&egrave;tement
satisfaisante, car il n'est pas facile de donner de "bonnes" valeurs
aux param&egrave;tres. Il est donc possible qu'elle change dans une
version future.

</ul>

<p>

Pour transmettre des options, vous pouvez aussi fabriquer un fichier
que vous nommerez "gwd.arg" dans le m&ecirc;me r&eacute;pertoire que
la commande "gwd". Ce fichier contient les options, mais en les
s&eacute;parant par des lignes, au lieu d'espaces. Par exemple, si
vous voulez que "gwd" se lance ainsi:

<pre>
     gwd -bd bases -wizard "mon mot de passe" -p 8022
</pre>

vous pouvez faire un fichier "gwd.arg" contenant:

<pre>
     -bd
     bases
     -wizard
     mon mot de passe
     -p
     8022
</pre>

et il vous suffira alors de ne taper que "gwd".

<p>

Sous Windows, vous pouvez simplement double-cliquer sur l'ic&ocirc;ne
de gwd. Cela ouvrira une fen&ecirc;tre MSDOS o&ugrave; gwd sera
lanc&eacute;. En tapant Control-C, gwd s'arr&ecirc;tera et la
fen&ecirc;tre MSDOS se fermera. Utilisez &eacute;ventuellement la
technique du fichier "gwd.arg" ci-dessus pour transmettre des options.

<h4> Gedcom vers GeneWeb: <a name="Ged">ged2gwb</a></h4>

Convertit un fichier GEDCOM en base de donn&eacute;es <em>GeneWeb</em>.

<p>

Les diff&eacute;rentes options sont:

<ul>

<li>-help

<br>Affiche la liste des options (en anglais) et s'arr&ecirc;te.

<li>-o <em>nom</em>

<br>Donne le nom de la base de donn&eacute;es &agrave;
cr&eacute;er. Par d&eacute;faut, c'est "a". Cela cr&eacute;era un
r&eacute;pertoire de nom "nom.gwb".

<li>-lf

<br>Enregistre les pr&eacute;noms en minuscule, en ne conservant que leur
premi&egrave;re lettre en majuscule.

<li>-ls

<br>Enregistre les noms de famille en minuscule, en ne conservant que leur
premi&egrave;re lettre en majuscule. Essaie de conserver les minuscules pour
les particules.

<li>-efn

<br>Au moment de cr&eacute;er une personne, si le pr&eacute;nom dans le
fichier GEDCOM comporte plusieurs noms, le premier de ces noms devient
le "pr&eacute;nom" de la personne et le pr&eacute;nom complet est mis
dans les "autres pr&eacute;noms". &Agrave; l'affichage, on ne verra
que le premier pr&eacute;nom en titre. Cette option est par
d&eacute;faut. Pour la supprimer, utiliser "-no_efn".

<li>-no_efn

<br>Annule l'option pr&eacute;c&eacute;dente.

<li>-epn

<br>Au moment de cr&eacute;er une personne, si le pr&eacute;nom dans le
fichier GEDCOM ressemble &agrave; un nom public, c'est-&agrave;-dire
contient:

<ul>

<li> un nombre en chiffres arabes ou romains, cens&eacute; &ecirc;tre
un num&eacute;ro de titre de noblesse.

<li> un des mots suivants: "der", "die", "el", "le", "la", "the",
cens&eacute; &ecirc;tre le d&eacute;but d'un qualificatif.

</ul>

alors le pr&eacute;nom du fichier GEDCOM est mis comme "nom public" et
le premier mot du pr&eacute;nom comme "pr&eacute;nom". Cette option
est par d&eacute;faut. Pour l'annuler, utiliser "-no_epn".

<li> -no_epn

<br>Annule l'option pr&eacute;c&eacute;dente.

<li>-tnd

<br>Met des dates n&eacute;gatives (avant J&eacute;sus Christ) s'il y a
une incoh&eacute;rence (par exemple, naissance apr&egrave;s
d&eacute;c&egrave;s), ceci pour les fichiers GEDCOM de bases de
donn&eacute;es ayant des dates n&eacute;gatives et construites
&agrave; partir de (mauvais) logiciels ne sachant pas traiter les
dates n&eacute;gatives.

<li>-ansel

<br>Indique que le fichier GEDCOM contient un codage ANSEL, m&ecirc;me
si ce n'est pas &eacute;crit explicitement dans la zone du fichier
GEDCOM pr&eacute;vue &agrave; cet effet.

<li>-no_ansel

<br>Indique que le fichier GEDCOM ne contient pas de codage ANSEL, m&ecirc;me
si la zone pr&eacute;vue &agrave; cet effet dans le fichier l'indique.

<li>-nd 

<br>Les personnes qui ont un champ "DEAT" vide sont enregistr&eacute;es comme
non d&eacute;c&eacute;d&eacute;es. Par d&eacute;faut, leur d&eacute;c&egrave;s
est mis dans la cat&eacute;gorie "ne sais pas".

</ul>

<h4> GeneWeb vers Gedcom: <a name="Gee">gwb2ged</h4>

Extrait une base de donn&eacute;es <em>GeneWeb</em> en format GEDCOM.

<p>

Les diff&eacute;rentes options sont:

<ul>

<li>-help

<br>Affiche la liste des options (en anglais) et s'arr&ecirc;te.

<li>-o <em>fichier</em>

<br>Nom du fichier en sortie. Par d&eacute;faut, c'est "a.ged".

<li>-a <em>pr&eacute;nom</em> [<em>num&eacute;ro</em>] <em>nom</em>

<br>Ne s&eacute;lectionne que les anc&ecirc;tres de la personne portant ce
pr&eacute;nom (on peut optionnellement pr&eacute;ciser son
num&eacute;ro si ce n'est pas 0) et ce nom. Mettre le pr&eacute;nom ou
le nom entre guillemets s'il contient des espaces.

<li>-d <em>pr&eacute;nom</em> [<em>num&eacute;ro</em>] <em>nom</em>

<br>Ne s&eacute;lectionne que les descendants de la personne portant ce
pr&eacute;nom (on peut optionnellement pr&eacute;ciser son
num&eacute;ro si ce n'est pas 0) et ce nom. Mettre le pr&eacute;nom ou
le nom entre guillemets s'il contient des espaces.

<li>-mem

<br>Fait l'op&eacute;ration en &eacute;conomisant l'espace m&eacute;moire.
La contrepartie est qu'elle est plus lente.

</ul>

Si les options "-a" et "-d" sont utilis&eacute;es, c'est
l'intersection des groupes qui est assum&eacute; (et non l'union). Si
on veut, par exemple ne garder que la (ou les) branches qui
m&egrave;nent d'une personne &agrave; un de ses anc&ecirc;tres, on
peut le faire en combinant les deux options.

<h4> Compilateur GeneWeb: <a name=Gwc>gwc</a></h4>

On peut construire des bases de donn&eacute;es <em>GeneWeb</em>
&agrave; partir de fichiers sources, dans le langage "gw". Ce language
n'est pas document&eacute;, mais, en gros, il d&eacute;crit des
familles: le p&egrave;re, la m&egrave;re, les enfants.

<p>

Le compilateur "gwc" lit les fichiers sources en se chargeant de
relier les personnes. Il construit une base de donn&eacute;es
<em>GeneWeb</em>.

<p>

L'op&eacute;ration inverse, c'est-&agrave;-dire cr&eacute;ation de fichiers
sources &agrave; partir d'une base de donn&eacute;es <em>GeneWeb</em> peut
se faire par la commande "gwu" (voir plus loin).

<p>

Les fichiers ".gw" et les bases <em>GeneWeb</em> sont
&eacute;quivalents. Quand on passe de fichiers ".gw" en bases
<em>GeneWeb</em> et vice-versa, on ne pert pas d'informations. Ce
n'est pas le cas, par contre de "ged2gwb" et "gwb2ged" qui peuvent
perdre des informations.

<p>

La commande "gwc" s'utilise avec des options et se termine par
z&eacute;ro, un ou plusieurs fichiers ".gw" ou ".gwo".

<ul>

<li>

<p>

Retour vers <a href="diruse.htm">Mode d'Emploi</a>.

<p><hr><font size=-1><em>&copy; Copyright INRIA 1998 -
GeneWeb</em></font><br>

</body>
