<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
              "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>FAQ</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://www.geneweb.org/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Foire aux questions</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

<h4>&Agrave; la premi&egrave;re utilisation de GeneWeb, j'ai le message:
Cannot access file "start.txt".</h4>

Regardez dans la doc: "Deux <a href="problem.htm">problèmes</a>
fr&eacute;quemment rencontr&eacute;s". Si cela ne fonctionne toujours pas,
signalez-le moi.

<p>

<h4>&Ccedil;a ne marche pas sous Windows!</h4>

La premi&egrave;re chose &agrave; v&eacute;rifier: est-ce que le
programme gwsetup que vous avez lanc&eacute; est toujours l&agrave;.
Car pour que &ccedil;a fonctionne, il faut que gwsetup reste
pr&eacute;sent. Si ce programme tournait dans une fen&ecirc;tre et que
vous avez ferm&eacute; la fen&ecirc;tre, &ccedil;a ne peut pas
fonctionner. Si c'est votre probl&egrave;me, double-cliquez &agrave;
nouveau sur gwsetup.

<p>

Un peu plus tard, pour le programme gwd qui vous permet de naviguer
dans votre base de donn&eacute;es, m&ecirc;me probl&egrave;me: vous le
lancerez en double-cliquant dessus et vous ne devrez pas
l'arr&ecirc;ter tant que vous voudrez naviguer dans votre base
de donn&eacute;es.

<p>

Il se peut aussi que Windows ne reconnaisse pas "localhost". Dans
ce cas, essayez l'adresse "127.0.0.1" à la place.

<pre>
   http://127.0.0.1:2316/
</pre>

<p>

Sinon, un probl&egrave;me fr&eacute;quent est que votre navigateur
Web, voyant qu'on lui donne une adresse Web (http://...) essaie de se
connecter sur le r&eacute;seau t&eacute;l&eacute;phonique et si vous
avez d&eacute;branch&eacute; votre modem, il refuse. C'est une erreur
de Windows, parce que l'adresse &eacute;tant "localhost", il ne
devrait pas chercher &agrave; se connecter, car "localhost" veut dire
"ordinateur local", votre ordinateur.

<p>

Cela est d&ucirc; au fait que votre fournisseur d'acc&egrave;s vous a
install&eacute; un programme de connexion automatique. C'est cette
connexion automatique qui provoque ce ph&eacute;nom&egrave;ne. Une
solution est donc de la d&eacute;brancher. Cherchez dans un menu qui
doit s'appeler "pr&eacute;f&eacute;rences" ou "option" ou
"configuration" un onglet dans lequel vous verrez cette configuration
automatique et d&eacute;branchez-la.

<p>

Une autre solution est d'utiliser un autre navigateur Web: si votre
fournisseur d'acc&egrave;s vous a install&eacute; Internet Explorer,
utilisez Netscape. S'il vous a install&eacute; Netscape, utilisez
Internet Explorer.

<p>

Une troisi&egrave;me solution est de brancher votre modem, d'attendre
la connexion. Quand elle est faite, est-ce que &ccedil;a marche? Si
oui, alors on est bien s&ucirc;r que c'est le probl&egrave;me. En
d&eacute;connectant alors votre modem, il semble que &ccedil;a
continue &agrave; marcher quand m&ecirc;me. Evidemment, ce n'est pas
tr&egrave;s satisfaisant vu qu'il faut se connecter &agrave; chaque
fois qu'on veut utiliser <font color=#2f6400><b>GeneWeb</b></font>,
m&ecirc;me si ce n'est que pour quelques secondes.

<p>

Information d'un utilisateur (Paul Laredo, merci &agrave; lui):

<p>

<ol>

<li>lancer gwsetup (or gwd)

<li>lancer votre navigateur Web

<li>stopper la connexion automatique avec le fournisseur d'acc&egrave;s

<li>taper l'adresse du service

<li>cela indique que la page n'est pas disponible hors connexion, il
faut non pas appuyer sur le bouton "travailler hors connexion" qui
apparait mais au contraire sur "connecter".

</ol>

<p>

Autre conseil (Patrick Texier, merci Patrick!):

<p>

<dl><dt><dd>
Tout d&eacute;pend de la version d'IE.
<br>
Au dessous de 5 :

<ul>
<li>Soit laisser ouverte la fenêtre qui demande la connection internet
sans se connecter.
<li>Soit dans le menu Outils >> Options >> Connexion, Cocher "Se connecter
à Internet par un r&eacute;seau local" et ne pas oublier de le remettre ensuite
comme c'&eacute;tait.
</ul>

Avec la version 5 :

<ul>
<li>Il faut cliquer sur 'R&eacute;assayer' quand on a le message 'Impossible de
se connecter à Internet'.
</ul>

Avec Netscape toute version, cela marche sans bidouilles.
</dd></dt></dl>

<p>

<h4>Mon logiciel de g&eacute;n&eacute;alogie dit que ma base de
donn&eacute;es contient 3000 personnes, mais GeneWeb dit: 3050. Pourquoi
cette diff&eacute;rence?</h4>

Dans <font color=#2f6400><b>GeneWeb</b></font>, les parents sont
toujours enregistr&eacute;s en couple. S'il n'y a que le p&egrave;re
ou que la m&egrave;re dans le fichier GEDCOM, <font
color=#2f6400><b>GeneWeb</b></font> ajoute l'autre parent, en lui
donnant un point d'interrogation comme pr&eacute;nom et comme nom. La
diff&eacute;rence est d&ucirc;e &agrave; ces parents manquants (mais
qui ont exist&eacute;).

<h4>&Agrave; l'affichage des liens de parent&eacute;, il en manque.</h4>

Pour &eacute;viter que la liste des liens de parent&eacute; ne soit trop
grande, <font color=#2f6400><b>GeneWeb</b></font> en supprime &agrave;
l'affichage. Pour cela, il utilise la m&eacute;thode suivante: quand
un lien de parent&eacute; avec un anc&ecirc;tre commun est
trouv&eacute;, tous les anc&ecirc;tres de cet anc&ecirc;tre sont
&eacute;limin&eacute;s de la recherche.

<p>

Une des cons&eacute;quences de cet &eacute;lagage est que si on fait
un calcul de parent&eacute; avec un anc&ecirc;tre, celui-ci ne sera
affich&eacute; que comme anc&ecirc;tre, alors qu'il peut parfois
&ecirc;tre aussi un cousin.

<p>

Par exemple, si mon p&egrave;re et ma m&egrave;re sont cousins, et que
je cherche mes liens de parent&eacute; avec ma m&egrave;re, cela
indiquera juste que je suis son fils et pas que je suis fils de son
cousin, m&ecirc;me si ce lien de parent&eacute; existe vraiment.

<p>

L'&eacute;lagage est n&eacute;cessaire: sans lui, pour les familles un
peu "entrem&ecirc;l&eacute;es", l'affichage devient rapidement envahi
de liens de parent&eacute;s dans tous les sens, et finalement
incompr&eacute;hensible (je l'ai test&eacute;).

<p>

Les liens non affich&eacute;s sont des liens r&eacute;els pourtant, et
ils sont tout de m&ecirc;me comptabilis&eacute;s dans le calcul de la
consanguinit&eacute;.

<p>

<h4>En mode CGI, j'ai juste le message "Internal Server Error"</h4>

Un probl&egrave;me fr&eacute;quent concerne les droits d'acc&egrave;s.
Le serveur Web ex&eacute;cute souvent les CGI en tant qu'utilisateur
avec tr&egrave;s peu de droits (typiquement l'utilisateur "nobody"
sous Unix). Il se peut qu'il n'ait pas le droit d'ex&eacute;cuter
"gwd". V&eacute;rifiez les droits d'acc&egrave;s de "gwd" et de tous
les fichiers <font color=#2f6400><b>GeneWeb</b></font>!

<p>

<h4>Pourquoi l'&acirc;ge des personnes de plus de 80 ans n'est-il pas
affich&eacute;&nbsp;? Pourquoi ne sont-elles pas dans les statistiques
des personnes les plus &acirc;g&eacute;es&nbsp;?</h4>

Dans <font color=#2f6400><b>GeneWeb</b></font>, l'indication de
d&eacute;c&egrave;s a trois &eacute;tats: "vivant",
"d&eacute;c&eacute;d&eacute;" et "ne sais pas". L'&acirc;ge n'est
affich&eacute; que pour les personnes "vivantes". Si l'&acirc;ge n'y
est pas, c'est que soit la personne est d&eacute;c&eacute;d&eacute;e
(sans indication de date), soit que l'indication est &agrave; "ne sais
pas".

<p>

Si vous avez ajout&eacute; cette personne avec <font
color=#2f6400><b>GeneWeb</b></font> et que vous n'avez pas
pr&eacute;cis&eacute; si elle est vivante ou
d&eacute;c&eacute;d&eacute;e, ou bien si votre base de donn&eacute;es
provient d'un GEDCOM (l'indication "personne encore vivante"
n'&eacute;tant pas pr&eacute;vue dans le standard GEDCOM 5.5), <font
color=#2f6400><b>GeneWeb</b></font> applique l'algorithme suivant:

<ul>

<li>si la personne a moins de 80 ans, elle est indiqu&eacute;e
"vivante"

<li>si elle a plus de 120 ans, elle est indiqu&eacute;e
"d&eacute;c&eacute;d&eacute;e"

<li>entre les deux elle est indiqu&eacute;e "ne sais pas".

</ul>

&Agrave; vous de corriger ces indications si elles sont incorrectes.

<p>

<h4>Les personnes ayant ? (point d'interrogation) comme pr&eacute;nom et/ou
comme patronyme semblent avoir un statut particulier. Lequel et
pourquoi?</h4>

Ces personnes sont consid&eacute;r&eacute;es par <font
color=#2f6400><b>GeneWeb</b></font> comme des "culs-de-sac": si elles
sont enfants, elles ne peuvent pas être conjoints, si elles sont
conjoints, elles ne peuvent pas avoir de parents. Et elles ne peuvent
pas avoir de notes associ&eacute;es.

<p>

De plus, si elles sont conjoints, elles ne sont pas export&eacute;es dans les
fichiers GEDCOM, et leurs informations personnelles (s'il y en a), sont
par cons&eacute;quent perdues.

<p>

Il est possible, en bricolant un peu, de leur associer quand même des
notes ou de les relier quand même, mais attention: au premier
nettoyage de la base, ces notes et ces liens vont disparaître: il est
donc fortement d&eacute;conseill&eacute; de faire cela.

<p>

Le pr&eacute;nom/patronyme "?" &eacute;tant donc "r&eacute;serv&eacute;" dans <font
color=#2f6400><b>GeneWeb</b></font>, il ne faut pas appeler les gens
comme ça si on veut que ce soient des personnes qu'on veut relier au
reste de la base ou auxquelles on veut attacher des notes ou des
relations (parrains, enfants ou parents adoptifs, etc). La solution
est d'&eacute;diter ces personnes et de changer leur nom ou leur pr&eacute;nom par
autre chose: mettez "N", "Ne", "N...", "x", "??", ce que vous voulez,
mais pas juste "?".

<p>

<h4>Pourriez-vous am&eacute;liorer la "requ&ecirc;te
&eacute;volu&eacute;e" avec tel ou tel truc?</h4>

La "requ&ecirc;te &eacute;volu&eacute;e" est un bricolage que j'ai
fait mais que je ne trouve pas tr&egrave;s satisfaisant. <font
color=#2f6400><b>GeneWeb</b></font> n'utilisant pas un vrai
syst&egrave;me de bases de donn&eacute;es, toute am&eacute;lioration
dans cette partie-l&agrave; reviendrait &agrave;
r&eacute;&eacute;crire un nouveau syst&egrave;me de bases de
donn&eacute;es, ce que je n'ai pas l'intention de faire, car &ccedil;a
repr&eacute;sente un travail gigantesque.

<p>

Si <font color=#2f6400><b>GeneWeb</b></font> utilise un jour un vrai
syst&egrave;me de bases de donn&eacute;es (&ccedil;a fait partie des
orientations possibles), cette requ&ecirc;te &eacute;volu&eacute;e
sera certainement r&eacute;&eacute;crite, et sera beaucoup plus
puissante et plus pratique.

<p>

<h4>Pourrait-on avoir un affichage complet des ancêtres, même avec les
r&eacute;p&eacute;titions des num&eacute;ros Sosa?</h4>

Je comprends que ce serait utile, mais cela pose de gros problèmes.
J'ai d&eacute;jà exp&eacute;riment&eacute; ce trait mais je me suis rendu compte que pour
les personnes qui ont beaucoup d'ancêtres, l'affichage &eacute;tait noy&eacute; par
des r&eacute;f&eacute;rences à d'autres ancêtres et devenait illisible. Sans compter
que cela provoque beaucoup de calculs ("algorithme exponentiel").

<p>

Si vous voulez savoir si une lign&eacute;e d'ancêtre est pleine, regardez le
problème à l'envers avec "ascendants manquants".

<p>

<h4>Quelle est la convention d'affichage des dates courtes ?</h4>

<pre>
     Dupont 1935-1950 = n&eacute; en 1935, mort en 1950
     Dupont 1935-     = n&eacute; en 1935, non d&eacute;c&eacute;d&eacute; (toujours vivant)
     Dupont 1935 +    = n&eacute; en 1935, d&eacute;c&eacute;d&eacute; date inconnue
     Dupont 1935      = n&eacute; en 1935, ne sais pas s'il est d&eacute;c&eacute;d&eacute; ou non
     Dupont +1950     = d&eacute;c&eacute;d&eacute; en 1950, date de naissance inconnue

         /1935        = avant 1935
         1935/        = après 1935
         ca 1935      = vers 1935
                        peut-être en 1935
         1935/1938    = en 1935 ou en 1938
                        entre 1935 et 1938
</pre>

Cette convention ne se refère pas un un "standard" particulier. Si vous
connaissez une meilleure convention, plus connue, plus standard, n'h&eacute;sitez
pas à m'en faire part. Merci.

<p>

<h4>Vous serait-il possible d'ajouter plus d'informations sur les
personnes dans les formulaires de mise à jour des "familles", afin
d'aller plus vite?</h4>

Ce serait sans doute bien, mais je freine des quatre fers pour ajouter
des trucs. Plus j'en ajoute, plus on m'en demande. Au d&eacute;but, je
n'avais mis que le nom de la personne, puis on me demande les dates,
j'ajoute les dates, puis les lieux, j'ajoute les lieux, et puis on me
demande les pr&eacute;cisions des dates, les occupations, etc. On n'en finit
plus d'ajouter et d'ajouter encore des informations qui alourdissent
ce formulaire "famille" qui est d&eacute;jà bien compliqu&eacute;.

<p>

Je sais bien qu'il est fastidieux de devoir repasser par un formulaire
"personne" pour chaque personne ajout&eacute;e, mais je ne suis pas sûr que
d'ajouter de plus en plus de choses soit la bonne solution. C'est
aussi un problème intrinsèque au HTML qui n'est pas très "dynamique".
Cependant, je suis personnellement contre les solutions à base de Java
(risques de trous de s&eacute;curit&eacute;) et de JavaScript (langage en r&eacute;alit&eacute;
destin&eacute; à se faire envahir par les publicit&eacute;s, entre autres
d&eacute;fauts). D'autres solutions sont &eacute;tudi&eacute;es, mais, bon, pas faciles à
mettre en oeuvre.

<p>

<h4>Dans un formulaire de mise à jour, j'ai rempli certains champs
mais ils disparaissent</h4>

Certains champs ne sont pris en compte que dans certaines
circonstances.  Ainsi si une personne est not&eacute;e "vivante", les champs
"date" et "lieu" de d&eacute;cès sont ignor&eacute;s. Si, dans un formulaire
"famille", le champ "s&eacute;par&eacute;" est s&eacute;lectionn&eacute;, le champ "date de
divorce" est ignor&eacute;. Si l'indication d'une personne est "Relier" (au
lieu de "Cr&eacute;er"), les champs de sexe, de date et de lieu sont ignor&eacute;s.
Etc.

<p>

G&eacute;n&eacute;ralement, dans des formulaires de ce genre, les choix sont
automatiquement invalid&eacute;s ou revalid&eacute;s quand on s&eacute;lectionne tel ou tel
bouton. Il n'est pas possible de programmer cela du fait que <font
color=#2f6400><b>GeneWeb</b></font> se limite au HTML pur: il faudrait
pour cela utiliser du JavaScript ce qui est contraire à mes principes
(voir la question sur les formulaires de mise à jour des familles).

<p>

<h4>Lorsqu'on fait une recherche par lieu/patronyme, si le r&eacute;sultat
donne plusieurs personnes pour un patronyme, seule la premi&egrave;re
personne est accessible</h4>

En effet. Dans une premi&egrave;re version, j'avais mis un lien vers
le patronyme lui-m&ecirc;me, et non pas vers une personne, mais quand
le patronyme contient beaucoup de gens, on ne sait pas du tout qui
parmi ces personnes est concern&eacute; par ce "lieu" et il est
difficile de voir lesquels.

<p>

Donner la premi&egrave;re personne est plus "informatif". Certes,
c'est incomplet, et l'id&eacute;al serait d'avoir la liste de toutes
les personnes concern&eacute;es par ce lieu, mais bon, &ccedil;a me
supposait des choses suppl&eacute;mentaires &agrave; programmer et
&ccedil;a pr&eacute;sente l'inconv&eacute;nient que le traitement de
la requ&ecirc;te consommerait beaucoup plus d'espace m&eacute;moire.

<p>

Vous pouvez acc&eacute;der &agrave; la liste des personnes de ce
patronyme en cliquant sur le patronyme dans la page de la personne
affich&eacute;e.

<p>

<h4>Quand je navigue dans ma base de donn&eacute;es, il m'arrive
d'avoir le message "boucle probable dans la base de donn&eacute;es: quelqu'un
est son propre ancêtre"</h4>

Votre base de donn&eacute;es vient probablement d'un GEDCOM (&ccedil;a
ne peut pas arriver avec une base de donn&eacute;es
cr&eacute;&eacute;e sous <font
color=#2f6400><b>GeneWeb</b></font>). Au moment de l'import GEDCOM,
cette erreur a &eacute;t&eacute; d&eacute;tect&eacute;e mais la base a
quand m&ecirc;me &eacute;t&eacute; construite. N&eacute;anmoins,
certaines fonctionnalit&eacute;s ne peuvent pas fonctionner, comme le
calcul de parent&eacute; ou, simplement l'affichage d'anc&ecirc;tres.

<p>

Pour r&eacute;parer ce probl&egrave;me, il faut savoir de quelle
personne ou de quelles personnes il s'agit. Recr&eacute;ez votre base
&agrave; partir du GEDCOM (si vous avez fait des changements dans
votre base, pour &eacute;viter de l'&eacute;craser, vous pouvez
cr&eacute;er une autre base en choisissant un nom
diff&eacute;rent). Si vous utilisez des commandes int&eacute;ractives,
regardez ce qui est affich&eacute; par "ged2gwb". Si vous utilisez <a
href="gwsetup.htm">gwsetup</a>, apr&egrave;s l'import, allez dans le
menu principal et cliquez sur "traces de la derni&egrave;re commande".
Les personnes qui sont leur propre anc&ecirc;tre y sont
indiqu&eacute;es sous le message (en anglais): "<em>Untel</em> is
his/her own ancestor".

<p>

<h4>J'ai cherch&eacute; "Lemieux" et &ccedil;a m'a r&eacute;pondu
"Louis Maheux"</h4>

<font color=#2f6400><b>GeneWeb</b></font> fait une correction
d'orthographe qui peut parfois donner des r&eacute;sultats
&eacute;tranges, en effet. Cette correction s'applique pour les
pr&eacute;noms, pour les patronymes, et pour les noms complets.

<p>

Quand vous tapez un nom, <font color=#2f6400><b>GeneWeb</b></font>,
regarde s'il n'existe pas tel quel et sinon cherche des
r&eacute;ponses approch&eacute;es. Pour cela, il simplifie le nom au
moyen des r&egrave;gles suivantes:

<p>

<ul>

<li>Suppression de toutes les voyelles et des H
<li>Remplacement des K et des Q par des C
<li>Remplacement des Z par des S
<li>Remplacement des PH par des F
<li>Suppression des S finaux
<li>Suppression des consonnes doubl&eacute;es

</ul>

Ainsi, le pr&eacute;nom "Jean Charles" a pour signature: "JN CRL", qui
est la m&ecirc;me que "Juan Carlos", "John Charles", "Johann Karl". Si
vous cherchez "Jean Charles de Bourbon", vous pouvez donc tomber sur
"Juan Carlos de Borb&oacute;n".

<p>

Pour l'exemple donn&eacute; en titre, "Lemieux", la signature est
"LMX" qui est la m&ecirc;me, &agrave; l'espace pr&egrave;s, que "Louis
Maheux": "L MX". Si vous voulez une recherche par le patronyme
"Lemieux", cliquez sur le bouton "patronyme" avant le bouton "ok".

<p>

<h4>Pourquoi les champs "source" dans les gedcom ne sont-ils pas pris
en compte?</h4>

En fait, les sources ne sont pris en compte que s'ils sont sous forme
de texte, car <font color=#2f6400><b>GeneWeb</b></font> n'a pas pr&eacute;vu
de les enregistrer autrement.  S'ils sont repr&eacute;sent&eacute;s par une
structure source, <font color=#2f6400><b>GeneWeb</b></font> ne sait
pas les traiter car il ne sait pas à quoi correspondent les &eacute;l&eacute;ments
de cette structure.

<p>

<h4>Dans les formulaires, la touche "tab" semble aller d'un champ à l'autre
dans un ordre illogique</h4>

C'est un problème de navigateur. Il n'y a pas de moyen pour leur
indiquer d'aller dans un ordre logique. Certains navigateurs
fonctionnent correctement, d'autres non.

<p>
<hr>
<br>
<center>Retour vers <a href="diruse.htm">Mode d'Emploi</a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>

</body>
