<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
              "http://www.w3.org/TR/REC-html40/loose.dtd">
<head><title>FAQ</title></head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://cristal.inria.fr/~ddr/GeneWeb/"><img width=96
height=108 src="../images/gwlogo.gif" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Foire aux questions</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

<h4>Mon logiciel de g&eacute;n&eacute;alogie dit que ma base de
donn&eacute;es contient 3000 personnes, mais GeneWeb dit: 3050. Pourquoi
cette diff&eacute;rence?</h4>

Dans <font color=#2f6400><b>GeneWeb</b></font>, les parents sont toujours enregistr&eacute;s en
couple. S'il n'y a que le p&egrave;re ou que la m&egrave;re dans le fichier
GEDCOM, <font color=#2f6400><b>GeneWeb</b></font> ajoute l'autre parent, en lui donnant un point
d'interrogation comme pr&eacute;nom et comme nom. La diff&eacute;rence est
d&ucirc;e &agrave; ces parents manquants (mais qui ont exist&eacute;).

<h4>&Agrave; la premi&egrave;re utilisation de GeneWeb, j'ai le message:
Cannot access file "start.txt".</h4>

Regardez dans la doc: "Deux <a href=problem.htm>problèmes</a>
fréquemment rencontrés". Si cela ne fonctionne toujours pas,
signalez-le moi.

<h4>&Agrave; l'affichage des liens de parent&eacute;, il en manque.</h4>

<font color=#2f6400><b>GeneWeb</b></font> n'affiche pas les liens tels que la personne de
droite (resp. de gauche) descend d'une des personnes de la branche de
gauche (resp. de droite).

<p>

Car ces liens de parent&eacute;-l&agrave; deviennent rapidement
tellement nombreux que &ccedil;a en devient illisible. Ce sont des
liens r&eacute;els pourtant, et ils sont tout de m&ecirc;me
comptabilis&eacute;s dans le calcul de la consanguinit&eacute;.

<p>

<h4>En mode CGI, j'ai juste le message "Internal Server Error"</h4>

Un probl&egrave;me fr&eacute;quent concerne les droits d'acc&egrave;s.
Le serveur Web ex&eacute;cute souvent les CGI en tant qu'utilisateur
avec tr&egrave;s peu de droits (typiquement l'utilisateur "nobody"
sous Unix). Il se peut qu'il n'ait pas le droit d'ex&eacute;cuter
"gwd". V&eacute;rifiez les droits d'acc&egrave;s de "gwd" et de tous
les fichiers <font color=#2f6400><b>GeneWeb</b></font>!

<p>

<h4>Pourquoi l'&acirc;ge des personnes de plus de 80 ans n'est-il pas
affich&eacute;&nbsp;? Pourquoi ne sont-elles pas dans les statistiques
des personnes les plus &acirc;g&eacute;es&nbsp;?</h4>

Dans <font color=#2f6400><b>GeneWeb</b></font>, l'indication de
d&eacute;c&egrave;s a trois &eacute;tats: "vivant",
"d&eacute;c&eacute;d&eacute;" et "ne sais pas". L'&acirc;ge n'est
affich&eacute; que pour les personnes "vivantes". Si l'&acirc;ge n'y
est pas, c'est que soit la personne est d&eacute;c&eacute;d&eacute;e
(sans indication de date), soit que l'indication est &agrave; "ne sais
pas".

<p>

Si vous avez ajout&eacute; cette personne avec <font
color=#2f6400><b>GeneWeb</b></font> et que vous n'avez pas
pr&eacute;cis&eacute; si elle est vivante ou
d&eacute;c&eacute;d&eacute;e, ou bien si votre base de donn&eacute;es
provient d'un GEDCOM (l'indication "personne encore vivante"
n'&eacute;tant pas pr&eacute;vue dans le standard GEDCOM 5.5), <font
color=#2f6400><b>GeneWeb</b></font> applique l'algorithme suivant:

<ul>

<li>si la personne a moins de 80 ans, elle est indiqu&eacute;e
"vivante"

<li>si elle a plus de 120 ans, elle est indiqu&eacute;e
"d&eacute;c&eacute;d&eacute;e"

<li>entre les deux elle est indiqu&eacute;e "ne sais pas".

</ul>

&Agrave; vous de corriger ces indications si elles sont incorrectes.

<p>

<h4>Les personnes ayant ? (point d'interrogation) comme prénom et/ou
comme patronyme semblent avoir un statut particulier. Lequel et
pourquoi?</h4>

Ces personnes sont considérées par <font
color=#2f6400><b>GeneWeb</b></font> comme des "culs-de-sac": si elles
sont enfants, elles ne peuvent pas être conjoints, si elles sont
conjoints, elles ne peuvent pas avoir de parents. Et elles ne peuvent
pas avoir de notes associées.

<p>

De plus, si elles sont conjoints, elles ne sont pas exportées dans les
fichiers GEDCOM, et leurs informations personnelles (s'il y en a), sont
par conséquent perdues.

<p>

Il est possible, en bricolant un peu, de leur associer quand même des
notes ou de les relier quand même, mais attention: au premier
nettoyage de la base, ces notes et ces liens vont disparaître: il est
donc fortement déconseillé de faire cela.

<p>

Le prénom/patronyme "?" étant donc "réservé" dans <font
color=#2f6400><b>GeneWeb</b></font>, il ne faut pas appeler les gens
comme ça si on veut que ce soient des personnes qu'on veut relier au
reste de la base ou auxquelles on veut attacher des notes ou des
relations (parrains, enfants ou parents adoptifs, etc). La solution
est d'éditer ces personnes et de changer leur nom ou leur prénom par
autre chose: mettez "N", "Ne", "N...", "x", "??", ce que vous voulez,
mais pas juste "?".

<p>

<h4>Pourriez-vous am&eacute;liorer la "requ&ecirc;te
&eacute;volu&eacute;e" avec tel ou tel truc?</h4>

La "requ&ecirc;te &eacute;volu&eacute;e" est un bricolage que j'ai
fait mais que je ne trouve pas tr&egrave;s satisfaisant. <font
color=#2f6400><b>GeneWeb</b></font> n'utilisant pas un vrai
syst&egrave;me de bases de donn&eacute;es, toute am&eacute;lioration
dans cette partie-l&agrave; reviendrait &agrave;
r&eacute;&eacute;crire un nouveau syst&egrave;me de bases de
donn&eacute;es, ce que je n'ai pas l'intention de faire, car &ccedil;a
repr&eacute;sente un travail gigantesque.

<p>

Si <font color=#2f6400><b>GeneWeb</b></font> utilise un jour un vrai
syst&egrave;me de bases de donn&eacute;es (&ccedil;a fait partie des
orientations possibles), cette requ&ecirc;te &eacute;volu&eacute;e
sera certainement r&eacute;&eacute;crite, et sera beaucoup plus
puissante et plus pratique.

<p>

<h4>Pourrait-on avoir un affichage complet des ancêtres, même avec les
répétitions des numéros Sosa?</h4>

Je comprends que ce serait utile, mais cela pose de gros problèmes.
J'ai déjà expérimenté ce trait mais je me suis rendu compte que pour
les personnes qui ont beaucoup d'ancêtres, l'affichage était noyé par
des références à d'autres ancêtres et devenait illisible. Sans compter
que cela provoque beaucoup de calculs ("algorithme exponentiel").

<p>

Si vous voulez savoir si une lignée d'ancêtre est pleine, regardez le
problème à l'envers avec "ascendants manquants".

<p>

<h4>Quelle est la convention d'affichage des dates courtes ?</h4>

<pre>
     Dupont 1935-1950 = né en 1935, mort en 1950
     Dupont 1935-     = né en 1935, non décédé (toujours vivant)
     Dupont 1935 +    = né en 1935, décédé date inconnue
     Dupont *1935     = né en 1935, ne sais pas s'il est décédé ou non
     Dupont +1950     = décédé en 1950, date de naissance inconnue

         /1935        = avant 1935
         1935/        = après 1935
         ca 1935      = vers 1935
                        peut-être en 1935
         ca 1535/1538 = en 1935 ou en 1938
                        entre 1935 et 1938
</pre>

Cette convention ne se refère pas un un "standard" particulier. Si vous
connaissez une meilleure convention, plus connue, plus standard, n'hésitez
pas à m'en faire part. Merci.

<p>
<hr>
<br>
<center>Retour vers <a href="diruse.htm">Mode d'Emploi</a></center>

<p><hr><font size=-1><em>&copy; Copyright INRIA 2000 -
GeneWeb</em></font><br>

</body>
