<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head><title>Gwsetup</title></head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://pauillac.inria.fr/~ddr/GeneWeb/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>Gwsetup</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Gwsetup est un programme qui vous permet de d&eacute;marrer avec <font
color=#2f6400><b>GeneWeb</b></font> sans avoir besoin de taper des
commandes. Si vous utilisez ce programme, vous pouvez ignorer
compl&egrave;tement le chapitre <a href="start.htm">Démarrer avec
GeneWeb</a> r&eacute;serv&eacute; aux personnes qui
pr&eacute;f&egrave;rent taper des commandes.

<p>

Pour utiliser gwsetup:

<p>

<ul>

<li> sous Windows, allez simplement dans le r&eacute;pertoire
principal de votre distribution de <font
color=#2f6400><b>GeneWeb</b></font> et double-cliquez sur
"gwsetup". Une fen&ecirc;tre vous appara&icirc;tra, vous demandera de
choisir votre langue et vous dira d'ouvrir une certaine adresse dans
votre navigateur Web. <b>Attention: il ne faut pas supprimer la
fen&ecirc;tre qui vous affiche tout cela!</b> Car dans cette
fen&ecirc;tre tourne le programme gwsetup qui dialogue avec votre
navigateur Web. Vous pouvez la r&eacute;duire dans la barre des taches
à l'aide du bouton réduire en haut et à droite de la fenêtre.

<li> sous Linux, si vous avez install&eacute; le paquetage rpm, il
est probable que vous n'avez rien &agrave; faire: le serveur gwsetup
a d&eacute;j&agrave; &eacute;t&eacute; lanc&eacute; pour vous. &Agrave;
l'installation du paquetage, &ccedil;a vous a dit d'ouvrir une certaine
adresse: c'est celle-l&agrave; que vous devez utiliser &agrave; chaque
fois que vous voulez g&eacute;rer vos bases de donn&eacute;es.

<li> si vous avez install&eacute; Geneweb sous Unix ou Linux par une
autre m&eacute;thode, vous pouvez lancer gwsetup simplement en tapant
"./gwsetup" dans un xterm.

</ul>

<p>

Gwsetup vous permet alors, en utilisant votre navigateur Web, de
cr&eacute;er une nouvelle base de donn&eacute;es, ou &agrave; partir
d'un GEDCOM, ou, plus tard, d'extraire un GEDCOM de votre base de
donn&eacute;es, de changer des param&ecirc;tres d'affichage, etc etc.

<p>
<hr>
<br>
<center>Retour vers <a href="diruse.htm">Mode d'Emploi</a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2005 INRIA -
GeneWeb</em></font><br>

</body>
