<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>GeneWeb - Maintenance</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://opensource.geneanet.org/projects/geneweb/"><img 
 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Maintenance</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Cette partie vous indique quelques "trucs" importants pour la maintenance
de votre base de donn&eacute;es.

<ul>

<li> <a href="#Clea">1.</a> Nettoyage.

<li> <a href="#Rena">2.</a> Renommage.

<li> <a href="#Save">3.</a> Sauvegarde.

</ul>

<p>

Si vous utilisez <b><a href="gwsetup.htm">gwsetup</a></b>, vous pouvez
faire ces op&eacute;rations avec. La m&eacute;thode ci-dessous ne
concerne que l'approche par des commandes int&eacute;ractives.

<p>

<hr>
<h3><a name="Clea">
</a> <font color=#2f6400>1.Nettoyage </font></a></h3>

Au fur et &agrave; mesure que vous modifiez votre base de
donn&eacute;es avec votre navigateur, quelques petits probl&egrave;mes
peuvent surgir:

<p><ul><li> Si vous avez fait beaucoup de mises &agrave; jour,
l'acc&egrave;s aux donn&eacute;es devient petit &agrave; petit plus
lent.</ul>

<p><ul><li> Si vous ajoutez de nouvelles familles ou que vous en
modifiez, la consanguinit&eacute; ne s'affiche plus ou peut &ecirc;tre
incorrecte.</ul>

<p><ul><li> Si vous supprimez des personnes et des familles, la place
occup&eacute;e n'est pas r&eacute;cup&eacute;r&eacute;e: ainsi, quand
vous supprimez une personne, la page d'accueil affiche toujours le
m&ecirc;me nombre de personnes.</ul>

Il faut alors nettoyer la base.

<p><ul><li> Un premier nettoyage peut se faire avec la commande
"consang" qui recalcule la consanguinit&eacute; pour toute la base et
permet de rendre au temps d'acc&egrave;s &agrave; sa vitesse
maximum. Si votre base s'appelle "toto", prenez une fen&ecirc;tre
interactive (voir la partie "Comment <a
href="start.htm#Int">d&eacute;marrer</a> avec GeneWeb") et tapez:

<pre>
     consang toto
</pre>

<p>

Cette commande peut prendre quelque secondes ou minutes, en fonction
de la taille de la base. Un compteur s'affiche pour passer le
temps... Remarquez que pendant cette op&eacute;ration, les
mises-&agrave;-jour en ligne sont refus&eacute;es: si vous faites "Ok"
dans un formulaire, un message aimable vous invitera &agrave;
r&eacute;essayer plus tard.

<p>

Sous Unix, vous pouvez interrompre cette commande &agrave; tout
moment, en tapant "control-C" dans la fen&ecirc;tre
interactive. Le calcul des consanguinit&eacute;s ne sera pas
termin&eacute; mais la base sera nettoy&eacute;e. Vous pourrez
recommencer "consang" plus tard, il reprendra le calcul o&ugrave; il
l'avait laiss&eacute; (sauf si vous faites des modifications de
familles, auquel cas il reprendra depuis le d&eacute;but).

</ul>

<p><ul><li> Un nettoyage plus blanc que blanc (parce que le nettoyage
pr&eacute;c&eacute;dent n'&eacute;tait que gris-clair) consiste
&agrave; utiliser "gwu" et "gwc". Ce nettoyage-l&agrave; repart d'une
base toute neuve ou la place des personnes supprim&eacute;es a
&eacute;t&eacute; r&eacute;cup&eacute;r&eacute;e. Dans une
fen&ecirc;tre interactive, tapez, pour la base "toto":

<pre>
     gwu toto &gt; toto.gw
</pre>

puis:

<pre>
     gwc toto.gw -o titi
</pre>

Il est recommand&eacute; de ne pas recr&eacute;er une base du
m&ecirc;me nom, car si "gwu" ou "gwc" a mal fonctionn&eacute;, vous
risquez de tout perdre. Ici, on l'a appel&eacute;
"titi".

<p>

V&eacute;rifiez que "titi" est correct, et s'il l'est, supprimez
ensuite la base "toto" (en supprimant le r&eacute;pertoire "toto.gwb"),
puis renommez "titi" en "toto" (en renommant "titi.gwb" en
"toto.gwb"). Voyez cette manipulation &agrave; la section suivante.

<p>

Apr&egrave;s le passage de "gwc", il reste des fichiers avec
l'extension ".gwo". Vous pouvez les supprimer. Supprimez aussi les
fichiers ".gw" &agrave; moins que vous vouliez les garder pour avoir
des sauvegardes.

<p>

Si vous voulez que la consanguinit&eacute; fonctionne, il vous faut
aussi repasser "consang" sur cette base toute neuve.

</ul>

<hr>
<h3><a name="Rena">
</a> <font color=#2f6400>2.Renommage </font></a></h3>

Les bases de donn&eacute;es <b><font color=#2f6400>GeneWeb</font></b> sont des
r&eacute;pertoires avec l'extension ".gwb". Si vous changez simplement
le nom du r&eacute;pertoire "titi.gwb" en "toto.gwb", votre base qui
s'appelait "titi" s'appellera "toto".

<p>

Pour faire cette manipulation, vous avez le choix entre les
fen&ecirc;tres d'ic&ocirc;nes, si votre syst&egrave;me en a un, ou les
commandes interactives.

<p><ul><li> Avec des fen&ecirc;tres d'ic&ocirc;nes, pour changer
"titi.gwb" en "toto.gwb":

<p>

<ul>

<li> Ouvrez la fen&ecirc;tre contant vos bases.

<li> Mettez "toto.gwb", s'il existe, &agrave; la poubelle.

<li> Renommez "titi.gwb" en "toto.gwb".

</ul>

</ul>

<p><ul><li> Avec une fen&ecirc;tre de commandes interactives:

<p>

<ul>

<li> Sous Unix:

<pre>
     rm -rf toto.gwb
     mv titi.gwb toto.gwb
</pre>

<li> Sous Windows:

<pre>
     del toto.gwb\*.*
     rmdir toto.gwb
     move titi.gwb toto.gwb
</pre>

</ul>

</ul>

</ul>

<hr>
<h3><a name="Save">
</a> <font color=#2f6400>3.Sauvegarde</font></a></h3>

Les ordinateurs ne sont pas des machines fiables &agrave; 100%. Vous
avez tout int&eacute;r&ecirc;t &agrave; sauvegarder vos donn&eacute;es
de temps en temps, en les recopiant sur un autre support (des
disquettes par exemple).

<p>

Il peut &ecirc;tre int&eacute;ressant aussi de garder des versions
interm&eacute;diaires pour revenir en arri&egrave;re au besoin.

<p>

Pour sauvegarder la base "toto", faites simplement une copie du
r&eacute;pertoire "toto.gwb" sur l'autre support (ou ailleurs sur le
disque si vous d&eacute;sirez simplement le garder comme version
interm&eacute;diaire).

<p>

Mais il existe un moyen plus malin pour la sauvegarde: sauvez plut&ocirc;t
votre base sous forme de fichiers sources. Pour la base "toto", tapez dans
une fen&ecirc;tre de commandes interactives:

<pre>
     gwu toto &gt; toto.gw
</pre>

Et recopiez le fichier "toto.gw" sur l'autre support ou ailleurs sur le
disque. Vous pouvez aussi lui donner un autre nom (mais toujours avec
l'extension ".gw") pour votre archivage.

<p>

La sauvegarde sous forme de fichiers ".gw" a plusieurs avantages:

<p><ul><li> C'est plus simple, puisque ce n'est juste qu'un fichier,
alors que la base, c'est tout un r&eacute;pertoire.</ul>

<p><ul><li> C'est plus petit en taille.</ul>

<p><ul><li> On peut le reconstituer avec n'importe quel autre "gwc",
même d'une version future de <b><font color=#2f6400>GeneWeb</font></b>.</ul>

<p><ul><li> &Eacute;tant sous forme de texte, il est lisible sous un
&eacute;diteur (Word, Emacs, etc.); on ne sait jamais, ça peut
servir. Un logiciel de g&eacute;n&eacute;alogie dans 3 si&egrave;cles
pourra facilement reconstituer votre base.</ul>

<p><ul><li> On peut faire une comparaison entre diff&eacute;rentes versions
sauvegard&eacute;es et avec la version courante.</ul>

<p>

Pour restaurer la base "toto" &agrave; partir du fichier "toto.gw", tapez:

<pre>
     gwc toto.gw -o toto
</pre>

<p>
<hr>
<br>
<center>Retour vers <a href="diruse.htm">Mode d'Emploi</a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>


</body>
