<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <!-- Copyright (c) 1998-2006 INRIA - GeneWeb -->
  <!-- $Id: gwd.htm,v 5.1 2006-01-01 05:35:06 ddr Exp $ -->
  <meta http-equiv="Content-Type" content="text/html; charset=%charset;"%/>
  <meta http-equiv="Content-Style-Type" content="text/css"%/>
  <meta name="robots" content="none"%/>
  <link rel="shortcut icon" href="images/favicon_gwsetup.png"%/>
  <link rel="stylesheet" type="text/css" href="css/default.css" />
  <title>[
de: Parameter f&uuml;r "gwd"
en: Parameters for "gwd"
es: Par&aacute;metros de gwd
fr: Param&egrave;tres de gwd
it: Parametri di gwd
lv: "gwd" parametri
sv: Parametrar för "gwd"
]</title>
</head>

<body>

<center><h1><font color=#2f6400>[
de: Parameter f&uuml;r "gwd"
en: Parameters for "gwd"
es: Par&aacute;metros de gwd
fr: Param&eacute;trage de gwd
it: Parametri di gwd
lv: "gwd" parametri
sv: Parametrar för "gwd"
]</font></h1></center>

<p><p>

<form method=POST action="gwd_1">
<input type=hidden name=lang value=%l>
<input type=hidden name=setup_link value="">

<p>

[
de: Hier sind die Parameter f&uuml;r das Kommando "gwd". 
    Du kannst die folgenden Werte &auml;nder:
en: Here are the parameters of the command "gwd". Change the one you
    estimate necessary:
es: A continuaci&oacute;n se indican los par&aacute;metros del
    commando "gwd". Cambie aquellos que Ud. juzgue necesario:
fr: Voici les param&egrave;tres de la commande "gwd". Vous pouvez
    modifier les paramètres suivants:
it: Ecco i parametri del comando "gwd". Potete
    modificare i seguenti parametri:
lv: Ðeit ir sekojoði komandas "gwd" parametri. Mainiet tos, ja uzskatiet
    par nepiecieðamu:
sv: Här är parametrarna för kommandot "gwd". Ändra dem som du anser
    behövs:
]

<p>

<dl><dt><dd><table border=1>
<tr align=left>
<td valign=top><strong>-lang</strong></td>
<td>[
de: Standardsprache.
en: Default language.
es: Lenguaje por defecto.
fr: Langue par d&eacute;faut.
it: Lingua standard.
lv: Noklusçtâ valoda.
sv: Förvalt språk.
]

<p>

[
de: Standardm&auml;&szlig;ig werden alle Seiten der Datenbank in dieser Sprache
    dargestellt. W&auml;hle deine bevorzugte Sprache.
en: By default, all the pages of the databases are displayed in this language.
    Select your prefered language.
es: Por defecto, las p&aacute;ginas de todas las bases de datos son
    presentadas en este lenguaje. Seleccione su lenguaje preferido.
fr: Par d&eacute;faut, les pages de toutes les bases de donn&eacute;es
    sont affich&eacute;es dans cette langue. S&eacute;lectionnez votre
    langue de pr&eacute;f&eacute;rence.
it: Come settaggio predefinito, le pagine di tutte le basi di dati vengono visualizzate
    in questa lingua. Selezionate la vostra lingua preferita.
lv: Pçc noklusçjuma, visas datu bâzes lappuses tiek parâdîtas ðinî valodâ.
    Izvçlieties savu valodu.
sv: Alla sidor för databasen visas i detta språk. Välj det språk du föredrar.
]

<p>

[
de: Bei einer gegebenen Datenbank kann diese Auswahl immer noch &uuml;ber
    den speziellen Aufrufparameter ge&auml;ndert werden. Ebenso kann auf der
    Willkommensseite durch Anklicken einer Fahne immer noch eine andere
    Sprache gew&auml;hlt werden. Insofern kann man diese Auswahl hier als
    "Standard-Standardsprache" betrachten.
en: For a given database, you can still change this choice by
    configurating the specific parameters of this database. And in the
    welcome page of the base, you can still click on another flag to
    select another language. The present choice is therefore like a
    "default default" language.
es: En una base de datos, uno puede nuevamente cambiar esta preferencia,
    configurando los par&aacute;metros espec&iacute;ficos a esta base.
    Para ello, en la "P&aacute;gina de Recepci&oacute;n" de una base de datos,
    uno puede cliquear en una bandera af&iacute;n de
    seleccionar otro lenguaje. La selecci&oacute;n presente es entonces en
    cierto modo el lenguaje "por defecto por defecto".
fr: Pour une base donn&eacute;e, on peut encore changer ce choix en
    configurant les param&egrave;tres sp&eacute;cifiques &agrave; cette
    base de donn&eacute;es. Et dans la page d'accueil d'une base de
    donn&eacute;es, on peut encore cliquer sur un autre drapeau pour
    s&eacute;lectionner une autre langue. Le choix pr&eacute;sent est donc
    en quelque sorte la langue "par d&eacute;faut par d&eacute;faut".
it: Per una base di dati, si pu&ograve; ancora cambiare questa scelta
    configurando i parametri specifici a questa base di dati. Nella pagina di
    benvenuto di una base di dati, si pu&ograve; ancora cliccare su una
    bandiera per selezionare un'altra lingua. La scelta presente &egrave;
    quindi in qualche modo la "lingua standard".
lv: Ðai datu bâzei to joprojâm varçsiet mainît arî vçlâk. Un arî datubâzes
    sâkumlapâ Jûs varçsiet, uzklikðíinot uz cita karodziòa, izvçlçties citu
    valodu. Ðo parametru varçtu nosaukt par noklusçtâs noklusçto valodu.
sv: För en given databas, kan du ändå ändra detta val genom att
    konfigurera de specifika parametrarna för denna databas. Och på
    välkomstsidan för databasen, kan du också byta språk genom att
    klicka på en flagga. Detta val är därför som ett "förvalt förvalt"
    språk.
]

<p><p>

[
de: Falls "-" gew&auml;hlt ist, gilt Franz&ouml;sisch als Standardsprache.
en: If "-" is selected, it is French.
es: Si la selecci&oacute;n es "-", el lenguaje por defecto es el
    franc&eacute;s.
fr: Si c'est "-", c'est le fran&ccedil;ais.
it: Se la selezione egrave; "-", la lingua standard &egrave; il francese.
lv: Ja ir atstâts "-" , tad tâ bûs franèu valoda.
sv: Om "-" är valt, är det franska.
]
</td>
</tr>

<tr align=left>
<td>&nbsp;</td><td>
<select name=default_lang>
<option value=""%Edefault_lang=;>-
<option value="af"%Edefault_lang=af;>%Laf;
<option value="bg"%Edefault_lang=bg;>%Lbg;
<option value="br"%Edefault_lang=br;>%Lbr;
<option value="ca"%Edefault_lang=ca;>%Lca;
<option value="cs"%Edefault_lang=cs;>%Lcs;
<option value="da"%Edefault_lang=da;>%Lda;
<option value="de"%Edefault_lang=de;>%Lde;
<option value="en"%Edefault_lang=en;>%Len;
<option value="eo"%Edefault_lang=eo;>%Leo;
<option value="es"%Edefault_lang=es;>%Les;
<option value="et"%Edefault_lang=et;>%Let;
<option value="fi"%Edefault_lang=fi;>%Lfi;
<option value="fr"%Edefault_lang=fr;>%Lfr;
<option value="he"%Edefault_lang=he;>%Lhe;
<option value="is"%Edefault_lang=is;>%Lis;
<option value="it"%Edefault_lang=it;>%Lit;
<option value="lv"%Edefault_lang=lv;>%Llv;
<option value="nl"%Edefault_lang=nl;>%Lnl;
<option value="no"%Edefault_lang=no;>%Lno;
<option value="pl"%Edefault_lang=pl;>%Lpl;
<option value="pt"%Edefault_lang=pt;>%Lpt;
<option value="pt-br"%Edefault_lang=pt-br;>%Lpt-br;
<option value="ro"%Edefault_lang=ro;>%Lro;
<option value="ru"%Edefault_lang=ru;>%Lru;
<option value="sl"%Edefault_lang=sl;>%Lsl;
<option value="sv"%Edefault_lang=sv;>%Lsv;
<option value="zh"%Edefault_lang=zh;>%Lzh;
</select>
</td>
</tr>
</table></dl>

<dl><dt><dd><table border=1>
<tr align=left>
<td valign=top><strong>-only</strong></td>
<td>[
de: Nur berechtigte Adressen.
en: Only authorized address.
es: &Uacute;nica direcci&oacute;n autorisada.
fr: Seule adresse autoris&eacute;e.
it: Unico indirizzo autorizzato.
lv: Tikai autorizçta adrese.
sv: Endast behöriga adresser.
]

<p>

[
de: Befehle werden nur von dieser Internet-Adresse akzeptiert.
en: Only the requests from this Internet address are accepted.
es: Unicamente las demandas provenientes de esta direcci&oacute;n
    Internet seran aceptadas.
fr: Seules les requ&ecirc;tes provenant de cette adresse Internet seront
    accept&eacute;es.
it: Solamente le richieste provenienti da questo indirizzo Internet saranno
    accettate.
lv: Tikai no piepasîjumi no autorizçtas Interneta adrese tiek akceptçti.
sv: Endast åtkomster från denna internet adress accepteras.
]

<p>

[
de: Um herauszufinden, welchen Wert du hier f&uuml;r deinen Rechner einsetzen
    mu&szlig;t, schaue dir die Trace-Ausgaben des Kommandos "gwd" an, die
    jedesmal ausgegeben werden, wenn du eine Abfrage an deine Datenbanken
    machst. Du mu&szlig;t das eintragen, was dort hinter "From:" ausgegeben
    wird.
en: To know which value put for your computer, look at the traces of the
    command "gwd" which are displayed each time you navigate in your
    databases. You have to put what you see behind the "From:".
es: Para saber el valor a utilizar en su ordinador, mire Ud. las
    trazas del comando "gwd", que se presentan en la pantalla cada vez que
    Ud. explora una base de datos. Utilise lo que Ud. ve despu&eacute;s
    de "From:".
fr: Pour savoir quelle valeur mettre pour votre ordinateur, regardez les
    traces de la commande "gwd" qui s'affichent chaque fois que vous
    naviguez dans une base de donn&eacute;es. Il faut mettre ce que vous
    voyez derri&egrave;re le "From:".
it: Per sapere quale valore mettere per il vostro computer, osservate le
    tracce del comando "gwd", che vengono visualizzate sullo schermo
    ogni volta che navigate nella base di dati. Bisogna mettere quello che
    vedete dopo "From:".
lv: Lai uzzinâtu sava datora adresi, skatiet programmas "gwd" darbîbas
    pçdas, kas redzamas katru reizi, kad Jûs darbojoties ar savâm datu
    bâzçm. Ðeit Jums jâieraksta, tas ko Jûs redziet pçc "From:".
sv: För att veta vilket värde du ska skriva in för din dator, titta på
    utskriften för kommandot "gwd" vilka visas varje gång du navigerar i din
    database. Du ska skriva in det som står efter "From:".
]

</td>
</tr>

<tr align=left>
<td>&nbsp;</td>
<td><input name=only value="%Vonly;" size=40>
</tr>
</table></dl>

<dl><dt><dd><table border=1>
<tr align=left>
<td valign=top><strong>-log</strong></td>
<td>[
de: Protokolldatei f&uuml;r Verbindungen.
en: Connection log file.
es: Fichero de trazas de conecci&oacute;n.
fr: Fichier de traces de connexion.
it: File delle tracce di collegamento.
lv: Pieprasîjumu reìistrâcijas datne.
sv: Åtkomst loggfil.
]

<p>

[
de: Standardm&auml;&szlig;ig werden die Verbindungs-Trace-Ausgaben in dem
    Fenster ausgegeben, in dem "gwd" l&auml;uft. Jedesmal, wenn du oder
    jemand anders auf eine deiner Datenbanken zugreift, werden dort vier
    oder f&uuml;nf Zeilen ausgegeben.
en: By default the connection traces appear in the window of "gwd". Each time
    you navigate, or somebody accesses to one of your databases, 4 or 5 lines
    are displayed.
es: Por defecto, las trazas de conecci&oacute;n aparecen en la "ventana"
    de "gwd". Cada vez que Ud. explora; o que alguien accede a una de sus
    bases de datos, uno ve que 4 o 5 l&iacute;neas se presentan en dicha
    "ventana".
fr: Par d&eacute;faut, les traces de connexion apparaissent dans la
    fen&ecirc;tre de "gwd". Chaque fois qu'on navigue, ou que quelqu'un
    acc&egrave;de &agrave; une de vos bases de donn&eacute;es, on voit
    s'afficher 4 ou 5 lignes.
it: Come settaggio standard, le tracce di collegamento appaiono nella finestra
    di "gwd". Ogni volta che si naviga o che qualcuno accede a
    una delle vostre basi di dati, vengono visualizzate in questa finestra
    4 o 5 linee.
lv: Pçc noklusçjuma pieprasîjumu pçdas parâdâs "gwd" logâ. Katru reizi,
    kad Jðu vai kâds cits darbojas ar kâdu no datu bâzçm, tiek parâdîtas
    4 vai 5 paziòojumu rindiòas.
sv: Åtkomst utskriften visas i "gwd" fönstret. Varje gång
    du navigerar, eller någon gör en åtkomst till din databas, visas
    4 eller 5 rader.
]

<p>

[
de: Wenn du m&ouml;chtest, da&szlig; diese Daten stattdessen in einer Datei
    protokolliert werden, gib hier den gew&uuml;nschten Dateinamen an.
    Die Datei wird im <font
    color=#2f6400><b>GeneWeb</b></font>-Hauptverzeichnis angelegt (dort wo
    die Kommandos "gwsetup" und "gwd" stehen), falls sie nicht existiert.
en: If you want that the traces rather go in a file, write here the name of
    the file here. This file will be created if it does not exist, in the
    main directory of <font color=#2f6400><b>GeneWeb</b></font> where you
    see the commands "gwsetup" and "gwd". It will be extended at each request.
es: Si Ud. desea que las trazas vayan mas bien hacia un fichero; indique
    aqu&iacute; el nombre del fichero que Ud. desea utilizar. Este fichero
    ser&aacute; creado, en caso que el no exista a&uacute;n, en la carpeta
    principal de <font color=#2f6400><b>GeneWeb</b></font> donde Ud ve los
    comandos "gwsetup" y"gwd". A cada demanda de datos a su base, este
    fichero sera incrementado de las l&iacute;neas de trazas correspondientes.
fr: Si vous d&eacute;sirez que les traces aillent plut&ocirc;t dans un
    fichier, indiquez ici le nom du fichier que vous d&eacute;sirez. Ce
    fichier sera cr&eacute;&eacute;, s'il n'existe pas, dans le
    r&eacute;pertoire principal de <b><font color=#2f6400>GeneWeb</font></b>
    o&ugrave; vous voyez les commandes "gwsetup" et "gwd". Il sera
    rallong&eacute; &agrave; chaque requ&ecirc;te.
it: Se decidete di redirigere le tracce verso un file, indicate qui
    il nome del file desiderato. Se questo file non esiste, sar&agrave;
    creato nella directory principale di
    <b><font color=#2f6400>GeneWeb</font></b> dove vedete i comandi
    "gwsetup" e "gwd". Sar&agrave; aggiornato ad ogni richiesta.
lv: Ja Jûs labâk vçlaties pçdas tiek ierakstîtas datnç, tad ierakstiet ðeit
    datnes nosaukumu. Ja ðâda datne tiks izviedota (ja neeksistçs) galvenajâ
    <font color=#2f6400><b>GeneWeb</b></font> katalogâ, kurâ atrodas arî
    komandas "gwsetup" un "gwd". Pçc katra pieprasîjuma ðî datne tiks
    papildinâta.
sv: Om du istället vill att utskriften går till en fil, skriv namnet
    för filen här. Filen kommer att skapas, om den inte finns, i
    huvudkatalogen för <font color=#2f6400><b>GeneWeb</b></font> där du
    ser kommandona "gwsetup" och "gwd". Den kommer att utökas för varje
    åtkomst.
]
</td>
</tr>

<tr align=left>
<td>&nbsp;</td>
<td><input name=log value="%Vlog;" size=40>
</tr>
</table></dl>

<dl><dt><dd>[
de: Es gibt noch weitere Parameter f&uuml;r das Kommando "gwd",
    aber diese sind hier nicht konfigurierbar, weil sie die
    Ausf&uuml;hrung des "gwsetup" beeintr&auml;chtigen k&ouml;nnen.
en: Other parameters exist for the command "gwd", but
    are not configurable here because they can perturbate the operation of
    "gwsetup".
es: El comando "gwd" posee a&uacute;n otros par&aacute;metros suplementarios,
    pero estos no son configurables aqu&iacute;, debido al hecho que ellos
    pueden perturbar el funcionamiento del "gwsetup".
fr: D'autres param&egrave;tres existent pour la commande "gwd",
    mais ils ne sont pas configurables ici, car ils peuvent perturber le
    fonctionnement de "gwsetup".
it: Esistono altri parametri per il comando "gwd", ma non possono essere
    settati qui, perch&eacute; possono perturbare il funzionamento di
    "gwsetup".
lv: Citi "gwd" komandas parametri ðeit nav izmainâmi, jo tie var ietekmçt
    paðas "gwsetup" programmas darbîbu.
sv: Det finns andra parametrar för kommandot "gwd", men
    de kan inte konfigureras här ifrån, därför att de kan hindra
    operationen av "gwsetup".
]</dl>

<dl><dt><dd>[
de: In der Tat ist die Navigation mittels des "gwsetup" dazu gedacht, die
    Benutzung von <font color=#2f6400><b>GeneWeb</b></font> einfacher zu
    machen, nicht um alle M&ouml;glichkeiten auszuprobieren.
    Zur Nutzung der &uuml;brigen Parameter ist ein wenig "Hackerwissen"
    erforderlich. Einige Informationen finden sich in der Dokumentation.
en: Indeed, the navigation by "gwsetup" is mainly destinated to make the
    use of <font color=#2f6400><b>GeneWeb</b></font> simpler, but does not
    allow to exploit quite all the possibilities. To find the other
    parameters and their use, you must be a little bit "hacker": some
    informations can be found in the documentation.
es: En efecto la exploraci&oacute;n a partir del "gwsetup" es destinada
    principalmente a hacer que la utilisaci&oacute;n de
    <font color=#2f6400><b>GeneWeb</b></font> sea m&aacute;s simple,
    pero no permite de explotar completamente todas las posibilidades
    del comando. Para encontrar los otros par&aacute;metros, as&iacute; como
    su utilisaci&oacute;n, es necesario de ser un poco "ma&ntilde;oso":
    Ud. encontrar&aacute; algunas informaciones buscando bi&eacute;n en
    la documentaci&oacute;n.
fr: En effet, la navigation par "gwsetup" est principalement
    destin&eacute;e &agrave; rendre plus simple l'utilisation de
    <b><font color=#2f6400>GeneWeb</font></b>, mais ne permet pas d'en
    exploiter tout &agrave; fait toutes les possibilit&eacute;s. Pour
    trouver les autres param&egrave;tres et leur usage, il faut &ecirc;tre
    un peu "bricoleur": quelques informations peuvent &ecirc;tre
    trouv&eacute;es en cherchant dans la documentation.
it: In effetti, la navigazione con "gwsetup" &egrave; principalmente
    destinata a rendere pi&ugrave; semplice l'utilizzazione di
    b><font color=#2f6400>GeneWeb</font></b>, ma non permette di
    sfruttarne pienamente tutte le possibilit&agrave;. Per trovare altri
    parametri e conoscerne il loro uso, ci vuole un poco di "fai-da-te"; alcune
    informazioni possono essere trovate cercando nella documentazione.
lv: Patieðâm "gwsetup" programmâ ir galvenokârt veidota, lai padarîtu
    <font color=#2f6400><b>GeneWeb</b></font> lietoðanu vienkârðâku, bet
    tâ neïauj izmantot visas tâs iespçjas. Lai atrastu citus parametrus un
    to pielietojumu, Jums jâkïûst nedaudz par "hakeri": daþa informâcija
    ir atrodama dokumntâcijâ.
sv: Faktiskt, navigation med "gwsetup" är huvudsakligen för att göra
    användandet av <font color=#2f6400><b>GeneWeb</b></font> enklare, men
    det tillåter inte att utnyttja alla möjligheter. För att finna de andra
    parametrarna och deras användning, måste du vara lite av en "datahacker":
    en del av informationen kan hittas i dokumentationen.
]</dl>

<p>

[
de: Dann dr&uuml;cke diesen Knopf:
en: Then push this button:
es: A continuaci&oacute;n apoye Ud. en el bot&oacute;n:
fr: Puis appuyez sur ce bouton:
it: Poi cliccate su questo bottone:
lv: Tad nospiediet ðo podziòu:
sv: Tryck sedan på denna knapp:
]

<p>

<input type=submit value="[
de: Konfigurieren
en: Configure
es: Configurar
fr: Configurer
it: Configurare
lv: Configure
sv: Konfigurera
]">

</form>
