<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>FAQ </TITLE>
<META NAME="Template" CONTENT="D:\Program Files\Microsoft Office\Office\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#d6bfaf">

<H1>Frequently Asked Questions </H1>
<H4>Mitt genealogi program s&auml;ger mig att databasen inneh&aring;ller 3000 individer, men GeneWeb s&auml;ger: 3050 individer. Varf&ouml;r denna skillnad?</H4>
<P>I <EM>GeneWeb</EM>, &auml;r f&ouml;r&auml;ldrar alltid lagrade i par. N&auml;r det bara &auml;r fadern eller modern i GEDCOM filen, l&auml;gger <EM>GeneWeb</EM> till den andra f&ouml;r&auml;ldern och s&auml;tter fr&aring;getecken som f&ouml;r- och efternamn. Skillnaden &auml;r dessa saknade (men har existerat) f&ouml;r&auml;ldrar. </P>
<H4>Varf&ouml;r vissa datum &auml;r transformerade av ged2gwb till "kanske i..."?</H4>
<P>N&auml;r <EM>GeneWeb</EM> inte kan k&auml;nna igen ett datum i en GEDCOM fil, f&ouml;rmodligen f&ouml;r att detta datum inte f&ouml;ljer GEDCOM&nbsp;5.5 standarden (men det kan vara ett fel i <I>GeneWeb</I>: meddela mig om s&aring; &auml;r fallet), f&ouml;rs&ouml;ker den att finna n&aring;got som ser ut som en &aring;rtal i datum raden. Den l&auml;gger till ett "kanske" f&ouml;r att indikera att den inte &auml;r s&auml;ker p&aring; det. </P>
<H4>Vid f&ouml;rsta anv&auml;ndandet av GeneWeb, f&aring;r jag meddelandet: Cannot access file "start.txt".</H4>
<P>Titta p&aring; dokumentet: "N&aring;gra &aring;terkommande <A HREF="problem.htm">problem</A>". Om det inte fungerar b&auml;ttre, var sn&auml;ll och meddela mig. </P>
<H4>N&auml;r man visar sl&auml;ktskaps l&auml;nkar, vissa fattas.</H4>
<EM><P>GeneWeb</EM> visar inte l&auml;nkar s&aring;dana att den h&ouml;gra (resp. v&auml;nstra) personen &auml;r &auml;ttling till en person fr&aring;n den v&auml;nstra (resp. h&ouml;gra) grenen. </P>
<P>D&auml;rf&ouml;r att dessa sl&auml;ktskaps l&auml;nkar ofta blir s&aring; m&aring;nga att visningen blir ol&auml;slig. De &auml;r emellertid riktiga sl&auml;ktskaps l&auml;nkar och &auml;r medr&auml;knade i blodsbands ber&auml;kningen. </P>
<P>Tillbaka till <A HREF="diruse.htm">bruksanvisningen</A>. </P>
<P><HR></P>
<FONT SIZE=2><EM><P>&copy; Copyright INRIA 1999 - GeneWeb</P></FONT></EM></BODY>
</HTML>
