<HEAD><TITLE>GeneWeb - Server eller CGI</TITLE>
</HEAD>

<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://www.geneweb.org/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400>GeneWeb - Server eller CGI</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

<P>N&auml;r  "gwd"  &auml;r startad, &auml;r den en server. Normalt, ska den tredje
adressen: "http://computer:2317/base" anv&auml;ndas f&ouml;r externa personer. </P>

<P>Hursomhelst, detta g&auml;ller bara f&ouml;r datorer synliga p&aring; Internet, vilket betyder de som
&auml;r direkt anslutna till Internet. </P>

<P>Om du anv&auml;nder en Internetleverant&ouml;r &auml;r din dator inte synlig. I detta fallet, finns
det ingen l&ouml;sning. Det &auml;r Internetleverantörens ansvar att installera
<FONT COLOR=#2f6400><B>GeneWeb</B></FONT>. Vid denna tidpunkt (februari 2000) har bara en
Internetleveratör installerat den. </P>
<P>S&aring;ledes, det f&ouml;ljande g&auml;ller bara de som har en direkt anslutning till Internet. </P>

<P>Om du k&ouml;r under Unix eller Windows NT (allts&aring; inte Windows 95/98), m&aring;ste du ange
ett anv&auml;ndarnamn n&auml;r du startar datorn, d&auml;r du anger ditt login namn och ditt passord.
Kanske vill du kunna logga ut utan att <FONT COLOR=#2f6400><B>GeneWeb</B></FONT> stannar. </P>

<P>Du har d&aring; tv&aring; l&ouml;sningar f&ouml;r detta problem: installation i "service" och
installation i "CGI". </P>

<HR>
<H3><font color=#2f6400>Installation i "service" </font></H3>

I denna mod beh&ouml;ver du inte ha en webbserver installerad p&aring; din dator. Gwd <EM>&auml;r</EM>
en webbserver i sig sj&auml;lvt. Den enda skillnaden mot andra servers &auml;r att den bara betjänar
genealogi.

<UL>

<LI>Om du &auml;r under Unix, ist&auml;llet f&ouml;r att skriva bara "gwd", skriv:


<PRE>
     nohup gwd 2&gt;&amp;1 &amp;             (under "sh", "ksh", "bash")
     nohup gwd &gt;&amp; nohup.out &amp;     (under "csh", "tcsh")
</PRE>

D&aring; kan du logga ut. Gwd kommer att forts&auml;tta k&ouml;ra och s&auml;nda dess utskrift till
filen "nohup.out" som du kan titta p&aring; sedan. F&ouml;r att stoppa den, titta efter dess process
nummer med kommandot "ps" och d&ouml;da den med kommandot "kill". </UL>

<P>

<UL>

<LI>Om du k&ouml;r Windows NT, m&aring;ste du installera "gwd" som en "service" genom att använda programmet "srvany.exe", du måste vara inloggad som
Administrator. Från Windows NT Ressource Kit behöver du: "srvany.exe",
"instsrv.exe", kanske "srvinstw.exe" och "delsrv.exe" också. Kopiera först
"srvany.exe" till en katalog på din dator (t.ex. C:\GeneWeb) och installera
det som en "service" (ett trevligare verktyg för det, är det grafiska
programmet "srvinstw.exe"):

<PRE>
     instsrv GeneWebServer c:\GeneWeb\srvany.exe
</PRE>


I "Services" i "Control Panel", klicka "GeneWebServer" och klicka sedan
"Startup" för att välja "Automatic" eller "Manual". I "Log On As" rutan,
välj kontot där servicen ska starta, fylla i det rätta passordet (detta
måste göras för att komma åt nätverket). <FONT COLOR=#2f6400><B>GeneWeb</B></FONT> kommer att starta genom att specifiera de följande register värdena
med "regedt32":

<PRE>
1. Under HKLM\System\CurrentControlSet\Services\GeneWebServer skapa
   en nytt värde "Parameters"
   
2. Skapa där två nya Värden (skriv REG_SZ) Application and AppDirectory, t.ex.
   Application: REG_SZ: C:\GeneWeb\gw\gwd.exe
   AppDirectory: REG_SZ: C:\GeneWeb\gw
</PRE>

Nu kan du kontrollera <FONT COLOR=#2f6400><B>GeneWeb</B></FONT> servicen
i "Control Panel" -> "Services" -> "GeneWebServer" "Startup"/"Stop" eller genom
att skriva "net start GeneWebServer" eller "net stop GeneWebServer" vid
kommando prompten. För att ta bort GeneWebServer, stoppa den och skriv
"delsrv GeneWebServer" eller "instsrv GeneWebServer remove".
</ul>

<hr>
<H3><font color=#2f6400>Installation i "CGI" </font></H3>

<P>I denna mod m&aring;ste en webbserver k&ouml;ras p&aring; din dator. "CGI"s &auml;r program som
webbservern kan starta. Endast systemadministrat&ouml;ren &auml;r beh&ouml;rig att l&auml;gga till
"CGI"s. Du m&aring;ste be denna om lov. </P>



<UL>

<LI>Under Unix, om du installerade <FONT COLOR=#2f6400><B>GeneWeb</B></FONT> i katalogen
"/home/svensson/geneweb", skapa en fil med namn "geneweb" som inneh&aring;ller f&ouml;ljande rader:



<PRE>

     #!/bin/sh
     DIR=/home/svensson/geneweb/gw
     cd $DIR
     $DIR/gwd -cgi 2&gt;/dev/null

</PRE>



G&ouml;r den exekverbar (chmod +x geneweb) och be din systemadministrat&ouml;r att installera
denna fil i "cgi" katalogen. Fr&aring;ga vilken adress som ska anv&auml;ndas. Den kommer
f&ouml;rmodligen att se ut s&aring; h&auml;r:

<PRE>
     http://blabla.xx.se/cgi-bin/geneweb
</PRE>

<P>

Om du &ouml;ppnar URLen ovan i din webbl&auml;sare, kommer du att se en sida som fr&aring;gar endast
"Base:". Mata in namnet p&aring; din databas. Du kan ocks&aring; l&auml;gga till "?b=karlsson" till
denna URL, om "karlsson" &auml;r din databas namn.

<P>

Obs:

<UL>

<LI>Om det senaste kommandot inte fungerar, &auml;r det m&ouml;jligt att webbservern inte har
&aring;tkomst r&auml;ttigheter till databasen och de andra katalogerna. G&ouml;r de f&ouml;ljande
&aring;tg&auml;rderna:

<PRE>
     cd /home/svensson/geneweb/gw
     chmod 777 . lang images base.gwb
</PRE>

<LI>

Om den svarar men &auml;r v&auml;ldigt seg, &auml;r det m&ouml;jligt att &aring;tkomsten till
din databas
&auml;r genom NFS (om du inte vet vad det betyder fr&aring;ga din systemadministrat&ouml;r). Det vore
b&auml;ttre om s&aring; inte var fallet: om m&ouml;jligt, kopiera katalogen geneweb till en lokal
disk p&aring; webbservern. Om det inte &auml;r m&ouml;jligt, l&auml;gg till optionen "-nolock" i
anropet till kommandot "gwd" f&ouml;r filen "geneweb" ovan: 

<PRE>
     $DIR/gwd -cgi -nolock
</PRE>

</UL>

</UL>

<UL>
<LI>

Under Windows NT, om du installerade <FONT COLOR=#2f6400><B>GeneWeb</B></FONT> i katalogen
"c:\program\svensson\geneweb", skapa en fil som du d&ouml;per till "gwd.arg" och som inneh&aring;ller
f&ouml;ljande rader:

<PRE>
     -hd
     c:\program\svensson\geneweb\gw
     -bd
     c:\program\svensson\geneweb\gw
     -cgi
</PRE>

<P>Dessa &auml;r de optioner som kan ges till kommandot "gwd". Skriv "gwd -help" f&ouml;r att se alla
m&ouml;jliga optioner.

<p>

Be din systemadministrat&ouml;r:

<UL>

<LI>Att installera "gwd.arg" i "cgi" katalogen.

<LI>Att kopiera filen "gwd.exe" fr&aring;n "geneweb" katalogen till denna "cgi" katalog.</UL>

<P>Fr&aring;ga vilken adress som ska anv&auml;ndas. Den kommer f&ouml;rmodligen att se ut
s&aring; h&auml;r:

<PRE>
     http://blabla.xx.se/cgi-bin/gwd.exe
</PRE>

<P>Om du &ouml;ppnar URLen ovan i din webbl&auml;sare, kommer du att se en sida som fr&aring;gar
endast "Base:". Mata in namnet p&aring; din databas. Du kan ocks&aring; l&auml;gga till "?b=karlsson"
till denna URL, om "karlsson" &auml;r din databas namn. </P>

<P>Obs: om detta senaste kommando inte fungerar, &auml;r det m&ouml;jligt att webbservern inte har
&aring;tkomst r&auml;ttigheter till databasen och de andra katalogerna. Du m&aring;ste ge l&auml;s
och skriv r&auml;ttigheter till katalogen "geneweb" och underkatalogerna "lang", "karlsson.gwb", "images"
(och "cnt" om den katalogen finns).

</UL>

<HR>
<H3><font color=#2f6400>Installation i "service" eller i "CGI"? </font></H3>

<P>Om du har m&ouml;jligheten att installera som "service" eller som "CGI", notera det f&ouml;ljande: </P>

<UL>

<LI>I CGI mod &auml;r f&ouml;rfr&aring;gningar indirekta, eftersom de m&aring;ste passera genom
webbservern, vilket kan sl&ouml;a ner behandlingen. </LI>

<LI>Under Unix &auml;r installationen i "service" enklare, eftersom den inte kr&auml;ver
till&aring;telse eller hj&auml;lp av systemadministrat&ouml;ren. </LI>

<LI>Under Windows NT, m&aring;ste du alltid fr&aring;ga din systemadministrat&ouml;r, vilken troligen
kommer att f&ouml;redra CGI mod vilken &auml;r enklare att installera och mer kontrollerbar. </LI>

<LI>Sj&auml;lvklart, om det inte finns n&aring;gon webbserver p&aring; din dator, &auml;r endast
installation under "service" m&ouml;jlig. </LI></UL>

<P><hr><br>
<center>Tillbaka till <A HREF="diruse.htm">bruksanvisningen</A></center>


<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA - GeneWeb</em></font><br>

</body>
