<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN"
            "http://www.w3.org/TR/REC-html40/loose.dtd">
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
  <title>GeneWeb - Modifiche</title>
</head>
<body background="../images/gwback.jpg">
<table border=0 width="100%">
<tr>
<td>
<a href="http://www.geneweb.org/"><img width=96
height=108 src="../images/gwlogo.png" align=left border=0 alt=GeneWeb></a>
</td>
<td align=left>
<h1><font color=#2f6400> Modifiche
</font></h1>
</td>
</tr>
</table>
</font>
<br><br>

Questo capitolo vi indica come effettuare delle modifiche a una base dati utilizzando il vostro navigatore (browser) web.
Se il proprietario della base dati vi ha attribuito una password, dovrete digitarla nella pagina di benvenuto
per aver accesso alle differenti possibilit&agrave; di aggiornamento.

<p>

Prima d'entrare nel vivo del soggetto, &egrave; importante comprendere certe nozioni basilari: in primis,
la nozione di "nome" "cognome", "numero" e poi le nozioni di "persone" e di "famiglie".
Ci&ograve; vi permetter&agrave; di chiarire il conteto dei paragrafi seguenti sugli aggiornamenti.

<ul>

<li> <a href="#FSO">1.</a> Nomi, Cognomi, Numeri.

<li> <a href="#PF">2.</a> Persone e Famiglie.

<li> <a href="#MAJ">3.</a> Accesso agli aggiornamenti.

<li> <a href="#Part">4.</a> Qualche caso particolare:

<ul>

<li> <a href="#ModC">4.1.</a> Come modificare il nome o il cognome di un figlio.

<li> <a href="#AddC">4.2.</a> Come aggiungere un figlio in una famiglia.

</ul>

<li> <a href="#Form">5.</a> Formulari.

<ul>

<li> <a href="#AddF">5.1.</a> Aggiungere una famiglia.

<li> <a href="#ModF">5.2.</a> Modificare una Famiglia.

<li> <a href="#DelF">5.3.</a> Cancellare una Famiglia.

<li> <a href="#ModP">5.4.</a> Modificare una Persona.

<li> <a href="#DelP">5.5.</a> Cancellare una Persona.

<li> <a href="#SndP">5.6.</a> Inviare un'immagine.

<li> <a href="#DelPh">5.7.</a> Cancellare un'immagine.

<li> <a href="#ChgC">5.8.</a> Cambiare il cognome dei figli.

</ul>

<li> <a href="#MrgP">6.</a> Come fondere due persone.

<li> <a href="#MrgF">7.</a> Come fondere due famiglie.

<li> <a href="#Dcln">8.</a> Lingue con declinazioni.

<ul>

<li> <a href="#Data">8.1.</a> Inserzione dei dati.

<li> <a href="#Disp">8.2.</a> Visualizzazione, documentazione.

</ul>

</ul>

<hr>


<h3><a name="FSO">
</a> <font color=#2f6400> 1. Nomi, Cognomi, Numeri </font></a></h3>

Ogni persona &egrave; indicata nella base in maniera univoca mediante il suo nome, il suo cognome e il suo numero;
quest'ultimo serve a distingure due persone aventi lo stesso nome e lo stesso cognome.
questo insieme &egrave; definito come "chiave" della persona (<a href="#note">note</a>)

<p>

In questo modo, se esistono due "Mario Rossi" nella base, potrete distinguerli mediante il numero.
Qualsiasi numero &egrave; valido e non c'&egrave; l'obbligo di cominciare da 0 o da 1,
n&eacute; di procedere per incrementi unitari. Ad esempio, prendete il vostro primo "Mario Rossi"
e attribuitegli il numero 7; al secondo "Mario Rossi" attribuite il numero 4.
Il primo sar&agrave; identificato da "Mario", "Rossi", "7" ed il secondo da "Mario", "Rossi", "4".

<p>

Siete voi stessi a scegliere questo numero, salvo se siete partiti da un file GEDCOM;
in questo caso "ged2gwb" lo avr&agrave; scelto per voi, per ogni persona della base.

<p>

Questo numero non appare che nelle pagine d'aggiornamento. Non &egrave; visibile, invece, nelle pagine normali.
In questo modo se si digita "Mario Rossi" nella pagina di benvenuto, <font color=#2f6400><b>GeneWeb</b></font> vi offrir&agrave; la scelta tra
"Mario Rossi 7" e "Mario Rossi 4", senza visualizzare i numeri.

<p>

Ciononostante, dato che siete un "guru",  visto che state effettuando degli aggiornamenti,
sappiate che potete cercare una persona mettendo un "punto" seguito dal numero fra il nome e il cognome.

Nella pagina di benvenuto potete cercare "Mario.4 Rossi" e troverete quello che possiede il numero 4.

<p>

Bisogna anche notare che:

<ul>

<li>Gli accenti e le maiuscole non contano in questa differenziazione tra persone.
Cos&igrave;, "Giufa", "Rossi", "5" d&agrave; come risultato la stessa persona che "Giuf&agrave;", "rossi", "5".

<p>

<li>Se non si indica un numero, la variabile corrispondente vale 0. Non indicarli o indicare 0 &egrave; in effetti la stessa cosa.

</ul>

E importante capire bene questo concetto, dato che molti messaggi d'errore vi dipendono. Ad esempio, dei messaggi del tipo :

<ul>

<li>"Persona esistente": vuol dire che state cercando di creare una persona la cui combinazione "nome", "cognome", "numero" 
esiste gi&agrave;. Ci&ograve; pu&ograve; accadere:

<p>

<ul>

<li>se volete creare una nuova persona

<li>se volete cambiare il nome, il cognome o il numero di una persona esistente.

</ul>

<p>

<li>"persona sconosciuta": vuol dire che nessuna persona nella base
corrisponde alla combinazione "nome", "cognome", "numero"; &egrave; il caso
quando volete collegare una persona data a una famiglia in quanto padre, madre o figlio.

</ul>

Tenete presente anche che il numero non ha nessun rapporto col numero
del nome di certi nobili: Luigi XIV non pu&ograve; avere il numero 14.
Ciononostante, non c'&egrave; alcuna controindicazione a scegliere lo stesso numero,
quando ci&ograve; &egrave; possibile: vedrete che &egrave; pi&ugrave; pratico nelle vostre manipolazioni.

Nella maggior parte dei casi, non c'&egrave; bisogno di specificare un numero.
Non mettete niente: 0 sar&agrave; attribuito automaticamente e andr&agrave; bene cos&igrave;.

<hr>
<h3><a name="PF">
</a> <font color=#2f6400>2. Persone e Famiglie </font></a></h3>

La base dati <font color=#2f6400><b>GeneWeb</b></font> comporta, internamente, due nozioni fondamentali: le persone e le famiglie:

<ul>

<li>Le persone contengono dei dati individuali come nome, cognome, numero,
le date e i luoghi di nascita, battesimo, morte, gli eventuali titoli di nobilt&agrave;, ecc. ecc.
<p>
<li>Le famiglie contengono i dati relativi a un nucleo familiare: padre, madre, figli,
data e luogo dell'eventuale matrimonio o dell'eventuale divorzio.
Tenete presente che se una persona si &egrave; sposata pi&ograve; volte, ci&ograve;
dar&agrave; origine a altrettante famiglie diverse.

</ul>

Le modifiche alla base dati sono costituite essenzialmente da aggiornamenti
delle "persone" e delle "famiglie": aggiunta, modifica, cancellazione.

<hr>
<h3><a name="MAJ">
</a> <font color=#2f6400>3. Accesso agli aggiornamenti </font></a></h3>

Se siete sicuri d'aver bien capito i due capitoli precedenti, allora potere iniziare.

<p>

Per avere accesso a un aggiornamento, potete:

<ul>

<li>Cliccare su "Aggiungere una famiglia" nella pagina di benvenuto.

<li>Cliccare su "Aggiornamento" in una scheda personale.

</ul>

Nella pagina di benvenuto, cliccando su "Aggiungere una famiglia" potete iniziare a riempire una base vuota.

<p>

Vedrete apparire un formulario per aggiungere una famiglia. Rifatevi al capitolo <a href="#AddF">Aggiungere una Famiglia</a>.

<p>

In una scheda personale, cliccando su "Aggiornamento" vedrete apparire
una pagina ove molteplici scelte vi sono proposte. Queste scelte dipendono dalla situazione familiare della persona:

<ol><li value=1> In tutti i casi, avrete la scelta tra "Modificare" e "Cancellare": si tratta della modifica o 
della cancellazione di una persona. Rifatevi ai paragrafi:

<p>

<ul>

<li> <a href="#ModP">Modificare una Persona</a>

<li> <a href="#DelP">Cancellare una Persona</a>

</ul>

<p>

Se il proprietario della base lo ha autorizzato, (vedi <a
href="start.htm#Cnf">file di configurazione</a>) potrete scegliere tra "Inviare immagine" ed eventualmente "Cancellare immagine".
Rifatevi ai paragrafi:

<p>

<ul>

<li> <a href="#SndP">Inviare immagine</a>

<li> <a href="#DelPh">Cancellare un'immagine</a>

</ul>

</ol>

<ol><li value=2>2. Se la persona &egrave; sposata, avrete, per ogni matrimonio, le scelte "Modificare/Famiglia" e "Cancellare/Famiglia". Rifatevi ai capitoli:

<p>

<ul>

<li> <a href="#ModF">Modificare una Famiglia</a>

<li> <a href="#DelF">Cancellare una Famiglia</a>

</ul>

</ol>

<ol><li value=3> Se ci sono pi&ugrave; matrimonii, avrete la scelta "Scambiare" tra ogni matrimonio;
ci&ograve; vi permette di scambiare l'ordine delle famiglie nella visualizzazione.

</ol>

<ol><li value=4> In ogni caso, questa lista familiare termina con "Aggiungere/Famiglia".
Vi ritroverete con lo stesso formulario che appare con l'opzione "Aggiungere una famiglia"
della pagina di benvenuto, salvo che la persona sar&agrave; pre-iscritta nel formulario con uno
dei genitori (secondo il sesso). Rifatevi quindi al paragrafo:

<p>

<ul>

<li> <a href="#AddF">Aggiungere una Famiglia</a>

</ul>

</ol>

<ol><li value=5> Una scelta &egrave; proposta anche per cambiare il nome dei figli.
Ci&ograve; permette di cambiare il nome e il cognome di tutti i figli di una persona in un solo formulario. Rifatevi al paragrafo:

<p>

<ul>

<li> <a href="#ChgC">Cambiare il nome dei figli</a>

</ul>

</ol>

<ol><li value=6> Per finire, se la persona non ha genitori, ci sar&agrave; l'opzione "Aggiungere/Genitori".
Ci&ograve; genera un formulario "Aggiungere/Famiglia" con la persona pre-iscritta come figlio e col cognome gi&agrave;
inserito nella zona "cognome" del padre. Rifatevi quindi al paragrafo:

<p>

<ul>

<li> <a href="#AddF">Aggiungere una Famiglia</a>

</ul>

</ol>

<p> Osservazioni:

<ul><li>

Tutte queste opzioni vi riportano sia a dei formulari da riempire, sia a delle richieste di conferma:
non farete niente di definitivo, cliccando in queste pagine; potrete sempre cambiare idea.

<p>

Cos&igrave; "Cancellare" (scelta numero 1), canceller&agrave; la persona solo se cliccherete "Ok"
nella pagina che vi sar&agrave; proposta successivamente.

</ul>

<ul><li>

Nei formulari, pu&ograve; accadere che certe parti siano automaticamente riempite.
Questo non vuol dire che non possiate modificarne il contenuto.

<p>

Cos&igrave;, in "Aggiungere/Genitori" (scelta numero 6), il cognome del padre sar&agrave; gi&agrave; fornito.
Non si tratta altro che di una comodit&agrave;, dato che &egrave; assai frequente che un
padre e suo figlio abbiano lo stesso cognome; ma se il padre ha un altro cognome, potrete facilmente cambiarlo.

</ul>

<hr>
<h3><a name="Part">
</a> <font color=#2f6400>4. Qualche caso particolare </font></a></h3>

I punti che seguono sono messi in risalto, dato che possono dar adito a delle confusioni: seguite dunque la procedura indicata.

<p>

<h4><a name="ModC">4.1.</a> Come modificare il nome o il cognome di un figlio</h4>

Esempio: nella famiglia di "Mario Rossi" e di "Gina Bianchi" uno dei figli &egrave; stato indicato come "Roberto", mentre in realt&agrave; si chiama "Filippo":
<p>

Ecco cosa bisogna fare:

<ul><li>

Andate nella scheda personale di "Roberto Rossi", cliccate su "Aggiornamento" e poi su "Modificare"
e procedete in seguito come indicato nel capitolo "Modificare una Persona" (scelta numero 1 nel capitolo 3).

</ul>

<p>

Ecco cosa non si deve assolutamente fare:

<ul><li>

Non bisogna assolutamente utilizzare "Modificare/Famiglia" (scelta numero 2 del capitolo 3).

<p>

Se lo fate e cambiate "Roberto" in "Filippo" nel formulario:

<p>

<ul>

<li>Si interromper&agrave; il legame tra "Roberto" e i suoi genitori e lui continuer&agrave;
a chiamarsi "Roberto Rossi" ma non avr&agrave; pi&ugrave; genitori.

<li>Si creer&agrave; "Filippo Rossi", se esiste e non ha gi&agrave; altri genitori, come figlio di questa coppia.

<li>Se "Filippo Rossi" non esiste nella base oppure esiste ma ha gi&agrave; dei genitori, ci&ograve; dar&agrave; un messaggio 
d'errore e nulla sar&agrave; modificato (fortunatamente).

</ul>

</ul>

<h4> <a name="AddC">4.2.</a> Come aggiungere un figlio in una famiglia </h4>

Ad esempio, nella famiglia di "Mario Rossi" e di "Gina Bianchi" volete aggingere "Umberto" come figlio:

<p>

Ecco come bisogna fare:

<ul><li>

Andate nella scheda personale di uno dei genitori, cliccate su "Aggiornamento" e poi su
"Modificare/Famiglia" (scelta numero 2 del capitolo 3); aggiungete quindi il figlio come indicato nel capitolo "Modificare una famiglia".

</ul>

Ecco cosa non si deve assolutamente fare:

<ul><li>

Non bisogna assolutamente utilizzare "Aggiungere/Famiglia" (numero 4 del capitolo 3) che non vuol dire
"aggiungere un figlio in una famiglia", bens&igrave; "aggiungere un nuovo matrimonio",
creando cos&igrave; una nuova entit&agrave; famiglia con un nuovo marito o una nuova moglie.

</ul>

<ul><li>

D'altronde, se il figlio esiste gi&agrave; nella base e si vuole aggiungerlo nella lista dei figli
di una coppia anch'essa esistente, non bisogna neppure usare "Aggiungere/Genitori" (scelta 6 del capitolo 3).

<p>

L'opzione "Aggiungere/Genitori" &egrave; destinata piuttosto ad aggiungere dei genitori
ad uno dei vostri antenati, per risalire un p&ograve; pi&ugrave; in su. Questa opzione crea anche una nuova famiglia.

</ul>

<hr>
<h3><a name="Form">
</a> <font color=#2f6400>5. Formulari </font></a></h3>


<h4> <a name="AddF">5.1.</a> Aggiungere una Famiglia </h4>

Incontrerete il formulario "Aggiungere/Famiglia":

<ul>

<li>A partire dalla pagina di benvenuto, cliccando su "Aggiungere una famiglia";
in questo caso nessuna zona del formulario sar&agrave; pre-compilata.

<li>A partire da una scheda personale, dopo aver cliccato su "Aggiornamento" e poi su "Aggiungere/Famiglia";
in questo caso le zone "nome", "cognome" e "numero" saranno precompilate per il padre o la madre in funzione del sesso della persona.

<li>Nello stesso contesto, dopo aver cliccato su "Aggiungere/Genitori", se questa scelta &egrave; possibile; in questo caso,
la zona "cognome" del padre sar&agrave; pre-compilata, cos&igrave; come le zone "nome", "cognome" e "numero" del primo (ed unico) figlio.
Notate che potete cambiare la zona "cognome" del padre se quest'ultimo porta un cognome differente da suo figlio.

</ul>

<p>

Questo formulario si comporta come "Modificare una famiglia", salvo che creer&agrave; una nuova famiglia.
Tante volte lo utilizzerete, tante famiglie saranno create.

<p>

Ci&ograve; significa che se vi rendete conto d'esservi sbagliati dopo aver convalidato un formulario,
non dovete rifare "Aggiungere/Famiglia", ma "Modificare/Famiglia".

<p>

Rifatevi quindi al paragrafo seguente per quanto riguarda il funzionamento del formulario.

<h4> <a name="ModF">5.2.</a> Modificare una Famiglia </h4>

Arriverete a questo formulario a partire da una scheda personale dopo aver cliccato su
"Aggiornamento" e poi su "Modificare/Famiglia". Il formulario sar&agrave; pre-compilato con
"cognome", "nome", "numero" del padre, della madre e dei figli, cos&igrave; come delle eventuali
ulteriori informazioni riguardanti questa famiglia.

<p>

Questo formulario funziona come "Aggiungere/Famiglia" del paragrafo precedente
(salvo che non ci sar&agrave; in questo caso creazione di una nuova famiglia).
Ci&ograve; che &egrave; detto in seguito vale quindi anche per il formulario "Aggiungere/Famiglia).

<p><strong>Compilazione del formulario</strong><p>

Tutte le zone (pre-compilate o meno) possono essere riempite, cancellate o modificate.
Dopo aver riempito, cancellato o modificato ci&ograve; che si ritiene necessario,
bisogna andare alla fine del formulario e validare i cambiamenti cliccando su "Ok".

<p>

Nelle zone ove si trovano delle persone, fate attenzione alla selezione "Collegare" e "Creare".
Secondo i casi, questa zona sar&agrave; pre-selezionata su "Collegare" o su "Creare".
Potete cambiare questa selezione in funzione di ci&ograve; che volete fare.

<ul><li>

"Collegare" significa che la persona esiste gi&agrave; nella base.
Al momento di validare le vostre modifiche, il sistema verificher&agrave; se questa persona esiste gi&agrave;
e, nel caso di un genitore, che sia del sesso giusto.

<p>

Prendete nota che, dato che si tratta di una ricerca per "chiave" (vedi il primo paragrafo),
non &egrave; necessario rispettare gli accenti e le maiuscole.

</ul>

<ul><li>

"Creare" significa che la persona non esiste nella base e che si chiede al sistema,
al momento di validare, di crearla col nome, cognome e numero indicati.

<p>

In questo caso, contrariamente a "Collegare", bisogner&agrave; mettere gli accenti e le maiuscole al posto giusto:
la persona sar&agrave; creata con l'ortografia che indicherete in questo momento.

<p>

Avete la possibilit&agrave; di indicare il sesso del figlio e la sua data di nascita.
Per gli altri dati personali, dovrete fare un "aggiornamento" pi&ugrave; tardi a partire dalla pagina della persona.

</ul>

<p>

Al momento di validare, i campi "figli" la cui zona "nome" &egrave;  vuota sono ignorati,
qual che sia il contenuto degli altri campi. Come se non esistessero.

<p>

Per i figli, il campo "cognome" &egrave; facoltativo se assente; &egrave;
il cognome del padre che viene preso in considerazione.

<p><strong>Modifiche diverse</strong><p>

Ecco le diverse modifiche che potete effettuare:

<ul><li>

<strong>Per aggiungere un figlio</strong>, se non esiste una zona libera per farlo, cliccare
prima di tutto sul bottone "Inserire/Figlio" in funzione del posto che volete fargli occupare
nella famiglia. Poi cliccate su "Ok" alla fine del formulario.

<p>

Nota: questa operazione non valider&agrave; subito il formulario.
Il sistema vi proporr&agrave; un nuovo formulario con un posto riservato al figlio o ai figli che volete aggiungere.

<p>

Fate quindi attenzione: per tanto che cliccherete su "Inserire/Figlio", e poi su "Ok",
non ci sar&agrave; validazione, solo un nuovo formulario, un p&ograve; pi&ugrave; grande.
Non bisogna dunque interpretare questo bottone come "aggiungi il figlio che ho appena descritto":
il sistema se ne render&agrave; ben conto, non dubitate.

<p>

Il figlio che state per inserire nella zona che gli avete attribuito forse esiste
gi&agrave; nella base. In questo caso scegliete "Collegare" al posto di "Creare".

</ul>

<ul><li>

<strong>Per cancellare un figlio</strong>, cancellate semplicemente il suo nome.
Come &egrave; stato detto precedentemente, le caselle cui la zona "nome" &egrave; vuota vengono ignorate
al momento della validazione. Notate che ci&ograve; non canceller&agrave; la persona;
la persona sara cancellata dalla lista dei figli e si ritrover&agrave; senza genitori.

</ul>

<ul><li>

<strong>Per cambiare il posto di un figlio</strong>, la cosa pi&ugrave; semplice &egrave;
di cliccare su "Inserire/Figlio" nel posto dove volete inserirlo e in seguito cliccare su "Ok".
Nel nuovo formulario che vi viene proposto, mettete il figlio nella casella vuota, selezionate
"Collegare" al posto di "Creare" che vi &egrave; proposto e cancellate il suo nome nella vecchia casella.

</ul>

<ul><li>

<strong>Per scambiare di posto due figli</strong> potere procedere nello stesso modo,
passando da una nuova casella per poter fare un copia-incolla (senza dimenticare di selezionare "Collega");
non dimenticate l'eventuale numero.

<p>

Potete anche farlo direttamente, senza usare "Inserire/Figlio": il problema &egrave;
che dovrete ricordarvi del nome di uno dei due quando lo cancellerete per mettere l'altro al suo posto.

</ul>

<p><strong>Confermare le scelte</strong><p>

Le scelte e i cambiamenti affettuati vengono confermati cliccando su "Ok".
Fintanto che non l'avrete fatto, nessun cambiamento sar&agrave; riportato nella base.

<p>

Notate che, come abbiamo gi&agrave; detto, se avete selezionato uno o pi&ugrave;
"Inserire/Figli" vi sar&agrave; proposto solo un nuovo formulario: non si tratter&agrave; dunque di una conferma propriamente detta.

Quando la conferma viene realmente effettuata, dovete veder apparire una nuova pagina, il cui titolo sar&agrave;:<p>

Caso 1: <strong>Famiglia aggiunta o modificata</strong><p>

Dovrete allora vedere i cognomi dei due genitori sui quali potrete cliccare.

<p>

Potrete forse vedere anche delle osservazioni. Queste ultime possono riguardare
delle incoerenze di date o d'ordine dei figli. La modifica verr&agrave; fatta in ogni caso, ma &egrave; preferibile corregerle subito.

<p>

Cliccando su uno dei genitori, vedrete apparire la sua scheda personale.
Ma il vostro aggiornamento non sar&agrave; necessariamente visibile.
I navigatori (browsers) Web conservano spesso in memoria le pagine appena consultate
e vi proporranno probabilemente la precedente versione (ossia la pagina tale quale era prima delle
vostre modifiche). Selezionate "aggiorna" nel vostro navigatore (browser) web e potrete infine visualizzare le vostre modifiche.

</ul>

<ul><li>
Caso 2: <strong>Erreur</strong><p>

La pagina indicher&agrave; l'errore incontrato. Ritornate indietro e correggete.
Potete anche abbandonare le modifiche... basta non fare nulla e continuare a navigare nella base.

<p>

Se il messaggio d'errore vi indica che una certa persona esiste gi&agrave;,
significa che avete voluto creare una persona la cui combinazione "nome", "cognome", "numero" esiste gi&agrave; nella base.

<p>

Soluzione:

<p>

<ul>

<li>Se volevate effettivamente creare una nuova persona, tornate indiatro e
cambiate il suo numero. notate che il messaggio di errore vi ha indicato il primo numero libero,
quindi disponibile. Sceglietelo o prendetene un altro. Se vi sono pi&ugrave; persone aventi lo stesso nome e cognome, la loro lista vi viene fornita.

<li>Se invece vi rendete conto che stavate per aggiungere di nuovo una persona gi&agrave;
esistente, tornate indietro e cambiate "Creare" con "Collegare".

</ul>

<p>

Se il messaggio di errore vi indica che una certa persona non esiste, significa che avete cliccato su
"Collegare" riferendovi a una persona inesistente. Forse vi siete sbagliati sul suo numero,
oppure volevate invece creare una nuova persona ?

</ul>

<h4> <a name="DelF">5.3.</a> Cancellare una Famiglia </h4>

Vi ritroverete in questo formulario a partire da una pagina personale
dopo aver cliccato su "Aggiornamento" e poi su "Cancellare/Famiglia".

<p>

Il formulario contiene solo il bottone "Ok" per permettervi di effettuare la cancellazione. Potete ancora cambiare idea.

<p>

Se cliccate su "Ok", una nuova pagina appare; la pagina conterr&agrave; solo il titolo "Famiglia cancellata".

<p>

La famiglia viene cancellata dalla base: padre, madre e figli sono "dispersi".
Nessuno di loro viene cancellato dalla base. Padre e madre non sono pi&ugrave; considerati come sposati,
non hanno pi&ugrave; i figli che avevano (possono averne altri in altri matrimoni; questi restano loro attribuiti), i figli non hanno pi&ugrave; genitori.

<h4> <a name="ModP">5.4.</a> Modificare una Persona </h4>

Arriverete a questo formulario partendo da una pagina personale
dopo aver cliccato su "Aggiornamento" e poi su "Modificare". Il formulario conterr&agrave; gi&agrave; tutte le informazioni individuali della persona.

<p><strong>Compilazione del formulario</strong><p>

Tutte le zone (riempite oppure no), possono essere riempite, cancellate o modificate.
Dopo aver compiuto le modifiche necessarie, bisogner&agrave; andare alla fine del formulario e cliccare su "Ok".

<p>

Un certo numero di bottoni portano la dicitura "Inserire/...": "Inserire/Soprannome", "Inserire/Alias", ecc.

<p>

Attenzione: non si tratta di aggiungere il soprannome o un alias alla persona, ma 
di chiedere un nuovo formulario con un posto riservato a un altro soprannome, a un altro alias, ecc.

<p>

In questo modo, se cliccate du "Ok" dopo aver selezionato uno o pi&ugrave; di questi bottoni, 
un nuovo pi&ugrave; grande formulario vi sar&agrave; proposto e non verr&agrave; effettuata alcuna modifica.

<p>

Se, quindi, dopo un "Ok", vi vedete proposto ancora un formulario di modificazione, voul dire  
che la vostra modifica non &egrave; stata presa in considerazione (almeno non ancora) e questo, anche se avete riempito una quantit&agrave; di campi.

<p><strong>Campi diversi</strong><p>

Notate bene il senso di diversi campi e il particolare l'uso di "nome pubblico" "qualificativo", 
"alias", ecc., che hanno ognuno un senso ben preciso.

<ul><li>

<strong>Nome</strong> e <strong>Cognome</strong> hanno il senso usuale che si d&agrave; loro. Col <strong>numero</strong>, 
la persona ha una "chiave d'accesso" unica come abbiamo detto all'inizio di questo capitolo.

<p>

Vi consigliamo di mettere il nome usuale nella zona nome. Gli altri nomi (nomi completi, altri nomi possibili, altre ortografie di nomi, 
soprannomi dati dai parenti prossimi) devono piuttosto essere indicati nei campi "alias" o "altro(i) nome(i)" (vedere pi&ugrave; avanti). 
I nomi con numero delle persone nobili o di famiglia reale devono andare piuttosto nel campo "nome pubblico".

<p>

Questo perch&eacute; il nome &egrave; contabilizzato nella lista dei nomi. Dunque, &egrave; possibile sapere qual'&egrave; il nome pi&ugrave; 
frequente, quali sono le persone che portano lo stesso nome, ecc. Gli altri tipi di nomi rischierebbero di apparire un unica volta 
e disorganizzerebbero queste liste.

</ul>

<ul><li>

<strong>Nome pubblico</strong> &egrave; il nome col quale la persona &egrave; pi&ugrave; conosciuta. 
Esempio: "Luigi XIV" (il suo nome era "Luigi" e il suo cognome "di Borbone").

<p>

Le persone che hanno un nome pubblico sono accessibili nella base tramite questo nome pubblico.

<p>

Se una persona ha un nome pubblico, questo sar&agrave; usato come titolo della sua scheda personale, 
in luogo di "Nome Cognome", i quali saranno indicati subito dopo, in pi&ugrave; piccolo.

</ul>

<ul><li>

<strong>Immagine</strong> &egrave; un file ".gif", ".jpg" o ".png" associato alla persona e che sar&agrave; visualizzato nella sua scheda personale. 
Pu&ograve; essere anche una URL (iniziante con "http://...") oppure solo un nome di file, che il sistema cercher&agrave; nella directory "images", 
sub-directory "base" (ove "base" &egrave; il nome della base") al momento di visualizzarlo.

<p>

Se non indicate il nome di un file, verr&agrave; proposto un nome pre-determinato.

<p>

Questo nome &egrave; costituito dal nome, da un punto, dal numero, da un'altro punto, dal cognome, tutto in minuscole, 
senza accenti. Gli spazi sono convertiti in "_".

<p>

Ad esempio, la persona chiamata "Anne-C&eacute;cile Dupont de Nemours" avr&agrave; come nome d'immagine:

<pre>
anne_cecile.0.dupont_de_nemours
</pre>

<p>

<font color=#2f6400><b>GeneWeb</b></font> cercher&agrave; un file con questo nome seguito 
dall'estensione ".gif", ".jpg" o ".png" nella directory delle immagini della base citata prima.

</ul>

<ul><li>

<strong>Qualificativo</strong> &egrave; un soprannome attribuito alle persone celebri. Come "il Grosso" in "Luigi VI il Grosso".

<p>

Le persone sono accessibili tramite questo qualificativo al posto del loro cognome. Cos&igrave;, "Luigi VI il Grosso" &egrave; 
accessibile tramite "Luigi VI" (nome pubblico), "Luigi VI il Grosso", "Luigi Capeto", ecc. Notiamo che "il Grosso" non &egrave; 
considerato come un cognome in s&egrave;.

<p>

Ci possono essere molteplici qualificativi: "Guglielmo il Conquistatore" &egrave; detto anche "Guglielmo il Bastardo". 
Ci vorr&agrave; quindi una zona "qualificativo" contenente "il Conquistatore" ed un'altra contenente "il Bastardo". 
Di qui l'utilit&agrave; di "Inserire/Qualificativo".

<p>

Se c'&egrave; un qualificativo, il nome pubblico (o il cognome se non c'&egrave; nome pubblico) seguito dal qualificativo 
saranno visualizzati come titolo nella scheda personale, in luogo de "Nome Cognome", che saranno indicati sotto in pi&ugrave; piccolo.

</ul>

<ul><li>

<strong>Alias</strong> &egrave; un nome col quale la persona &egrave; conosciuta, 
senza che questo sia un nome alternativo (come il "nome pubblico" ad esempio).

<p>

Cos&igrave;, "Aurore Dupin" &egrave; conosciuta sotto il nome di "George Sand". Allo stesso modo, "Anna-Maria d'Orl&eacute;ans", figlia di "Filippo I" 
e nipote di "Luigi XIV" &egrave; detta "Mademoiselle de Valois".

<p>

Notiamo che l'alias forma un tutto e non &egrave; possibile accettare delle combinazioni come 
"George Dupin" o "Aurore Sand", "Anna-Maria de Valois" o "Mademoiselle d'Orl&eacute;ans".

<p>

Se ci troviamo in presenza di uno o pi&ugrave;  alias, essi vengono visualizzati in grassetto sopra il titolo della scheda personale, 
ma in caratteri pi&ugrave; piccoli.

</ul>

<ul><li>

<strong>Nome alias</strong> pu&ograve; essere utilizzato per designare diverse informazioni, come:

<p>

<ul>

<li>I nomi completi come risultano allo stato civile.

<li>I diminutivi o nomignoli utilizzati in famiglia . "Tony" al posto di "Antonio".

<li>Altri nomi o gli stessi nomi con una ortografia diversa, nel caso di persone vissute 
molto tempo fa e di cui non si &egrave; sicuri del nome o il cui nome &egrave; scritto diversamente secondo le fonti.

</ul>

<p>

Si possono utilizzare molti "nomi alias"

<p>

Gli "altri nomi" possono essere utilizzati al posto del nome nella formulazione di richieste, 
ma non sono considerati dei nomi veri e propri, cio&egrave; non sono calcolati nelle liste per nome.

<p>

Se esistono degli "altri nomi", sono visualizzati nella scheda personale, in piccolo sotto il titolo.

</ul>

<ul><li>


<strong>Cognome alias</strong> pu&ograve; servire da cognome alternativo, se si vuol aggiungere un'altra versione 
del cognome con, ad esempio, un'ortografia differente.
Il suo uso non &egrave; frequente.

</ul>

<ul><li>

<strong>Nascita</strong> permette d'indicare date e luoghi di nascita e di battesimo. Viene usato senza particolari accorgimenti.

<strong>Morte</strong> permette d'indicare delle informazioni sulla morte. Niente da osservare a parte la nozione di 
"scelta automatica" che spieghiamo in seguito.

<p>

La "scelta automatica" si presenta quando la selezione del primo menu della zona "morte" presenta un "-". 
Questo segno indica che non si sa se questa persona &egrave; morta o no.

<p>

In questo caso, non indicherete n&egrave; la data n&egrave; il luogo della morte ed il sistema sceglier&agrave; per voi se 
questa persona &egrave; morta o no in funzione della data di nascita: se ha meno di 80 anni, sceglier&agrave; "non morto", tra 81 e 120 anni 
sceglier&agrave; "non so" e a pi&ugrave; di 120 anni sceglier&agrave; "morto".

<p>

Se la scelta automatica non vi conviene, potete selezionare voi stessi la voce che pi&ugrave; vi aggrada nel primo menu, al posto del "-".

<p>

Notate che le persone la cui data ie morte &egrave; uguale a "non so" non avranno la loro et&agrave; calcolata nella loro 
scheda personale e negli anniversari. Quindi, se una persona ha tra 80 e 120 anni e non &egrave; morta, selezionate, "non morta".

</ul>
<ul><li>

<strong>Professione</strong>. Indicate la professione svolta dalla persona. Se volete aggiungere dei titoli nobiliari, 
utilizzate piuttosto il seguente campo "titoli".

</ul>

<ul><li>

<strong>Titoli</strong> contiene i titoli nobiliari. Possono essercene molti per una stessa persona. Per avere un formulario con pi&ugrave; 
titoli, cliccate su uno o pi&ugrave; "Inserire/Titolo", andate alla base del formulario e cliccate su "Ok".

<p>

I titoli sono composti di due parti: il titolo stesso e il luogo. Il titolo propriamente detto contiene la denominazione: "conte", "duca", "re" ecc. 
Il luogo contiene il complemento "d'Angi&ograve;", "di Borgogna", "di Francia", ecc.

<p>

Non dimenticate l'articolo determinativo: alla visualizzazione, si osserver&agrave; una combinazione tra la denominazione e il luogo: 
"conte d'Angi&ograve;", "duca di Borgogna", "re di Francia"; si tratter&agrave; di zone cliccabili che permetteranno l'accesso a 
tutte le persone della base aventi questo titolo.

<p>

La separazione tra queste due nozioni ci permetter&agrave; di selezionare tutti i "conte", tutti i "duca", tutti i "re", oppure, tutti i titolo che finiscono con "d'Angi&ograve;", "di Borgogna", "di Francia", ecc.

<p>

Il campo "nome" permette di associare un nome pubblico al titolo. Cos&igrave; "Carlo Quinto" si chiama "Carlo Primo", 
come "re di Spagna", "Carlo IV" come "re di Sicilia", ecc.

<p>

Il campo "ennesimo" viene utilizzato per i titoli precisati da un numero. Esempio: "Terzo conte di Warwick"; si potr&agrave; 
inserire la cifra "3". Non confondete con "Luigi XIV", il cui numero indica che si tratta del quattordicesimo Luigi della casata 
e non del quattordicesimo re di Francia.

<p>

Il bottone "Titolo principale" permette d'indicare, quando si visualizza questa persona in modo semplificato 
(nella pagina della moglie, ad esempio, o in quella di uno dei figli), quale titolo deve essere visualizzato. 
La cosa &egrave; rilevante solo se la persona ne possiede molteplici.

<p>

I due campi seguenti danno le date di inizio e fine del regno.

<p>

Per cancellare un titolo, basta cancellare il contenuto del primo campo "Titolo".

<p>

</ul>

<ul><li>

<strong>Accesso</strong> permette di precisare l'accesso alle informazioni personali. Ci&ograve; si applica alle persone 
"attuali", ovvero a quelle le cui date di nascita, morte, ecc., sono comprese in un arco di 100 anni:

<p>

<ul>

<li>Le persone che posseggono un titolo nobiliare o figlie di qualcuno che possegga un titolo nobiliare, sono considerate come 
delle persone "pubbliche" e quindi le loro informazioni personali vengono sempre visualizzate.

<li>Se si seleziona "pubblico", le informazioni personali vengono sempre visualizzate, che la persona abbia o no dei titoli.

<li>Se si seleziona "privato", le informazioni personali non vengono visualizzate, anche se la persona possiede dei titoli.

</ul>

<p>

Inserendo una password "wizard" o "amico" si visualizzano tutte le informazioni personali.

</ul>

<ul><li>

<strong>Note</strong> contiene le note sulla persona. Al momento di visualizzare la sua scheda, questo testo sar&agrave; visualizzato 
senza mai andare a capo. Se volete andare a capo, inserite "br" prima del periodo successivo.

</ul>

<ul><li>

<strong>Fonti</strong> permette di annotare delle brevi informazioni sulla natura delle vostre fonti: un nome, una sigla, un titolo di libro, 
o un codice personale. Potrete ricordarvi da dove avete ricavato le informazioni.

<p>

Questo campo non &egrave;  previsto per delle informazioni lunghe del tipo "copia di un documento trovato in comune"; utilizzate per questo il campo 
"Note", spiegato in seguito.

</ul>

<p>

<strong>Conferma</strong>

La conferma dei dati digitati ha luogo solo quando cliccate su "Ok". Fintanto che non l'avrete fatto, nessuna modifica verr&agrave; apportata alla base.

<p>

Notate bene che, come abbiamo gi&agrave; detto, se avete selezionato uno o pi&ugrave; "Inserire/...", vi sar&agrave; proposto un nuovo 
formulario in luogo della validazione propriamente detta.

<p>

Dopo aver effettuato una conferma, vedrete apparire una nuova pagina, il cui titolo sar&agrave;:

<ul><li>

Caso 1: <strong>Persona modificata</strong>

Vedrete il nome della persona appena aggiunta sul quale potrete cliccare.

<p>

Forse vedrete anche degli avvertimenti concernenti delle incongruenze di date. La modifica sar&agrave; 
effettuata ugualmente ma &egrave; meglio correggerle subito.

<p>

Cliccando sulla persona vedrete apparire la sua scheda personale. Il vostro aggiornamento non sar&agrave; forse visibile. 
I navigatori (browser) Web mantengono spesso in memoria delle pagine visualizzate precedentemente e, al momento della vostra riciesta, 
vi proporranno la pagina quale era prima delle vostre modifiche. Cliccate su "Ricaricare la pagina" nel vostro navigatore 
per obbligarlo a caricare in memoria l'ultima versione della pagina e quindi visualizzare le vostre modifiche.

</ul>

<ul><li>

Caso 2: <strong>Errore</strong>

La pagina indicherà l'errore riscontrato. Tornate indietro e correggete. Potete anche abbandonare la modificazione... non facendo nulla e 
limitandovi a continuare a percorrere la vostra base di dati.

<p>

Se il messaggio d'errore indica che la persona esiste gi&agrave;, vuol dire che avete modificato il nome, 
il cognome o il numero (cosa che avete perfettamente il diritto di fare), ma che la vostra nuova scelta entra in conflitto 
con un'altra persona presente nella base.

<p>

Soluzione: tornate indietro e cambiate il numero. Notate che il messaggio d'errore vi ha indicato il primo numero libero, 
dunque disponibile. Potete scegliere quello proposto oppure un'altro. Se vi sono più persone con lo stesso nome, la loro lista viene visualizzata.

</ul>

<h4> <a name="DelP">5.5.</a> Cancellare una Persona </h4>

Incontrerete questo formulario a partire da una pagina personale, dopo aver cliccato su "Aggiornamento" e poi su "Cancellare".

<p>

Il formulario contiene solo il bottone "Ok" per permettervi di effettuare effettivamente la cancellazione. Potete ancora far marcia indietro.

<p>

Se cilccate su "Ok", verr&agrave; visualizzata una nuova pagina che contiene solamente il titolo "Persona cancellata".

<p>

La persona in questione non &egrave; del tutto cancellata. Semplicemente, vengono cancellati i suoi dati personali 
(compreso il nome e il cognome) e il collegamento coi suoi genitori.

<p>

Ma esiste sempre una "entit&agrave; persona" collegata al suo eventuale coniuge e ai suoi eventuali figli.


<h4> <a name="SndP">5.6.</a> Inviare un'immagine </h4>

Incontrerete questo formulario a partire da una pagina personale, dopo aver cliccato su "Aggiornamento" e poi su "Inviare immagine", 
a condizione che il proprietario della base ve ne abbia dato l'autorizzazione e che il campo "immagine" della persona sia vuoto.

<p>

In effetti si tratta d'inviare un file "gif", "jpeg" o "png" che sar&agrave; associato alla persona. 
Se questa persona aveva gi&agrave; un'immagine, quella che invierete la rimpiazzer&agrave;.

<p>

Nota: se il campo "immagine" della persona non &egrave; vuoto, non avrete accesso a "Inviare immagine". 
Se volete farlo in ogni caso, fate "Aggiornamento" e poi "Modificare Persona" e cancellate il contenuto del campo "Immagine".


<h4> <a name="DelPh">5.7.</a> Cancellare un'immagine </h4>

Incontrerete questo formulario a partire da una pagina personale, dopo aver cliccato su "Aggiornamento" e poi su "Cancellare immagine", 
a condizione che il proprietario della base ve ne abbia dato l'autorizzazione.

<p>

Se cliccherete su "Ok", l'imagine associata alla persona viene cancellata.

<h4><a name="ChgC">5.8.</a> Cambiare il cognome dei figli.</h4>

Incontrerete questo formulario a partire da una pagina personale, dopo aver cliccato su "Aggiornamento" e poi su "Cambiare il cognome dei Figli".

<p>

Tutti i figli della persona sono visualizzati. E possibile modificare il nome, il cognome e il numero di ogni figlio.

<p>

Un aiuto interessante: se si cancella il cognome di un figlio, quest'ultimo prenderà automaticamente quello del padre.

<p>

Questo puo essere comodo per cambiare il cognome a tutto un ramo: si cambia con "Modificare Persona" il cognome dell'antenato. 
Poi si applica "Cambiare il Cognome dei Figli" sull'antenato cancellando semplicemente in questo formulario i cognomi dei suoi figli, 
cosa che costituisce in s&egrave; una operazione assai rapida. In seguito si ricomincia con i figli.

<p>

Ce se ne puo servire anche per correggere il cognome di un figlio di una famiglia. 
Ma se si deve fare solo per un figlio, è meglio utilizzare "Modificare Persona".

<p>

<hr>
<h3><a name="MrgP">
</a> <font color=#2f6400>6. Come fondere insieme due persone </font></a></h3>

Questo capitolo descrive il modo di unificare due persone in una base di dati, nel caso in cui vi avreste per caso inserito due volte la stessa persona.

<p>

Nota: non parleremo di come unificare due <strong>basi di dati</strong>; questo argomento sar&agrave; trattato altrove.

<p>

La fusione di due persone &egrave; un precedimento interamente "manuale", ma necessario dato che poi avrete una base di dati coerente.

<p>

Il principio è il seguente:

<p><ul><li>Selezionate le due persone da unificare. Il problema nasce al livello dei rispettivi genitori. Se i due hanno dei genitori, 
bisogner&agrave; prima unificare i genitori. Lo stesso principio si applica ai genitori dei genitori e cosi via...

<p>

Bisogna quindi risalire il ramo fintanto che si trovano degli antenati "unificabili". <font color=#2f6400><b>GeneWeb</b></font> fa il lavoro per voi: 
vi indicher&agrave; tutti gli antenati che possono essere unificati.

<p>

Ecco come procedere. Seguite le istruzioni che diamo in seguito:

<p>

<ul><li>La cosa migliore &egrave; di aprire due finestre distinte nel vostro navigatore (browser) web.</ul>

<p><ul><li>Nella finestra di sinistra, cercate la prima persona da fondere.</ul>

<p><ul><li>Nella finestra di destra, cercate la seconda persona.</ul>

<p><ul><li>Eseguite un "Aggiornamento" in entrambe le finestre.</ul>

<p><ul><li>Nella finestra di sinistra, eseguite "Fondere".</ul>


<p><ul><li>Nel formulario che vi &egrave; proposto, inserite il nome, un punto, il numero e il cognome della seconda persona. 
Troverete queste informazioni nel titolo della finestra di destra. Meglio ancora, potete fare un "copia/incolla".</ul>

<p><ul><li>Cliccate su "Ok". A partire da questo momento, la finestra di destra non serve pi&ugrave;, potete chiuderla.</ul>

<p><ul><li>Se le due persone sono immediatamente "unificabili" (una almeno non ha genitori), <font color=#2f6400><b>GeneWeb</b></font> 
vi propone di unificarle. Altrimenti, vi avverte che dovete prima unificare tale o tale antenato, tale o tale famiglia.</ul>

<p><ul><li>Se si tratta di unificare delle <strong>persone</strong> (le persone stesse o i loro antenati):

<p>

<ul>

<li>Nel caso di antenati, nella parte bassa del formulario sono indicati i due rami che saranno unificati. Col vostro aiuto, 
il programma fonder&agrave insieme dapprima la parte alta, poi la mediana e infine la parte bassa dei rami, quelli cio&egrave; che avete 
originariamente voluto unificare.

<li>Il formulario contiene i valori che entrano in conflitto tra le due persone da unificare. Scegliete e cliccate su "Ok".

<li>Vi viene proposto allora un formulario "Fondere/Persona" che si presenta come un "Modificare/Persona". 
Verificate i diversi campi, aggiungete, modificate, sopprimete cio che volete e cliccate su "Ok".

<li>Ci siamo, le due persone sono fuse insieme. Se si tratta di antanati delle vostre due persone di partenza, la pagina vi propone di continuare 
ad unificarle. Cliccate su "continuare a fondere". Procedete cos&igrave; fin quando avrete unificato le vostre due persone iniziali.

</ul>

</ul>

<p><ul><li>Se si tratta di fondere due <strong>famiglie</strong>:

<p>

<ul>

<li>Questo pu&ograve; succedere quando si &egrave; unificata una coppia di antenati. In questo caso vi restano sempre due famiglie. 
Come se la coppia in questione si fosse sposata due volte. Bisogna quindi riunire le due famiglie in una sola.

<li>Dapprima, come nel caso visto prima dell'unificazione di due persone, selezionate gli eventuali valori in conflitto e cliccate su "Ok".

<li>Vi sar&agrave; quindi proposto un formulario "Fondere/Famiglia" che assomiglia a "Aggiungere/Famiglia" o a "Modificare/Famiglia". 
Eseguite l'aggiornamento che desiderate. Notate che certi figli possono apparire in doppio. Non occupatevene ora, li unificherete pi&ugrave; tardi.

<li>Cliccate su "Ok" e le due famiglie saranno effettivamente unificate. Proseguite nell'unificazione cliccando su "continuare a unificare".

</ul>

</ul>

<p><ul><li>Notate che nei formulari di fusione di persone o di famiglie, le persone visualizzate sono cliccabili. 
Cliccando sul loro nome potrete verificare se l'unificazione si &egrave; svolta correttamente 
(ritornate in seguito alla pagina precedente utilizzando le frecce del vostro navigatore).</ul>

<p><ul><li>Notate anche che potete smettere in qualsiasi momento: la vostra base rimane coerente e le unificazioni gi&agrave; effettuate 
vengono salvate. Potete effettuare in seguito la fusione delle due persone, il programma ricomincer&agrave; dal punto dove avrete 
abbandonato l'operazione.</ul>

<hr>
<h3><a name="MrgF">
</a> <font color=#2f6400> 7. Come fondere due famiglie </font></a></h3>

Per fondere due famiglie, unificate in primo luogo i padri (se sono differenti) e le madri (se sono differenti) seguendo le istruzioni del capitolo precedente.

<p>

Successivamente, partendo dalla pagina del padre o da quella della madre, eseguite "Aggiornamento". Se le due famiglie sono contigue, 
vedrete che c'&egrave; un "Fondere" tra di loro. Cliccateci sopra. Se non sono contigue, utilizzare "Invertire" tante volte quanto sia necessario.

<hr>
<h3><a name="Dcln">
</a> <font color=#2f6400> 8. Lingue con declinazioni </font></a></h3>

Certe lingue hanno delle declinazioni, ossia i nomi propri ed i nomi comuni si scrivono differentemente a seconda della loro posizione nella frase. 
Questo &egrave; il caso del ceco, una delle lingue utilizzabili in <font color=#2f6400><b>GeneWeb</b></font>.

<p>

Cosi, le espressioni italiane:

<pre>
sposato con Vladana
cugino di Vladana
</pre>

si traducono in ceco con:

<pre>
si vzal Vladanu
bratranci Vladany
</pre>

<p>

Il nome ceco "Vladana" a quindi pi&ugrave; forme: "Vladana" &egrave; il nominativo, "Vladanu" l'accusativo e "Vladany" il genitivo.

<h4><a name="Data">8.1.</a> Input di dati</h4>

Nel lessico della lingua e nei dati, i casi sono indicati da una lettera tra due <code>" : "</code>.

<p>

In ceco, l'accusativo e il genitivo sono rappresentati rispettivamente da:

<pre>
:a:
:g:
</pre>

<p>

In un formulario di aggiornamento, al momento di inserire un nome o un cognome con le sue declinazioni, 
bisogna indicare il nominativo seguito dal codice e dalla forma per ogni caso. Ad esempio, per la nostra "Vladana":

<pre>
Vladana :a: Vladanu :g: Vladany
</pre>

Sono possibili due forme abbreviate:

<ul>

<li>Una forma cominciante con '+' indica che bisogna partire dal nominativo; in questo modo, "Adler:g:+a" vuol dire che in genitivo di "Adler" &egrave; "Adlera".

<li>Una forma cominciante con '-' indica puse che bisogna partire dal nominativo, ma togliendo in seguito l'ultima lettera ('--' per le due ultime lettere, ecc.)

</ul>

La forma con '-' &egrave; utilizzabile per "Vladana"

<pre>
Vladana:a:-u:g:-y
</pre>

<h4><a name="Disp">8.2.</a> Visualizzazione, documentazione</h4>

In fase di visualizzazione &egrave; visibile abitualmente solo il nominativo. Le altre forme saranno utilizzate 
solo se lo chiedono le espressioni della lingua.

<p>

Nella navigazione con una lingua senza declinazione, sar&agrave; utilizzato sistematicamente il nominativo.

<p>

La forma completa (con la descrizione completa delle forme) appare solo nei formulari di aggiornamento.

<p>

Non esiste una documentazione dettagliata sui differenti casi utilizzati dato che questi dipendono dalla lingua. 
La cosa migliore consiste in dare un'occhiata al lessico. Quest'ultimo &egrave; consultabile a partire dalla 
pagina di benvenuto cliccando su "lessico" in basso alla pagina. Verificare le espressioni corrispondenti alla vostra lingua.

<p>
<hr>
<br>

<font size=-1><a name=note>Nota </a>: nella "chiave" di una persona, tutte le vocali accentuate sono considerate 
come i loro equivalenti non accentuati; GeneWeb suppone che si tratta di una codifica delle lingue dell'Europa Occidentale (iso-8859-1). 
Tutto questo dispositivo rischia di non funzionare o di produrre dei risultati strani, se provate delle altre codifiche 
(ad esempio il cirillico, l'ebraico, il cinese o il ceco).</font>

<p>
<hr>
<br>
<center>Ritorna a <a href="diruse.htm">Istruzioni per l'uso </a></center>

<p><hr><font size=-1><em>Copyright (c) 1998-2006 INRIA -
GeneWeb</em></font><br>
</body>